// npx @vscode/test-web --extensionDevelopmentPath=

const vscode    = require('vscode');



//#region 拼音字典
// 在 pinyinDict 中添加所需的中文和对应的拼音
const pinyinDict = {
    "规" : "Gui",
    "则" : "Ze",
    "事" : "Shi",
    "件" : "Jian",
    "条" : "Tiao",
    "动" : "Dong",
    "作" : "Zuo",
    "变" : "Bian",
    "量" : "Liang",
    "全" : "Quan",
    "局" : "Ju",
    "玩" : "Wan",
    "家" : "Jia",
    "子" : "Zi",
    "程" : "Chen",
    "序" : "Xu",
    "持" : "Chi",
    "续" : "Xu",
    "每" : "Mei",
    "名" : "Ming",
    "造" : "Zao",
    "成" : "Cheng",
    "伤" : "Shang",
    "害" : "Hai",
    "受" : "Shou",
    "到" : "Dao",
    "治" : "Zhi",
    "疗" : "Liao",
    "击" : "Ji",
    "退" : "Tui",
    "最" : "Zui",
    "后" : "Hou",
    "一" : "Yi",
    "阵" : "Zhen",
    "亡" : "Wang",
    "参" : "Can",
    "与" : "Yu",
    "消" : "Xiao",
    "灭" : "Mie",
    "加" : "Jia",
    "入" : "Ru",
    "比" : "Bi",
    "赛" : "Sai",
    "离" : "Li",
    "开" : "Kai",
    "双" : "Shuang",
    "方" : "Fang",
    "队" : "Dui",
    "伍" : "Wu",
    "所" : "Suo",
    "有" : "You",
    "栏" : "Lan",
    "位" : "Wei",
    "等" : "Deng",
    "待" : "Dai",
    "直" : "Zhi",
    "跳" : "Tiao",
    "过" : "Guo",
    "根" : "Gen",
    "据" : "Ju",
    "中" : "Zhong",
    "止" : "Zhi",
    "如" : "Ru",
    "为" : "Wei",
    "假" : "Jia",
    "真" : "Zhen",
    "循" : "Xun",
    "环" : "Huan",
    "断" : "Duan",
    "继" : "Xu",
    "调" : "DiaoTiao",
    "用" : "Yong",
    "始" : "Shi",
    "添" : "Tian",
    "生" : "Sheng",
    "命" : "Ming",
    "池" : "Chi",
    "移" : "Yi",
    "除" : "Chu",
    "的" : "De",
    "值" : "Zhi",
    "整" : "Zheng",
    "停" : "Ting",
    "助" : "Zhu",
    "攻" : "Gong",
    "机" : "Ji",
    "器" : "Qi",
    "人" : "Ren",
    "绑" : "Bang",
    "定" : "Ding",
    "解" : "Jie",
    "大" : "Da",
    "小" : "Xiao",
    "障" : "Zhang",
    "碍" : "Ai",
    "修" : "Xiu",
    "改" : "Gai",
    "英" : "Ying",
    "雄" : "Xiong",
    "语" : "Yu",
    "音" : "Yin",
    "强" : "Qiang",
    "制" : "Zhi",
    "设" : "She",
    "置" : "Zhi",
    "称" : "Cheng",
    "启" : "Qi",
    "碰" : "Peng",
    "撞" : "Zhuang",
    "取" : "Qu",
    "境" : "Jing",
    "朝" : "Chao",
    "向" : "Xiang",
    "镜" : "Jing",
    "头" : "Tou",
    "按" : "An",
    "下" : "Xia",
    "钮" : "Niu",
    "速" : "Su",
    "选" : "Xuan",
    "择" : "Ze",
    "轮" : "Lun",
    "廓" : "Kuo",
    "限" : "Xian",
    "阈" : "Yu",
    "转" : "Zhuan",
    "换" : "Huan",
    "状" : "Zhuang",
    "态" : "Tai",
    "清" : "Qing",
    "可" : "Ke",
    "禁" : "Jin",
    "主" : "Zhu",
    "要" : "Yao",
    "传" : "Chuan",
    "送" : "Song",
    "复" : "Fu",
    "活" : "Huo",
    "杀" : "Sha",
    "分" : "Fen",
    "数" : "Shu",
    "对" : "Dui",
    "死" : "Si",
    "回" : "Hui",
    "放" : "Fang",
    "时" : "Shi",
    "目" : "Mu",
    "标" : "Biao",
    "键" : "Jian",
    "施" : "Shi",
    "推" : "Tui",
    "力" : "Li",
    "不" : "Bu",
    "见" : "Jian",
    "交" : "Jiao",
    "流" : "Liu",
    "模" : "Mo",
    "式" : "Shi",
    "辅" : "Fu",
    "技" : "Ji",
    "能" : "Neng",
    "终" : "Zhong",
    "极" : "Ji",
    "近" : "Jin",
    "战" : "Zhan",
    "装" : "Zhuang",
    "填" : "Tian",
    "跃" : "Yue",
    "蹲" : "Dun",
    "充" : "Chong",
    "资" : "Zi",
    "源" : "Yuan",
    "冷" : "Leng",
    "却" : "Que",
    "武" : "Wu",
    "弹" : "Dan",
    "药" : "Yao",
    "道" : "Dao",
    "引" : "Yin",
    "度" : "Du",
    "瞄" : "Miao",
    "准" : "Zhun",
    "垂" : "Chui",
    "地" : "Di",
    "形" : "Xing",
    "者" : "Zhe",
    "间" : "Jian",
    "重" : "ZhongChong",
    "预" : "Yu",
    "载" : "Zai",
    "点" : "Dian",
    "描" : "Miao",
    "述" : "Shu",
    "慢" : "Man",
    "在" : "Zai",
    "索" : "Suo",
    "处" : "Chu",
    "追" : "Zhui",
    "踪" : "Zong",
    "频" : "Pin",
    "率" : "Lv",
    "逐" : "Zhu",
    "帧" : "Zhen",
    "更" : "Geng",
    "新" : "Xin",
    "单" : "Dan",
    "次" : "Ci",
    "赋" : "Fu",
    "显" : "Xian",
    "示" : "Shi",
    "姓" : "Xing",
    "板" : "Ban",
    "隐" : "Yin",
    "藏" : "Cang",
    "提" : "Ti",
    "游" : "You",
    "戏" : "Xi",
    "图" : "Tu",
    "计" : "Ji",
    "信" : "Xin",
    "息" : "Xi",
    "聊" : "Liao",
    "天" : "Tian",
    "文" : "Wen",
    "字" : "Zi",
    "完" : "Wan",
    "关" : "Guan",
    "闭" : "Bi",
    "通" : "Tong",
    "告" : "Gao",
    "乐" : "Yue",
    "宣" : "Xuan",
    "合" : "He",
    "胜" : "Sheng",
    "利" : "Li",
    "布" : "Bu",
    "平" : "Ping",
    "暂" : "Zan",
    "前" : "Qian",
    "往" : "Wang",
    "集" : "Ji",
    "结" : "Jie",
    "返" : "Fan",
    "厅" : "Ting",
    "室" : "Shi",
    "创" : "Chuang",
    "建" : "Jian",
    "本" : "Ben",
    "进" : "Jin",
    "效" : "Xiao",
    "果" : "Guo",
    "光" : "Guang",
    "束" : "Shu",
    "播" : "Bo",
    "体" : "Ti",
    "查" : "Cha",
    "看" : "Kan",
    "录" : "Lu",
    "记" : "Ji",
    "部" : "Bu",
    "无" : "Wu",
    "互" : "Hu",
    "身" : "Shen",
    "左" : "Zuo",
    "边" : "Bian",
    "顶" : "Ding",
    "右" : "You",
    "沉" : "Chen",
    "睡" : "Shui",
    "燃" : "Ran",
    "冰" : "Bing",
    "冻" : "Dong",
    "被" : "Bei",
    "侵" : "Qin",
    "敌" : "Di",
    "倒" : "Dao",
    "相" : "Xiang",
    "晕" : "Yun",
    "法" : "Fa",
    "护" : "Hu",
    "甲" : "Jia",
    "盾" : "Dun",
    "防" : "Fang",
    "赏" : "Shang",
    "金" : "Jin",
    "猎" : "Lie",
    "手" : "Shou",
    "占" : "Zhan",
    "领" : "Ling",
    "勇" : "Yong",
    "夺" : "Duo",
    "锦" : "Jin",
    "旗" : "Qi",
    "决" : "Jue",
    "斗" : "Dou",
    "先" : "Xian",
    "锋" : "Feng",
    "运" : "Yun",
    "融" : "Chu",
    "怪" : "Guai",
    "鼠" : "Shu",
    "仇" : "Fu",
    "雪" : "Xue",
    "球" : "Qiu",
    "势" : "Shi",
    "训" : "Xu",
    "练" : "Lian",
    "靶" : "Ba",
    "场" : "Chang",
    "突" : "Tu",
    "团" : "Tuan",
    "域" : "Yu",
    "狩" : "Shou",
    "箭" : "Jian",
    "上" : "Shang",
    "星" : "Xing",
    "矢" : "Shi",
    "号" : "Hao",
    "圆" : "Yuan",
    "圈" : "Quan",
    "梅" : "Mei",
    "花" : "Hua",
    "块" : "Kuai",
    "眩" : "Xuan",
    "感" : "Gan",
    "叹" : "Tan",
    "眼" : "Yan",
    "睛" : "Jing",
    "火" : "Huo",
    "焰" : "Yan",
    "帜" : "Zhi",
    "高" : "Gao",
    "兴" : "Xing",
    "红" : "Hong",
    "桃" : "Tao",
    "满" : "Man",
    "月" : "Yue",
    "拒" : "Ju",
    "绝" : "Jue",
    "剧" : "Ju",
    "毒" : "Du",
    "问" : "Wen",
    "辐" : "Fu",
    "射" : "She",
    "收" : "Shou",
    "宽" : "Kuan",
    "细" : "Xi",
    "难" : "Nan",
    "骷" : "Ku",
    "髅" : "Lou",
    "黑" : "Hei",
    "螺" : "Luo",
    "旋" : "Xuan",
    "垃" : "La",
    "圾" : "Ji",
    "箱" : "Xiang",
    "警" : "Jing",
    "神" : "Shen",
    "空" : "Kong",
    "使" : "Shi",
    "半" : "Ban",
    "托" : "Tuo",
    "昂" : "Ang",
    "莱" : "Lai",
    "因" : "Yin",
    "哈" : "Ha",
    "特" : "Te",
    "老" : "Lao",
    "之" : "Zhi",
    "鹰" : "Ying",
    "温" : "Wen",
    "斯" : "Si",
    "顿" : "Dun",
    "百" : "Bai",
    "堡" : "Bao",
    "垒" : "Lei",
    "秩" : "Zhi",
    "禅" : "Chan",
    "雅" : "Ya",
    "塔" : "Ta",
    "氏" : "Shi",
    "路" : "Lu",
    "霸" : "Ba",
    "卡" : "Ka",
    "西" : "Xi",
    "迪" : "Di",
    "狂" : "Kuang",
    "莉" : "Li",
    "娅" : "Ya",
    "士" : "Shi",
    "兵" : "Bing",
    "卢" : "Lu",
    "奥" : "Ao",
    "美" : "Mei",
    "影" : "Ying",
    "末" : "Mo",
    "日" : "Ri",
    "铁" : "Tie",
    "拳" : "Quan",
    "安" : "An",
    "娜" : "Na",
    "丽" : "Li",
    "莎" : "Sha",
    "吉" : "Ji",
    "莫" : "Mo",
    "伊" : "Yi",
    "拉" : "La",
    "破" : "Po",
    "坏" : "Huai",
    "杰" : "Jie",
    "恩" : "En",
    "艾" : "Ai",
    "什" : "Shi",
    "声" : "Sheng",
    "巴" : "Ba",
    "蒂" : "Di",
    "雾" : "Wu",
    "渣" : "Zha",
    "客" : "Ke",
    "女" : "Nv",
    "王" : "Wang",
    "格" : "Ge",
    "玛" : "Ma",
    "刹" : "ChaSha",
    "公" : "Gong",
    "万" : "Wan",
    "圣" : "Sheng",
    "节" : "Jie",
    "德" : "De",
    "好" : "Hao",
    "坞" : "Wu",
    "瓦" : "Wa",
    "尔" : "Er",
    "废" : "Fei",
    "墟" : "Xu",
    "深" : "Shen",
    "井" : "Jing",
    "灯" : "Deng",
    "佩" : "Pei",
    "努" : "Nu",
    "尼" : "Ni",
    "那" : "Na",
    "国" : "Guo",
    "诞" : "Dan",
    "泊" : "Bo",
    "村" : "Cun",
    "庄" : "Zhuang",
    "暴" : "Bao",
    "世" : "Shi",
    "界" : "Jie",
    "监" : "Jian",
    "测" : "Ce",
    "站" : "Zhan",
    "南" : "Nan",
    "洲" : "Zhou",
    "森" : "Shen",
    "林" : "Lin",
    "工" : "Gong",
    "坊" : "Fang",
    "内" : "Nei",
    "岛" : "Dao",
    "屿" : "Yu",
    "夜" : "Ye",
    "绿" : "Lv",
    "幕" : "Mu",
    "城" : "Cheng",
    "墓" : "Mu",
    "园" : "Yuan",
    "多" : "Duo",
    "坛" : "Tan",
    "黎" : "Li",
    "弗" : "Fu",
    "育" : "Yu",
    "悉" : "Xi",
    "海" : "Hai",
    "港" : "Gang",
    "竞" : "Jing",
    "经" : "Jing",
    "典" : "Dian",
    "春" : "Chun",
    "漓" : "Li",
    "江" : "Jiang",
    "市" : "Shi",
    "庭" : "Ting",
    "院" : "Yuan",
    "控" : "Kong",
    "心" : "Xin",
    "釜" : "Fu",
    "山" : "Shan",
    "区" : "Qu",
    "寺" : "Si",
    "沃" : "Wo",
    "业" : "Ye",
    "镇" : "Zhen",
    "罗" : "Luo",
    "陀" : "Tuo",
    "学" : "Xue",
    "里" : "Li",
    "阿" : "A",
    "坂" : "Ban",
    "殿" : "Dian",
    "马" : "Ma",
    "耶" : "Ye",
    "线" : "Xian",
    "基" : "Ji",
    "皇" : "Huang",
    "兽" : "Shou",
    "埃" : "Ai",
    "兰" : "Lan",
    "萨" : "Sa",
    "街" : "Jie",
    "帕" : "Pa",
    "苏" : "Su",
    "香" : "Xiang",
    "行" : "Xing",
    "抱" : "Bao",
    "歉" : "Qian",
    "谢" : "Xie",
    "撤" : "Che",
    "再" : "Zai",
    "候" : "Hou",
    "我" : "Wo",
    "了" : "Le",
    "来" : "Lai",
    "袭" : "Xi",
    "需" : "Xu",
    "帮" : "Bang",
    "做" : "Zuo",
    "备" : "Bei",
    "正" : "Zheng",
    "守" : "Shou",
    "赶" : "Gan",
    "跟" : "Gen",
    "着" : "Zhe",
    "你" : "Ni",
    "喷" : "Pen",
    "漆" : "Qi",
    "表" : "Biao",
    "情" : "Qing",
    "益" : "Yi",
    "抓" : "Zhuang",
    "钩" : "Gou",
    "柱" : "Zhu",
    "云" : "Yun",
    "爆" : "Bao",
    "炸" : "Zha",
    "面" : "Mian",
    "负" : "Fu",
    "激" : "Ji",
    "物" : "Wu",
    "雷" : "Lei",
    "增" : "Zeng",
    "纳" : "Na",
    "米" : "Mi",
    "素" : "Su",
    "化" : "Hua",
    "麻" : "Ma",
    "醉" : "Zui",
    "镖" : "Biao",
    "聚" : "Ju",
    "焦" : "Jiao",
    "黏" : "Nian",
    "性" : "Xing",
    "陷" : "Xian",
    "阱" : "Jing",
    "链" : "Lian",
    "榴" : "Liu",
    "发" : "Fa",
    "震" : "Zhen",
    "荡" : "Dang",
    "胎" : "Tai",
    "触" : "Chu",
    "连" : "Lian",
    "接" : "Jie",
    "散" : "San",
    "失" : "Shi",
    "现" : "Xian",
    "住" : "Zhu",
    "别" : "Bie",
    "哨" : "Shao",
    "戒" : "Jie",
    "炮" : "Pao",
    "原" : "Yuan",
    "怒" : "Nu",
    "背" : "Bei",
    "包" : "Bao",
    "陆" : "Lu",
    "粒" : "Li",
    "维" : "Wei",
    "保" : "Bao",
    "枪" : "Qiang",
    "幽" : "You",
    "灵" : "Ling",
    "疾" : "Ji",
    "跑" : "Pao",
    "热" : "Re",
    "台" : "Tai",
    "视" : "Shi",
    "应" : "Ying",
    "坠" : "Zhui",
    "延" : "Yan",
    "管" : "Guan",
    "烧" : "Shao",
    "材" : "Cai",
    "料" : "Liao",
    "闪" : "Shan",
    "乱" : "Luan",
    "超" : "Chao",
    "质" : "Zhi",
    "吸" : "Xi",
    "附" : "Fu",
    "志" : "Zhi",
    "电" : "Dian",
    "磁" : "Ci",
    "脉" : "Mai",
    "冲" : "Chong",
    "诡" : "Gui",
    "恢" : "Hui",
    "飞" : "Fei",
    "锤" : "Chui",
    "范" : "Fan",
    "围" : "Wei",
    "枷" : "Jia",
    "微" : "Wei",
    "型" : "Xing",
    "自" : "Zi",
    "毁" : "Hui",
    "初" : "Chu",
    "坦" : "Tan",
    "克" : "Ke",
    "勾" : "Gou",
    "烈" : "Lie",
    "打" : "Da",
    "当" : "Dang",
    "默" : "Mo",
    "认" : "Ren",
    "及" : "Ji",
    "屏" : "Ping",
    "截" : "Jie",
    "反" : "Fan",
    "并" : "Bing",
    "遮" : "Zhe",
    "蔽" : "Bi",
    "总" : "Zong",
    "是" : "Shi",
    "替" : "Ti",
    "至" : "Zhi",
    "减" : "Jian",
    "乘" : "Cheng",
    "从" : "Cong",
    "组" : "Zu",
    "个" : "Ge",
    "实" : "Shi",
    "或" : "Huo",
    "非" : "Fei",
    "较" : "Jiao", 
    "于" : "Yu",
    "野" : "Ye",
    "急" : "Ji",
    "救" : "Jiu",
    "立" : "Li",
    "存" : "Cun",
    "否" : "Fou",
    "具" : "Ju",
    "携" : "Xie",
    "带" : "Dai",
    "锁" : "Zuo",
    "已" : "Yi",
    "任" : "Ren",
    "意" : "Yi",
    "墙" : "Qiang",
    "像" : "Xiang",
    "类" : "Lei",
    "距" : "Ju",
    "随" : "Sui",
    "水" : "Shui",
    "指" : "Zhi",
    "服" : "Fu",
    "务" : "Fu",
    "均" : "Jun",
    "峰" : "Feng",
    "耗" : "Hao",
    "得" : "De",
    "象" : "Xiang",
    "支" : "Zhi",
    "援" : "Yuan",
    "输" : "Shu",
    "出" : "Chu",
    "角" : "Jiao",
    "此" : "Ci",
    "外" : "Wai",
    "远" : "Yuan",
    "幅" : "Fu",
    "归" : "Gui",
    "积" : "Ji",
    "走" : "Zou",
    "差" : "Cha",
    "余" : "Yu",
    "弦" : "Xian",
    "切" : "Qie",
    "夹" : "Jia",
    "以" : "Yi",
    "弧" : "Hu",
    "映" : "Ying",
    "排" : "Pai",
    "滤" : "Lv",
    "元" : "Yuan",
    "割" : "Ge",
    "含" : "Han",
    "首" : "Shou",
    "阻" : "Zu",
    "挡" : "Dang",
    "承" : "Cheng",
    "协" : "Xie",
    "佳" : "Jia",
    "瞬" : "Shun",
    "独" : "Du",
    "获" : "Huo",
    "未" : "Wei",
    "和" : "He",
    "会" : "Hui",
    "符" : "Fu",
    "串" : "Chuan",
    "颜" : "Yan",
    "色" : "Se",
    "径" : "Jing",
    "义" : "Yi",
    "长" : "Chang",
    "白" : "Bai",
    "黄" : "Huang",
    "紫" : "Zi",
    "蓝" : "Lan",
    "橙" : "Cheng",
    "青" : "Qing",
    "灰" : "Hui",
    "亮" : "Liang",
    "玫" : "Mei",
    "拾" : "Shi",
    "烟" : "Yan",
    "诱" : "You",
    "饵" : "Er",
    "智" : "Zhi",
    "械" : "Xie",
    "秒" : "Miao",
    "报" : "Bao",
    "盟" : "Meng",
    "友" : "You",
    "尝" : "Chang",
    "试" : "Shi",
    "躲" : "Duo",
    "避" : "Bi",
    "优" : "You",
    "秀" : "Xiu",
    "注" : "Zhu",
    "奖" : "Jiang",
    "励" : "Li",
    "购" : "Gou",
    "买" : "Mai",
    "危" : "Wei",
    "险" : "Xian",
    "挑" : "Tiao",
    "魅" : "Mei",
    "检" : "Jian",
    "朵" : "Duo",
    "这" : "Zhe",
    "儿" : "Er",
    "恭" : "Gong",
    "喜" : "Xi",
    "筑" : "Zhu",
    "腐" : "Fu",
    "货" : "Huo",
    "币" : "Bi",
    "严" : "Yan",
    "级" : "Ji",
    "阶" : "Jie",
    "段" : "Duan",
    "升" : "Sheng",
    "牌" : "Pai",
    "堆" : "Dui",
    "败" : "Bai",
    "御" : "Yu",
    "达" : "Da",
    "干" : "Gan",
    "扰" : "Rao",
    "摧" : "Cui",
    "探" : "Tan",
    "巧" : "Qiao",
    "弃" : "Qi",
    "罩" : "Zhao",
    "抽" : "Chou",
    "掉" : "Diao",
    "落" : "Luo",
    "东" : "Dong",
    "验" : "Yan",
    "端" : "Duan",
    "即" : "Ji",
    "将" : "Jiang",
    "跌" : "Die",
    "快" : "Kuai",
    "误" : "Wu",
    "品" : "Pin",
    "寻" : "Xun",
    "找" : "Zhao",
    "起" : "Qi",
    "罪" : "Zui",
    "求" : "Qiu",
    "嗯" : "En",
    "尽" : "Jin",
    "少" : "Shao",
    "降" : "Jiang",
    "读" : "Du",
    "坐" : "Zuo",
    "轻" : "Qing",
    "适" : "Shi",
    "钱" : "Qian",
    "错" : "Cuo",
    "批" : "Pi",
    "普" : "Pu",
    "北" : "Bei",
    "算" : "Suan",
    "吧" : "Ba",
    "噢" : "Ao",
    "啊" : "A",
    "呀" : "Ya",
    "去" : "Qu",
    "价" : "Jia",
    "净" : "Jin",
    "抵" : "Di",
    "就" : "Jiu",
    "绪" : "Xu",
    "剩" : "Sheng",
    "营" : "Ying",
    "揭" : "Jie",
    "销" : "Xiao",
    "售" : "Shou",
    "撕" : "Si",
    "裂" : "Lie",
    "商" : "Shang",
    "店" : "Dian",
    "洗" : "Xi",
    "孵" : "Fu",
    "稳" : "Wen",
    "宠" : "Chong",
    "群" : "Qun",
    "功" : "Gong",
    "衷" : "Zhong",
    "太" : "Tai",
    "棒" : "Bang",
    "威" : "Wei",
    "胁" : "Xie",
    "易" : "Yi",
    "叛" : "Pan",
    "徒" : "Tu",
    "呃" : "E",
    "知" : "Zhi",
    "漩" : "Xuan",
    "涡" : "Wo",
    "壁" : "Bi",
    "欢" : "Huan",
    "迎" : "Ying",
    "赞" : "Zan",
    "哇" : "Wa",
    "哦" : "O",
    "术" : "Shu",
    "扩" : "Kuo",
    "吞" : "Tun",
    "噬" : "Shi",
    "涌" : "Yong",
    "善" : "Shan",
    "驱" : "Qu",
    "梭" : "Suo",
    "锐" : "Rui",
    "毛" : "Mao",
    "奇" : "Qi",
    "朱" : "Zhu",
    "诺" : "Nuo",
    "摩" : "Mo",
    "亚" : "Ya",
    "鲁" : "Lu",
    "塞" : "Sai",
    "彼" : "Bi",
    "精" : "Jing",
    "炼" : "Lian",
    "场" : "Chang",
    "冈" : "Gang",
    "座" : "Zuo",
};
//#endregion



//#region 关键词字典
// 在对应的字典中添加动作、常量等信息
const heroes = {
    "回声" : "回声是一名输出型英雄",
    "天使" : "天使是一名支援型英雄",
    "士兵：76" : "士兵：76是一名输出型英雄"
};
const actions = {
    //----------------------------------------------
    "等待" : {
        "描述" : "暂停执行动作列表。除非等待被中断，否则剩余的动作将在暂停之后执行。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "时间",
                "类型" : "0000000",
                "默认" : "0.250",
                "说明" : "等待将要持续的时间，单位为秒。最小的有效值为0.016秒。"
            },
            {
                "名称" : "等待行为",
                "类型" : "等待",
                "默认" : "无视条件",
                "说明" : "指定等待是否可以被中断。如果忽略条件列表，则等待不会被中断。否则则依据条件列表判断是否及何时中止或重新开始动作列表。"
            }
        ]
    },

    "等待直到" : {
        "描述" : "持续等待，直到“继续条件”为“真”，或达到“超时”的秒数时限。（在此等待过程中，忽略规则的条件。）",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "继续条件",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "如果此值变为“真”，则终止等待，并开始执行动作列表中的下一个动作。"
            },
            {
                "名称" : "超时",
                "类型" : "0000000",
                "默认" : "99999",
                "说明" : "如果达到此秒数时限，则终止等待，并开始执行动作列表中的下一个动作。"
            }
        ]
    },
    
    "跳过" : {
        "描述" : "跳过动作列表中一定条数的动作。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "动作数量",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "跳过的动作条数，不包括此动作。"
            }
        ]
    },
    
    "根据条件跳过" : {
        "描述" : "如果此动作的条件为“真”，则跳过动作列表中一定条数的动作。否则，则继续执行下一条动作。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "条件",
                "类型" : "0000000",
                "默认" : "0 == 0",
                "说明" : "是否跳过行动。"
            },
            {
                "名称" : "动作数量",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "跳过的动作条数，不包括此动作。"
            }
        ]
    },
    
    "中止" : {
        "描述" : "停止执行动作列表。",
        "返回" : "无",
        "参数" : []
    },
    
    "如条件为“假”则中止" : {
        "描述" : "如果条件列表中至少有一项条件为“假”，则停止执行动作列表。如果所有条件均为“真”，则继续执行下一条动作。",
        "返回" : "无",
        "参数" : []
    },
    
    "如条件为“真”则中止" : {
        "描述" : "如果条件列表中所有条件均为“真”，则停止执行动作列表。如果有任何一条为“假”，则继续执行下一条动作。",
        "返回" : "无",
        "参数" : []
    },
    
    "根据条件中止" : {
        "描述" : "如果此动作的条件为“真”，则停止执行动作列表。否则，则继续执行下一条动作。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "条件",
                "类型" : "0000000",
                "默认" : "0 == 0",
                "说明" : "是否停止执行。"
            }
        ]
    },
    
    "禁用 " : {
        "描述" : "添加在规则或动作的开头，即可游戏中禁用。",
        "返回" : "无",
        "参数" : []
    },

    "循环" : {
        "描述" : "从头开始执行动作列表。",
        "返回" : "无",
        "参数" : []
    },
    
    "中断" : {
        "描述" : "表示一个中止当前While或For循环的动作。跳至End动作后的下一个动作继续执行。",
        "返回" : "无",
        "参数" : []
    },
    
    "继续" : {
        "描述" : "表示一个跳至当前While或For循环起始处继续执行的动作。",
        "返回" : "无",
        "参数" : []
    },
    
    "如条件为“假”则循环" : {
        "描述" : "如果条件列表中至少有一项条件为“假”，则从头开始执行动作列表。如果所有条件均为“真”，则执行下一项动作。",
        "返回" : "无",
        "参数" : []
    },
    
    "如条件为“真”则循环" : {
        "描述" : "如果条件列表中的每一项条件均为“真”，则从头开始执行动作列表。如果任意一项为“假”，则执行下一项动作。",
        "返回" : "无",
        "参数" : []
    },
    
    "根据条件循环" : {
        "描述" : "如果此动作的条件为“真”，则从头开始动作列表。否则，继续执行下一条动作。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "条件",
                "类型" : "0000000",
                "默认" : "0 == 0",
                "说明" : "循环是否发生。"
            }
        ]
    },
    
    "调用子程序" : {
        "描述" : "暂停执行当前规则，并开始执行子程序规则（事件类型为“子程序”的规则）。当子程序规则结束时，原来的规则将恢复执行。子程序可以使用同样的情景变量（如事件玩家）的原始值。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "子程序",
                "类型" : "0000000",
                "默认" : "Sub0",
                "说明" : "指定要调用的子程序。如果一个事件类型为子程序的规则指定了同一段子程序，那么它将会被执行。否则会忽略此行动。"
            }
        ]
    },
    
    "开始规则" : {
        "描述" : "开始同时执行一个子程序规则（事件类型为“子程序”的规则）。原来规则的执行不会被打断。子程序可以使用同样的情景变量（如事件玩家）的原始值。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "子程序",
                "类型" : "0000000",
                "默认" : "Sub0",
                "说明" : "指定要开始的子程序。如果一个事件类型为子程序的规则指定了同一段子程序，那么它将会被执行。否则会忽略此行动。"
            },
            {
                "名称" : "是否正在执行",
                "类型" : "0000000",
                "类型" : "规则",
                "默认" : "重新开始规则",
                "说明" : "决定当子程序中指定的规则已经在同一玩家或环境实体上执行时会发生什么。"
            }
        ]
    },
    
    //----------------------------------------------
    "为玩家添加生命池" : {
        "描述" : "为一名或多名玩家添加临时的生命池。如果要指定此生命池，可以使用“上一个创建的生命池”值。同一名玩家身上任意一个生命值类型（生命、护甲或护盾）的生命池最多可以存在16个（包括基本生命池和由技能获得的生命池）。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的移动碰撞将受到影响。"
            },
            {
                "名称" : "生命值类型",
                "类型" : "生命类型",
                "默认" : "护甲",
                "说明" : "指定此生命池中所包含的生命值类型（护甲或护盾）。"
            },
            {
                "名称" : "最大生命值",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "生命池的数值。"
            },
            {
                "名称" : "可恢复",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "此生命池中的生命在失去后是否可以由治疗恢复。如果此值为假，则此生命值在受到伤害后会削减并消失。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "如果此值为真，且“可恢复”为真，则每一帧都会重新为“最大生命值”赋值。如果此值为假或“可恢复”为假，则“最大生命值”只会在此行动执行时被赋值一次。"
            }
        ]
    },
    
    "移除玩家的生命池" : {
        "描述" : "移除由“添加生命池”行动添加的一个生命池。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "生命池ID",
                "类型" : "0000000",
                "默认" : "最后创建的生命池",
                "说明" : "指定一个由“添加生命池”动作所创建的生命池。（可以用“上一个创建的生命池”获得生命池ID的值。）"
            }
        ]
    },
    
    "移除玩家的所有生命值" : {
        "描述" : "移除由“添加生命池”行动添加的所有生命池。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家身上所添加的生命池将移除。"
            }
        ]
    },
    
    "开始伤害调整" : {
        "描述" : "开始调整一名或多名受伤害者从一个或多个伤害者受到的伤害。如果想指定此伤害调整，可以使用“上一个伤害调整ID“的值。如果已经开始了太多的伤害调整，此动作可能会失败。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "受伤害者",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "修正下列玩家受到的伤害（被“伤害者”攻击时）。"
            },
            {
                "名称" : "伤害者",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "修正下列玩家造成的伤害（攻击“受伤害者”时）。"
            },
            {
                "名称" : "伤害百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "伤害者对受伤害者造成伤害将调整至百分比。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "伤害调整",
                "默认" : "受伤害者，伤害者及伤害百分比",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            }
        ]
    },
    
    "停止伤害调整" : {
        "描述" : "停止由“开始伤害调整”动作启动的一个伤害调整。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "伤害调整ID",
                "类型" : "0000000",
                "默认" : "上一个伤害调整ID",
                "说明" : "指定要结束的伤害调整副本。此ID可以是“上一个伤害调整ID”，或一个之前储存“上一个伤害调整ID”的变量。"
            }
        ]
    },
    
    "停止所有伤害调整" : {
        "描述" : "停止所有由“开始伤害调整”动作启动的伤害调整。",
        "返回" : "无",
        "参数" : []
    },
    
    "开始治疗调整" : {
        "描述" : "开始调整一名或多名受治疗者从一个或多个治疗者受到的治疗。如果想指定此治疗调整，可以使用“上一个治疗调整ID“的值。如果已经开始了太多的治疗调整，此动作可能会失败。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "受治疗者",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "修正下列玩家受到的治疗（被“治疗者”治疗时）。"
            },
            {
                "名称" : "治疗者",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "修正下列玩家造成的治疗（治疗“受治疗者”时）。"
            },
            {
                "名称" : "治疗百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "治疗者对受治疗者造成的治疗将调整至百分比。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "0000000",
                "类型" : "治疗调整",
                "默认" : "受治疗者，治疗者及治疗百分比",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            }
        ]
    },
    
    "停止治疗调整" : {
        "描述" : "停止由“开始治疗调整”动作启动的一个治疗调整。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "治疗调整ID",
                "类型" : "0000000",
                "默认" : "上一个治疗调整ID",
                "说明" : "指定要结束的治疗调整副本。此ID可以是“上一个治疗调整ID”，或一个之前储存“上一个治疗调整ID”的变量。"
            }
        ]
    },
    
    "停止所有治疗调整" : {
        "描述" : "停止所有由“开始治疗调整”动作启动的治疗调整。",
        "返回" : "无",
        "参数" : []
    },
    
    "开始持续伤害" : {
        "描述" : "开始一个持续伤害副本。此持续伤害会持续一段指定长度的时间，或直到被程序中止。如果想指定此持续伤害，可以使用“上一个持续伤害ID”的返还值。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "在下列玩家身上施加持续伤害效果。"
            },
            {
                "名称" : "伤害者",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "伤害视为此名玩家造成的。如果“伤害者”设置为“空”则此伤害不会归到任何玩家名下。"
            },
            {
                "名称" : "持续时间",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "持续伤害的持续时间，以秒为单位。如果要让状态持续到被程序终止为止，可以输出较长的持续时间，如9999。"
            },
            {
                "名称" : "每秒伤害",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "持续伤害每秒造成的伤害值。"
            }
        ]
    },
    
    "停止持续伤害" : {
        "描述" : "停止一个由“开始持续伤害”动作启动的持续伤害副本。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "持续伤害ID",
                "类型" : "0000000",
                "默认" : "上一个持续伤害效果ID",
                "说明" : "指定要结束的持续伤害副本。此ID可以是“上一个持续伤害ID”，或一个之前储存“上一个持续伤害ID”的变量。"
            }
        ]
    },
    
    "停止所有持续伤害" : {
        "描述" : "停止一个或多个玩家身上所有由“开始持续伤害”给予的持续伤害。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "停止下列玩家身上程序给予的持续伤害。"
            }
        ]
    },
    
    "开始持续治疗" : {
        "描述" : "开始一个持续治疗副本。此持续治疗会持续一段指定长度的时间，或直到被程序中止。如果想指定此持续治疗，可以使用“上一个持续治疗ID”的返还值。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家会受到持续治疗。"
            },
            {
                "名称" : "治疗者",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "治疗视为此名玩家造成的。如果“治疗者”设置为“空”则此治疗不会归到任何玩家名下。"
            },
            {
                "名称" : "持续时间",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "持续治疗的持续时间，以秒为单位。如果要让状态持续到被程序终止为止，可以输出较长的持续时间，如9999。"
            },
            {
                "名称" : "每秒治疗",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此持续治疗每秒造成的治疗。"
            }
        ]
    },
    
    "停止持续治疗" : {
        "描述" : "停止一个由“开始持续治疗”动作启动的持续治疗副本。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "持续治疗ID",
                "类型" : "0000000",
                "默认" : "上一个持续治疗效果ID",
                "说明" : "指定要结束的持续治疗副本。此ID可以是“上一个持续治疗ID”，或一个之前储存“上一个持续治疗ID”的变量。"
            }
        ]
    },
    
    "停止所有持续治疗" : {
        "描述" : "停止一个或多个玩家身上所有由“开始持续治疗”给予的持续治疗。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "停止下列玩家身上程序给予的持续治疗。"
            }
        ]
    },
    
    "开始助攻" : {
        "描述" : "当一名或多名目标被消灭时，开始将此助攻归于一名或多名助攻者名下。如果想指定此伤害调整，可以使用“上一个助攻ID“的值。如果已经开始了太多的助攻，此动作可能会失败。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "助攻者",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将被归为助攻者。"
            },
            {
                "名称" : "目标",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "下列玩家被消灭时，会将助攻归于助攻者名下。如果目标和助攻者为盟友，则为协助防守。否则为协助进攻。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "助攻",
                "默认" : "助攻者和目标",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            }
        ]
    },
    
    "停止助攻" : {
        "描述" : "停止由“开始助攻”动作启动的一个助攻。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "助攻ID",
                "类型" : "0000000",
                "默认" : "上一个助攻ID",
                "说明" : "指定要停止的助攻副本。此ID可以是“上一个助攻ID”，或一个之前储存“上一个助攻ID”的变量。"
            }
        ]
    },
    
    "停止所有助攻" : {
        "描述" : "停止所有由“开始助攻”动作启动的助攻。",
        "返回" : "无",
        "参数" : []
    },
    
    "生成机器人" : {
        "描述" : "在指定队伍的指定栏位添加一个新的机器人（只要该空位可用）。机器人只能移动与射击，或根据地图工坊的动作设置使用技能。启用相应地图工坊扩展可额外创建更多机器人。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "英雄",
                "类型" : "0000000",
                "默认" : "英雄(安娜)",
                "说明" : "机器人使用的英雄。如果提供了多于一个英雄，则会随机在其中选择。"
            },
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "将机器人添加至此队伍。“全部”选项只适用于自由混战模式，“队伍”选项只适用于基于队伍的游戏模式。"
            },
            {
                "名称" : "栏位",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "在此玩家栏位添加机器人（-1表示第一个可用的空位）。不管游戏大厅中的设置如何，每支队伍最多可以加入6个机器人，自由混战队伍中最多可加入12个机器人。"
            },
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "机器人最初出现的位置。"
            },
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "假人最初面向的方向。"
            }
        ]
    },
    
    "移除机器人" : {
        "描述" : "从比赛中移除指定机器人。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "移除此队伍中的机器人。“全部”选项只适用于自由混战模式，“队伍”选项只适用于基于队伍的游戏模式。"
            },
            {
                "名称" : "栏位",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "移除此栏位的机器人。"
            }
        ]
    },
    
    "移除所有机器人" : {
        "描述" : "从比赛中移除所有机器人。",
        "返回" : "无",
        "参数" : []
    },
    
    //----------------------------------------------
    "绑定玩家" : {
        "描述" : "将一名玩家（子玩家）与另一名玩家（父玩家）绑定。绑定之后，除非解除绑定或传送离开，否则子玩家无法自由移动。多个子玩家可以绑定至同一名父玩家，但反之则不成立。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "子玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "将此玩家绑定至父玩家。在解除绑定或传送离开之前，此玩家无法自由移动。"
            },
            {
                "名称" : "父玩家",
                "类型" : "0000000",
                "默认" : "最后创建的实体",
                "说明" : "将子玩家绑定至此玩家。此玩家本身的动作不受影响，而其行动会决定子玩家的位置。"
            },
            {
                "名称" : "偏移",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "子玩家与父玩家的相对坐标。例如，矢量 (1, 2, 0) 指示的是父玩家头顶左边的位置。"
            }
        ]
    },
    
    "解除绑定" : {
        "描述" : "为一名或多名玩家解除“绑定玩家”的行动产生的效果。这些玩家将从其当前位置开始恢复自由行动的能力。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "子玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将与其父玩家解除绑定。"
            }
        ]
    },
    
    "开始调整玩家大小" : {
        "描述" : "开始调整一名或多名玩家的大小（会影响模型、移动碰撞、命中判定及部分技能）。请注意将大体形的玩家放置到复杂环境中会严重影响服务器负载，所以在做出此调整的同时应用“禁用与环境的移动碰撞”行动。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的大小。"
            },
            {
                "名称" : "大小",
                "类型" : "0000000",
                "默认" : "1",
                "说明" : "此系数将作用于玩家的大小（0.5即为一半大小，2.0为大小加倍，诸如此类）。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "如果此值为真，那么每一帧都会重新计算玩家的大小。如果此值为假，则大小只会在此行动一开始时赋予一个值。"
            }
        ]
    },
    
    "停止调整玩家大小" : {
        "描述" : "停止调整一名或多名玩家的大小。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "停止强制设置下列玩家的大小。"
            }
        ]
    },
    
    "开始调整障碍大小" : {
        "描述" : "开始调整一名或多名玩家的屏障大小。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "停止强制设置下列玩家的屏障大小。"
            },
            {
                "名称" : "大小",
                "类型" : "0000000",
                "默认" : "1",
                "说明" : "此系数将作用于屏障的大小（0.5即为一半大小，2.0为大小加倍，诸如此类），此调整以“开始调整玩家大小”动作所设置的大小为基准。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "如果此值为真，那么每一帧都会重新计算玩家的大小。如果此值为假，则大小只会在此行动一开始时赋予一个值。"
            }
        ]
    },
    
    "停止调整障碍大小" : {
        "描述" : "停止调整一名或多名玩家的屏障大小。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "停止改变下列玩家的屏障大小。"
            }
        ]
    },
    
    "开始修改英雄语音" : {
        "描述" : "修改玩家的英雄语音声音。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的英雄语音声音将被修改。"
            },
            {
                "名称" : "音调调整",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "语音的音调提高（最高至1.5）或降低（最低至0.5）的值。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "如果此值为真，那么每一帧都会重新计算音调调整的值。如果此值为假，则只会在此行动一开始时赋予一个值。"
            }
        ]
    },
    
    "停止修改英雄语音" : {
        "描述" : "取消“开始修改英雄语音”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的英雄语音声音将停止被修改。"
            }
        ]
    },
    
    "开始为机器人强制设置名称" : {
        "描述" : "开始强制设置指定玩家的名称。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的名称。"
            },
            {
                "名称" : "名称",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "要强制设置的名称。"
            }
        ]
    },
    
    "停止为机器人强制设置名称" : {
        "描述" : "取消对指定玩家进行“开始为机器人强制设置名称”的行为。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "停止强制设置下列玩家的名称。"
            }
        ]
    },
    
    "开启与玩家的移动碰撞" : {
        "描述" : "取消“取消与玩家的移动碰撞”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的移动碰撞将受到影响。"
            }
        ]
    },
    
    "取消与玩家的移动碰撞" : {
        "描述" : "使玩家停止与其他玩家发生碰撞。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的移动碰撞将受到影响。"
            }
        ]
    },
    
    "开启与环境的移动碰撞" : {
        "描述" : "取消“取消与环境的移动碰撞”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的移动碰撞将受到影响。"
            }
        ]
    },
    
    "取消与环境的移动碰撞" : {
        "描述" : "使玩家停止与其他环境（墙壁，天花板，以及特定物体）发生碰撞。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的移动碰撞将受到影响。"
            },
            {
                "名称" : "包括地面",
                "类型" : "0000000",
                "默认" : "假",
                "说明" : "如果为真，则同时取消与地面的碰撞。"
            }
        ]
    },
    
    "开始朝向" : {
        "描述" : "开始强制一名或多名玩家转向面对指定的方向。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将开始转向。"
            },
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "玩家最终将面朝的单位方向。此值将进行内部归一化。"
            },
            {
                "名称" : "角速率",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "角速率，单位为度/秒。"
            },
            {
                "名称" : "相对",
                "类型" : "相对",
                "默认" : "至地图",
                "说明" : "确定此方向是相对于地图坐标还是玩家的本地坐标。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "朝向",
                "默认" : "方向及角速率",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            }
        ]
    },
    
    "停止朝向" : {
        "描述" : "停止“开始转向”动作造成的转向效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将停止转向。"
            }
        ]
    },
    
    "开始镜头" : {
        "描述" : "将你的镜头放置在一个位置，面向一个角度。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "将下列玩家的镜头放置于此。"
            },
            {
                "名称" : "眼睛位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "镜头的位置。持续重新赋值。"
            },
            {
                "名称" : "望向位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "镜头望向的位置。持续重新赋值。"
            },
            {
                "名称" : "转动速度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "位置移动时镜头转动速度的快慢。0意味着不转动镜头方向，只改变其位置。"
            }
        ]
    },
    
    "停止镜头" : {
        "描述" : "将镜头缩放恢复至默认视角。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "将下列玩家的镜头恢复至默认视角。"
            }
        ]
    },
    
    "开始按下按钮" : {
        "描述" : "强制一名或多名玩家按下一个虚拟按钮，直到被“停止按下按钮”动作取消。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将持续按下虚拟按钮。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "设置按下的虚拟按钮。"
            }
        ]
    },
    
    "停止按下按钮" : {
        "描述" : "取消“开始按下按钮”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将不再持续按下虚拟按钮。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "不再持续按下的虚拟按钮。"
            }
        ]
    },
    
    "开始加速" : {
        "描述" : "开始令一名或多名玩家向指定方向加速。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将开始加速。"
            },
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "施加加速度的单位方向。此值将进行内部归一化。"
            },
            {
                "名称" : "频率",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "加速度，单位为米/秒²。需要较大的加速度才能够克服引力和/或表面摩擦力。"
            },
            {
                "名称" : "最大速度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "玩家达到此速度后会停止。由于引力和/或表面摩擦力的存在，可能将无法达到此速度。"
            },
            {
                "名称" : "相对",
                "类型" : "相对",
                "默认" : "至地图",
                "说明" : "确定此方向是相对于地图坐标还是玩家的本地坐标。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "加速",
                "默认" : "方向，速率，及最大速度",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            }
        ]
    },
    
    "停止加速" : {
        "描述" : "停止“开始加速”动作造成的加速效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将停止加速。"
            }
        ]
    },
    
    "开始强制玩家选择英雄" : {
        "描述" : "开始强制一名或多名玩家使用指定的英雄，如有必要，使这些玩家立即在当前位置复生。这名或这些玩家只能使用指定的英雄，直到执行“停止强制玩家选择英雄”动作为止。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将被强制使用指定英雄。"
            },
            {
                "名称" : "英雄",
                "类型" : "0000000",
                "默认" : "英雄(安娜)",
                "说明" : "玩家将被强制使用的英雄。"
            }
        ]
    },
    
    "停止强制玩家选择英雄" : {
        "描述" : "停止强制一名或多名玩家使用指定的英雄。此行动不会使玩家复生，只会在其下次选择英雄时恢复可用的其他英雄。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将不再被强制使用指定英雄。"
            }
        ]
    },
    
    "开始强制设置玩家位置" : {
        "描述" : "开始强制一名玩家停留在指定位置。如果启动了“重新赋值”，那么每一帧都会重新为“位置”赋值，让玩家进行强制移动。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "强制设置此玩家的位置。（重新赋值选项不会影响此值。）"
            },
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "将指定玩家设置至此位置。如果“重新赋值”选项启动，会使用这个值强制使玩家移动。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "如果此值为真，那么每一帧都会重新计算“位置”变量的值。如果此值为假，则“位置”只会在此行动一开始时赋予一个值。"
            }
        ]
    },
    
    "停止强制设置玩家位置" : {
        "描述" : "取消“开始强制设置玩家位置”行动对指定的一名或多名玩家造成的影响。这些玩家将从其最后被强制设置到的位置开始进行正常移动。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "停止强制设置下列玩家的位置。"
            }
        ]
    },
    
    "开始强制设置玩家轮廓" : {
        "描述" : "从观察玩家的视角看，设置被观察的玩家的轮廓的可见性和颜色。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "被观察的玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "被观察的玩家的轮廓将被修改。"
            },
            {
                "名称" : "观察玩家",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "从观察玩家的视角看，被观察的玩家的轮廓将被修改。"
            },
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "指定玩家的轮廓是否可见。"
            },
            {
                "名称" : "颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "指定玩家的轮廓的颜色（如果可见）。如果选择了特定的队伍，那么此颜色将为红色或蓝色，取决于此队伍是观察者的友方还是敌方。"
            },
            {
                "名称" : "可见类型",
                "类型" : "轮廓",
                "默认" : "默认",
                "说明" : "指定玩家的轮廓可见时，其轮廓的显示类型。"
            }
        ]
    },
    
    "停止强制设置玩家轮廓" : {
        "描述" : "从观察玩家的视角看，取消被观察的玩家的“开始强制设置玩家轮廓”效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "被观察的玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列被观察的玩家的轮廓将被设置。"
            },
            {
                "名称" : "观察玩家",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "从观察玩家的视角看，被观察的玩家的轮廓将被重新设置。"
            }
        ]
    },
    
    "开始限制阈值" : {
        "描述" : "定义玩家移动输入的最大值和最小值，可能会强迫或阻止玩家移动。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将被强制或限制移动。"
            },
            {
                "名称" : "向前最小",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "设置向前行进的最小速度。设为0时玩家可以停下，设为1时将强迫玩家全速向前移动。"
            },
            {
                "名称" : "向前最大",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "设置向前行进的最大速度。设为0时玩家将无法前进，设为1时玩家可以全速向前移动。"
            },
            {
                "名称" : "向后最小",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "设置向后行进的最小速度。设为0时玩家可以停下，设为1时将强迫玩家全速向后移动。"
            },
            {
                "名称" : "向后最大",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "设置向后行进的最大速度。设为0时玩家将无法后退，设为1时玩家可以全速向后移动。"
            },
            {
                "名称" : "侧向最小",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "设置向后行进的最小速度。设为0时玩家可以停下，设为1时将强迫玩家全速向侧向移动。"
            },
            {
                "名称" : "侧向最大",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "设置侧向行进的最大速度。设为0时玩家将无法侧移，设为1时玩家可以全速向侧向移动。"
            }
        ]
    },
    
    "停止限制阈值" : {
        "描述" : "取消“开始限制阈值”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的移动将恢复正常。"
            }
        ]
    },
    
    "开始定向阈值" : {
        "描述" : "为一名或多名玩家设置或添加阈值（方向性输入控制），对其向指定方向的移动做出限制。取消之前所有的定向阈值。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置或添加下列玩家的阈值。"
            },
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "设置或添加阈值的单位方向。此值将进行内部归一化。"
            },
            {
                "名称" : "幅度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "阈值的值（或改变值）。值为1时表示阈值为满。"
            },
            {
                "名称" : "相对",
                "类型" : "相对",
                "默认" : "至地图",
                "说明" : "确定此方向是相对于地图坐标还是玩家的本地坐标。"
            },
            {
                "名称" : "行为",
                "类型" : "阈值行为",
                "默认" : "替换现有阈值",
                "说明" : "指定需要替换或添加的已存在的阈值。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "阈值更新",
                "默认" : "方向和幅度",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            }
        ]
    },
    
    "停止定向阈值" : {
        "描述" : "取消“开始定向阈值”所造成的行为。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "恢复下列玩家的默认阈值控制。"
            }
        ]
    },
    
    "开始转换阈值" : {
        "描述" : "开始转换（放大并旋转）一名或多名玩家的阈值（方向输入控制）。取消所有已存在的“开始转换阈值”动作。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "转换下列玩家的阈值。"
            },
            {
                "名称" : "X轴缩放",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "下列玩家阈值的X轴（左右方向）将会乘以此数值，然后转换到新的相对方向。这个值会不断被重新赋值（每一帧都会更新）。"
            },
            {
                "名称" : "Y轴缩放",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "下列玩家阈值的Y轴（前后方向）将会乘以此数值，然后转换到新的相对方向。这个值会不断被重新赋值（每一帧都会更新）。"
            },
            {
                "名称" : "相对方向",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "应用轴向缩放时，玩家的阈值将会被转换为相对此单位方向的矢量。例如，如果阈值转换至相对摄像机视角，则以摄像机的朝向为基准计算方向。这个值会不断被重新赋值（每一帧都会更新）并进行内部归一化。"
            }
        ]
    },
    
    "停止转换阈值" : {
        "描述" : "停止由“开始转换阈值”所开始的转换效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "停止转换下列玩家的阈值。"
            }
        ]
    },
    
    "设置状态" : {
        "描述" : "对一名或多名玩家施加一个状态。此状态会持续指定的“持续时间”，或直到被“清除状态”动作清除。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将被施加此状态。"
            },
            {
                "名称" : "助攻者",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "如果在效果持续期间受到影响的玩家被击杀，则视为此名玩家完成的助攻。如果“助攻者”设置为“空”则此助攻不会归到任何玩家名下。"
            },
            {
                "名称" : "状态",
                "类型" : "状态",
                "默认" : "被入侵",
                "说明" : "对指定玩家施加此状态。此状态与玩家使用英雄技能时施放的状态效果相同。"
            },
            {
                "名称" : "持续时间",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "状态持续时间，以秒为单位。如果要让状态持续直到执行“清除状态”动作为止，可以输入较长的持续时间，如9999。"
            }
        ]
    },
    
    "清除状态" : {
        "描述" : "清除一个或多个玩家身上由“设置状态”动作施加的一个状态。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的状态将被清除。"
            },
            {
                "名称" : "状态",
                "类型" : "状态",
                "默认" : "被入侵",
                "说明" : "从指定玩家身上清除的状态。"
            }
        ]
    },
    
    "可用按钮" : {
        "描述" : "取消“禁用按钮”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的按钮将重新启用。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "将要重新启用的逻辑按键。"
            }
        ]
    },
    
    "禁用按钮" : {
        "描述" : "禁用一名或多名玩家的逻辑按键，按下此按键后不会产生效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的按钮将被禁用。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "禁用的逻辑按钮。"
            }
        ]
    },
    
    "取消主要动作" : {
        "描述" : "取消一名或多名玩家启动技能的设置。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的启动技能将取消。"
            }
        ]
    },
    
    "传送" : {
        "描述" : "将一名或多名玩家传送到指定位置。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将被传送。"
            },
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "玩家将被传送到的位置。如果此处填入一名玩家，则使用此玩家所在的位置。"
            }
        ]
    },
    
    "伤害" : {
        "描述" : "立刻为一名或多名玩家造成伤害，可能会杀死玩家。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将受到伤害。"
            },
            {
                "名称" : "伤害者",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "伤害视为此名玩家造成的。如果“伤害者”设置为“空”则此伤害不会归到任何玩家名下。"
            },
            {
                "名称" : "伤害量",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "造成的治疗量。此数值可能会受到增益、减益状态或护甲的影响。"
            }
        ]
    },
    
    "复活" : {
        "描述" : "立即使一名到多名玩家在其死亡的位置复活，无需等待时间。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将被复活。"
            }
        ]
    },
    
    "复生" : {
        "描述" : "使一名或多名玩家在适当的复生位置复生并恢复至最大生命值，对仍然存活的玩家依然有效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将复生。"
            }
        ]
    },
    
    "击杀" : {
        "描述" : "立即杀死一名或多名玩家。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将被杀死。"
            },
            {
                "名称" : "击杀者",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "击杀视为此名玩家造成的。如果“击杀者”设置为“空”则此击杀不会归到任何玩家名下。"
            }
        ]
    },
    
    "修改玩家分数" : {
        "描述" : "修改一名或多名玩家的分数（击杀数）。此动作只会在自由混战模式中生效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的分数将被改变。"
            },
            {
                "名称" : "得分",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "增加或减少的分数。如果为正数则增加分数，为负数则减少分数。"
            }
        ]
    },
    
    "对所有玩家启用死亡回放" : {
        "描述" : "使一名或多名玩家死亡后可以观看所有玩家的比赛，而不止是自己的盟友。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将可以观看所有玩家。"
            }
        ]
    },
    
    "对所有玩家禁用死亡回放" : {
        "描述" : "取消“对所有玩家启用死亡回放”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家死亡后观战的行为将恢复正常。"
            }
        ]
    },
    
    "启用死亡回放时目标的HUD" : {
        "描述" : "使一名或多名玩家在死亡后观战时看到目标的HUD信息，而不是他们自己的。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家在死亡后观战时将看到观战目标的HUD信息。"
            }
        ]
    },
    
    "禁用死亡回放时目标的HUD" : {
        "描述" : "取消“死亡回放时启用目标的HUD”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家在死亡后观战时将看到他们自己的HUD信息。"
            }
        ]
    },
    
    "按下按键" : {
        "描述" : "强制一名或多名玩家按下虚拟按键，持续一帧。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将强制按下按键。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "要按下的按键。"
            }
        ]
    },
    
    "施加推力" : {
        "描述" : "立即使一名或多名玩家的移动速度发生改变。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的速度将被改变。"
            },
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "施加推力的单位方向。此值将进行内部归一化。"
            },
            {
                "名称" : "速度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "玩家速度改变的数值。"
            },
            {
                "名称" : "相对",
                "类型" : "相对",
                "默认" : "至地图",
                "说明" : "确定此方向是相对于地图坐标还是玩家的本地坐标。"
            },
            {
                "名称" : "运动",
                "类型" : "相反运动",
                "默认" : "取消相反运动",
                "说明" : "确定在施加推力前是否首先消除已有的与此方向相反的速度。"
            }
        ]
    },
    
    "设置不可见" : {
        "描述" : "使一名或多名玩家变为隐形，此效果可对所有玩家生效，也可以只对敌人生效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将变得隐形。"
            },
            {
                "名称" : "不可见",
                "类型" : "不可见",
                "默认" : "全部",
                "说明" : "将要对下列玩家隐形。"
            }
        ]
    },
    
    "交流" : {
        "描述" : "使一名或多名玩家使用一个表情、语音或其他已装备的方式进行交流。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将自动开始交流。"
            },
            {
                "名称" : "类型",
                "类型" : "交流",
                "默认" : "语音（上）",
                "说明" : "交流的类型。"
            }
        ]
    },
    
    "治疗" : {
        "描述" : "立刻为一名或多名玩家恢复生命值。此治疗效果不会复活已死亡的玩家。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将恢复生命值。"
            },
            {
                "名称" : "治疗者",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "治疗视为此名玩家造成的。如果“治疗者”设置为“无”则此治疗不会归到任何玩家名下。"
            },
            {
                "名称" : "治疗量",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "造成的治疗量。此数值可能会受到增益或减益状态的影响。治疗量不会超过每名玩家的最大生命值。"
            }
        ]
    },
    
    "设置主要攻击模式启用" : {
        "描述" : "启用或禁用一名或多名玩家的主要攻击模式。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的主要攻击模式将受到影响。"
            },
            {
                "名称" : "启用",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "指定一名或多名玩家是否能够使用主要攻击模式。此处应为一个布尔，如“真”、“假”或“比较式”。"
            }
        ]
    },
    
    "设置辅助攻击模式启用" : {
        "描述" : "启用或禁用一名或多名玩家的辅助攻击模式。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的辅助攻击模式将受到影响。"
            },
            {
                "名称" : "启用",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "指定一名或多名玩家是否能够使用辅助攻击模式。此处应为一个布尔，如“真”、“假”或“比较式”。"
            }
        ]
    },
    
    "设置启用技能 1" : {
        "描述" : "启用或禁用一名或多名玩家的技能 1。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的技能 1将受到影响。"
            },
            {
                "名称" : "启用",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "玩家是否可以使用技能 1。此处应为一个布尔，如“真”、“假”或“比较式”。"
            }
        ]
    },

    "设置启用技能 2" : {
        "描述" : "启用或禁用一名或多名玩家的技能 2。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的技能 2将受到影响。"
            },
            {
                "名称" : "启用",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "玩家是否可以使用技能 2。此处应为一个布尔，如“真”、“假”或“比较式”。"
            }
        ]
    },
    
    "设置启用终极技能" : {
        "描述" : "启用或禁用一名或多名玩家的终极技能。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的终极技能将受到影响。"
            },
            {
                "名称" : "启用",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "玩家是否可以使用终极技能。此处应为一个布尔，如“真”、“假”或“比较式”。"
            }
        ]
    },
    
    "设置启用近战攻击" : {
        "描述" : "启用或禁用一名或多名玩家的近战攻击。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的近战攻击将受到影响。"
            },
            {
                "名称" : "启用",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "玩家是否可以使用近战攻击。此处应为一个布尔，如“真”、“假”或“比较式”。"
            }
        ]
    },
    
    "设置启用装填" : {
        "描述" : "启用或禁用一名或多名玩家的装填。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的装填将受到影响。"
            },
            {
                "名称" : "启用",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "玩家是否可以使用装填。此处应为一个布尔，如“真”、“假”或“比较式”。"
            }
        ]
    },
    
    "设置启用跳跃" : {
        "描述" : "启用或禁用一名或多名玩家的跳跃动作。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的跳跃动作将受到影响。"
            },
            {
                "名称" : "启用",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "玩家是否可以使用跳跃。此处应为一个布尔，如“真”、“假”或“比较式”。"
            }
        ]
    },
    
    "设置启用蹲下" : {
        "描述" : "启用或禁用一名或多名玩家的蹲下动作。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的下蹲动作将受到影响。"
            },
            {
                "名称" : "启用",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "玩家是否可以使用蹲下。此处应为一个布尔，如“真”、“假”或“比较式”。"
            }
        ]
    },
    
    "设置终极技能充能" : {
        "描述" : "将一名或多名玩家的终极技能充能设为最大充能的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的终极技能充能。"
            },
            {
                "名称" : "充能百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "最大的充能百分比。"
            }
        ]
    },
    
    "设置技能资源" : {
        "描述" : "设置一名或多名玩家的技能资源百分比（如果支持的话）。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的技能资源百分比将被修改。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "与此技能关联的逻辑按钮将被修改。"
            },
            {
                "名称" : "资源百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "技能资源相对于每位玩家技能资源量的百分比。"
            }
        ]
    },
    
    "设置技能充能" : {
        "描述" : "设置一名或多名玩家的技能充能次数（如果支持的话）。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的技能充能次数将被修改。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "与此技能关联的逻辑按钮将被修改。"
            },
            {
                "名称" : "充能计数",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "要设置的充能次数。"
            }
        ]
    },
    
    "设置技能冷却" : {
        "描述" : "设置一名或多名玩家的技能冷却时间（如果支持的话）。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的技能冷却时间将被修改。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "与此技能关联的逻辑按钮将被修改。"
            },
            {
                "名称" : "冷却时间",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "设置冷却时间，单位为秒。"
            }
        ]
    },
    
    "设置武器" : {
        "描述" : "设置一名或多名玩家的武器。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的武器。"
            },
            {
                "名称" : "武器",
                "类型" : "0000000",
                "默认" : "1",
                "说明" : "正在装备的武器号码。1为主武器，2为辅助武器。如果指定的武器不存在，玩家将使用默认武器。"
            }
        ]
    },
    
    "设置弹药" : {
        "描述" : "设置一名或多名玩家的弹药数量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家面朝的弹药数量。"
            },
            {
                "名称" : "弹夹",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "设置索引处弹夹的弹药数量。0为第一个弹夹，1为第二个。若指定类型不存在，则不进行任何操作。"
            },
            {
                "名称" : "弹药",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "要设置的弹药数量。"
            }
        ]
    },
    
    "设置最大弹药" : {
        "描述" : "设置一名或多名玩家的最大弹药数量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家面朝的最大弹药数量。"
            },
            {
                "名称" : "弹夹",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "设置索引处弹夹的弹药数量。0为第一个弹夹，1为第二个。若指定类型不存在，则不进行任何操作。"
            },
            {
                "名称" : "弹药",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "要设置的最大弹药数量。"
            }
        ]
    },
    
    "设置弹道引力" : {
        "描述" : "将一名或多名玩家的弹道引力设置为正常弹道引力的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的弹道引力。"
            },
            {
                "名称" : "弹道引力百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家个人的弹道引力设置为此百分比。"
            }
        ]
    },
    
    "设置弹道速度" : {
        "描述" : "将一名或多名玩家的弹道速度设置为正常弹道速度的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的弹道速度。"
            },
            {
                "名称" : "弹道速度百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家个人的弹道速度设置为此百分比。"
            }
        ]
    },
    
    "设置瞄准速度" : {
        "描述" : "将一名或多名玩家的瞄准速度设置为其原始瞄准速度的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的瞄准速度。"
            },
            {
                "名称" : "转向速度百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家的瞄准速度设置为此百分比。"
            }
        ]
    },
    
    "设置移动速度" : {
        "描述" : "将一名或多名玩家的移动速度设置为其原始移动速度的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的移动速度。"
            },
            {
                "名称" : "移动速度百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家的移动速度设置为此百分比。"
            }
        ]
    },
    
    "设置跳跃垂直速度" : {
        "描述" : "将一名或多名玩家的跳跃垂直速度设置为其原始跳跃垂直速度的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的跳跃垂直速度。"
            },
            {
                "名称" : "垂直跳跃速度百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家的跳跃垂直速度设置为此百分比。"
            }
        ]
    },
    
    "设置朝向" : {
        "描述" : "设置一名或多名玩家面向的方向。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家面朝的方向。"
            },
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "玩家面朝的单位方向。此值将进行内部归一化。"
            },
            {
                "名称" : "相对",
                "类型" : "相对",
                "默认" : "至地图",
                "说明" : "确定此方向是相对于地图坐标还是玩家的本地坐标。"
            }
        ]
    },
    
    "设置引力" : {
        "描述" : "将一名或多名玩家的移动引力设置为正常行动引力的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的移动引力。"
            },
            {
                "名称" : "引力百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家个人的移动引力设置为此百分比。"
            }
        ]
    },
    
    "设置造成伤害" : {
        "描述" : "将一名或多名玩家造成的伤害设置为其原始造成伤害的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家造成的伤害。"
            },
            {
                "名称" : "造成伤害百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家所造成的伤害设置为此百分比。"
            }
        ]
    },
    
    "设置受到伤害" : {
        "描述" : "将一名或多名玩家受到的伤害设置为其原始受到伤害的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家受到的伤害。"
            },
            {
                "名称" : "受到伤害百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家所受到的伤害设置为此百分比。"
            }
        ]
    },
    
    "设置造成治疗" : {
        "描述" : "将一名或多名玩家造成的治疗效果设置为其原始造成治疗的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家造成的治疗。"
            },
            {
                "名称" : "造成治疗百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家所造成的治疗设置为此百分比。"
            }
        ]
    },
    
    "设置受到治疗" : {
        "描述" : "将一名或多名玩家受到的治疗效果设置为其原始受到治疗的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家受到的治疗。"
            },
            {
                "名称" : "受到治疗百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家所受到的治疗设置为此百分比。"
            }
        ]
    },
    
    "设置造成的击退" : {
        "描述" : "将一名或多名玩家造成的击退效果设置为其原始造成击退效果的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家造成的击退。"
            },
            {
                "名称" : "造成击退百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家造成的击退效果设置为其原始造成击退效果的此百分比。"
            }
        ]
    },
    
    "设置受到的击退" : {
        "描述" : "将一名或多名玩家受到的击退效果设置为其原始受到击退效果的一定百分比。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家受到的击退。"
            },
            {
                "名称" : "受到击退百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将玩家受到的击退效果设置为其原始受到击退效果的此百分比。"
            }
        ]
    },
    
    "设置玩家生命值" : {
        "描述" : "设置一名或多名玩家的生命值，同时不影响状态，也不造成伤害/治疗。此行动只会对还活着的玩家造成影响。（对死去的玩家，请使用“复活玩家”动作。）",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "将玩家的生命设为此值。"
            },
            {
                "名称" : "生命值",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "玩家所能拥有的最大生命值。"
            }
        ]
    },
    
    "设置最大生命值" : {
        "描述" : "将一名或多名玩家的最大生命值设置为其原始最大生命值的一定百分比。此动作会保证玩家当前的生命值不会超过其新的最大生命值。由地图工坊动作添加的生命池不会受此动作影响。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的最大生命值将被设定。"
            },
            {
                "名称" : "生命百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "将这些玩家的最大生命值设为其原始最大生命值的百分比。"
            }
        ]
    },
    
    "设置地形消灭者玩家" : {
        "描述" : "设置当指定玩家降落在地面前被地形消灭时，会被归为地形消灭者的玩家。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "目标",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "目标玩家的阵亡将被纳入判断。"
            },
            {
                "名称" : "地形消灭者玩家",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "当目标玩家在降落到地面前死于地形效果时，此消灭视为此名玩家造成的。如果“地形消灭者玩家”设置为“空”则此消灭不会归到任何玩家名下。"
            }
        ]
    },
    
    "设置最大复生时间" : {
        "描述" : "设置一名或多名玩家死亡与复生之间的持续时间。对此动作执行时已经死亡的玩家，此效果将在他们下次死亡时生效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的最大复生时间。"
            },
            {
                "名称" : "时间",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "死亡与复生之间的持续时间，以秒为单位。"
            }
        ]
    },
    
    "设置玩家分数" : {
        "描述" : "设置一名或多名玩家的分数（击杀数）。此动作只在自由混战模式中生效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的分数。"
            },
            {
                "名称" : "得分",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "要设置的分数。"
            }
        ]
    },
    
    "设置玩家可选的英雄" : {
        "描述" : "设置一名或多名玩家可用的英雄列表。如果玩家当前所使用的英雄变得不可用，则此玩家将被强制选择另一名英雄，并在适当的复生位置复生。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "设置下列玩家的英雄列表。"
            },
            {
                "名称" : "英雄",
                "类型" : "0000000",
                "默认" : "英雄(安娜)",
                "说明" : "可供选择的英雄。如果没有提供英雄，此动作无效。"
            }
        ]
    },
    
    "重置玩家英雄可选状态" : {
        "描述" : "将一名或多名玩家可用的英雄列表恢复至游戏设置所指定的英雄列表。如果玩家当前所使用的英雄变得不可用，则此玩家将被强制选择另一名英雄，并在适当的复生位置复生。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的英雄列表将被重置。"
            }
        ]
    },
    
    "预加载英雄" : {
        "描述" : "预先为指定的玩家将指定的英雄及皮肤加载入内存。当需要经常改变英雄且已知接下来要使用哪个英雄时适用。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将开始预载一名或多名英雄。对每名玩家，同一时间只能有一个“预载英雄”动作生效。"
            },
            {
                "名称" : "英雄",
                "类型" : "0000000",
                "默认" : "英雄(安娜)",
                "说明" : "指定玩家将在此列表中选择英雄。当数组中出现多个英雄时，将会优先选择排在前面的英雄。"
            }
        ]
    },
    
    "移除玩家" : {
        "描述" : "将一名或多名玩家移出自定游戏。此动作对机器人无效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将被移除。"
            }
        ]
    },
    
    "设置目标点描述" : {
        "描述" : "将屏幕顶部正中通常用来显示目标点信息的文字修改为其他信息，对指定的玩家可见。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "下列玩家将看到此信息。"
            },
            {
                "名称" : "标题",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "将要显示的信息。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "文本更新",
                "默认" : "可见和字符串",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。这段信息会要求输入新的数值，并用输入的数值进行重新赋值。"
            }
        ]
    },
    
    "设置慢动作" : {
        "描述" : "设置整个游戏的模拟速率，包括所有玩家、弹道、效果及游戏模式逻辑。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "速度百分比",
                "类型" : "0000000",
                "默认" : "100",
                "说明" : "模拟速率与正常速率的百分比。此数值不得超过100"
            }
        ]
    },
    
    //----------------------------------------------
    "显示姓名板" : {
        "描述" : "从观察玩家的视角看，取消被观察的玩家的“隐藏姓名板”效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "被观察的玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列被观察的玩家的姓名板将被显示。"
            },
            {
                "名称" : "观察玩家",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "从此观察玩家的视角看，被观察的玩家的姓名板将被显示。"
            }
        ]
    },
    
    "隐藏姓名板" : {
        "描述" : "从观察玩家的视角看，被观察的玩家的姓名板将被隐藏。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "被观察的玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列被观察的玩家的姓名板将被隐藏。"
            },
            {
                "名称" : "观察玩家",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "从此观察玩家的视角看，被观察的玩家的姓名板将被隐藏。"
            }
        ]
    },
    
    "显示消灭提示" : {
        "描述" : "取消“隐藏消灭提示”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的消灭提示将被显示。"
            }
        ]
    },
    
    "隐藏消灭提示" : {
        "描述" : "隐藏一名或多名玩家的消灭提示，直到重新被显示为止。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的消灭提示将被隐藏。"
            }
        ]
    },
    
    "显示游戏模式HUD" : {
        "描述" : "取消“隐藏游戏模式HUD”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的游戏模式HUD将被显示。"
            }
        ]
    },
    
    "隐藏游戏模式HUD" : {
        "描述" : "隐藏一名或多名玩家的游戏模式HUD，直到重新被显示为止。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的游戏模式HUD将被隐藏。"
            }
        ]
    },
    
    "显示游戏模式地图UI" : {
        "描述" : "取消“隐藏游戏模式地图UI”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的游戏模式地图UI将被显示。"
            }
        ]
    },
    
    "隐藏游戏模式地图UI" : {
        "描述" : "隐藏一名或多名玩家的游戏模式地图UI，直到重新被显示为止。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的游戏模式地图UI将被隐藏。"
            }
        ]
    },
    
    "显示英雄HUD" : {
        "描述" : "取消“隐藏英雄HUD”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的英雄HUD将被显示。"
            }
        ]
    },
    
    "隐藏英雄HUD" : {
        "描述" : "隐藏一名或多名玩家的英雄HUD，直到重新被显示为止。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的英雄HUD将被隐藏。"
            }
        ]
    },
    
    "显示计分板" : {
        "描述" : "取消“隐藏计分板”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的计分板将被显示。"
            }
        ]
    },
    
    "隐藏计分板" : {
        "描述" : "隐藏一名或多名玩家的消灭提示，直到重新被显示为止。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的计分板将被隐藏。"
            }
        ]
    },
    
    "显示信息" : {
        "描述" : "取消“隐藏信息”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的信息将被显示。"
            }
        ]
    },
    
    "隐藏信息" : {
        "描述" : "隐藏一名或多名玩家的信息，直到重新被显示为止。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的信息将被隐藏。"
            }
        ]
    },
    
    "启用语音聊天" : {
        "描述" : "取消“禁用语音聊天”动作对一个或多个玩家的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的语音聊天将被启用。"
            }
        ]
    },
    
    "禁用语音聊天" : {
        "描述" : "禁用一名或多名玩家的语音聊天，直到重新被启用为止。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的语音聊天将被启用。"
            },
            {
                "名称" : "队伍语音聊天",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "队伍语音聊天是否禁用。"
            },
            {
                "名称" : "比赛语音聊天",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "比赛语音聊天是否禁用。"
            },
            {
                "名称" : "小队语音聊天",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "小队语音聊天是否禁用。"
            }
        ]
    },
    
    "启用文字聊天" : {
        "描述" : "取消“禁用文字聊天”动作对一个或多个玩家的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的文字聊天将被启用。"
            }
        ]
    },
    
    "禁用文字聊天" : {
        "描述" : "禁用一名或多名玩家的文字聊天，直到重新被启用为止。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的文字聊天将被禁用。"
            }
        ]
    },
    
    "开启游戏预设完成条件" : {
        "描述" : "取消“关闭游戏预设完成条件”动作的效果。",
        "返回" : "无",
        "参数" : []
    },
    
    "关闭游戏预设完成条件" : {
        "描述" : "取消游戏模式自带的完成条件，比赛只由程序命令完成。",
        "返回" : "无",
        "参数" : []
    },
    
    "开启游戏预设计分模式" : {
        "描述" : "取消“关闭游戏预设计分模式”动作的效果。",
        "返回" : "无",
        "参数" : []
    },
    
    "关闭游戏预设计分模式" : {
        "描述" : "取消游戏模式本身对玩家和队伍进行的计分，分数只会由程序命令改变。",
        "返回" : "无",
        "参数" : []
    },
    
    "开启游戏预设通告模式" : {
        "描述" : "取消“关闭游戏预设通告模式”动作的效果。",
        "返回" : "无",
        "参数" : []
    },
    
    "关闭游戏预设通告模式" : {
        "描述" : "禁用游戏模式中所有提示语音，直到重新启用或比赛结束为止。",
        "返回" : "无",
        "参数" : []
    },
    
    "开启游戏预设复生模式" : {
        "描述" : "取消“关闭游戏预设复生模式”动作的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的复生将受到影响。"
            }
        ]
    },
    
    "关闭游戏预设复生模式" : {
        "描述" : "使一名或多名玩家不再自动复生，只允许其在程序命令控制下复生。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家的复生将受到影响。"
            }
        ]
    },
    
    "开启游戏预设音乐模式" : {
        "描述" : "取消“关闭游戏预设音乐模式”动作的效果。",
        "返回" : "无",
        "参数" : []
    },
    
    "关闭游戏预设音乐模式" : {
        "描述" : "禁用游戏模式中所有音乐，直到重新启用或比赛结束为止。",
        "返回" : "无",
        "参数" : []
    },
    
    //----------------------------------------------
    "宣告回合胜利" : {
        "描述" : "宣布一支队伍为当前回合的胜利方。只在占领要点模式和决斗先锋模式中可用。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "本回合获胜队伍",
                "类型" : "0000000",
                "默认" : "所有队伍",
                "说明" : "本回合获胜队伍"
            }
        ]
    },
    
    "宣告玩家胜利" : {
        "描述" : "立即结束比赛并指定一名玩家为胜利者。此动作只在自由混战模式中生效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获胜的玩家。"
            }
        ]
    },
    
    "宣告队伍胜利" : {
        "描述" : "立即结束比赛，并指定获胜的队伍。此动作在自由混战模式中无效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "0000000",
                "默认" : "所有队伍",
                "说明" : "获胜队伍。"
            }
        ]
    },
    
    "宣布比赛为平局" : {
        "描述" : "立即结束比赛，且结果为平局。此动作在自由混战模式中无效。",
        "返回" : "无",
        "参数" : []
    },
    
    "宣布回合为平局" : {
        "描述" : "宣布当前回合为平局。只在决斗先锋模式中可用。",
        "返回" : "无",
        "参数" : []
    },
    
    "比赛时间暂停" : {
        "描述" : "暂停比赛时间。玩家、目标点逻辑、以及游戏模式的进展标准不会受暂停的影响。",
        "返回" : "无",
        "参数" : []
    },
    
    "比赛时间继续" : {
        "描述" : "取消比赛时间暂停。",
        "返回" : "无",
        "参数" : []
    },
    
    "前往集结英雄" : {
        "描述" : "回到比赛模式的集结英雄阶段。只有在游戏正在进行中时生效。",
        "返回" : "无",
        "参数" : []
    },
    
    "设置比赛时间" : {
        "描述" : "设置当前比赛时间（玩家可在屏幕顶端看到）。此行动可以用来缩短或延长比赛的持续时间，或改变集结英雄或准备阶段的时间。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "时间",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "比赛时间，单位为秒。"
            }
        ]
    },
    
    "重新开始比赛" : {
        "描述" : "重新开始比赛。此动作仅在比赛存在30秒后才可生效。",
        "返回" : "无",
        "参数" : []
    },
    
    "返回大厅" : {
        "描述" : "将游戏模式返回至自定游戏大厅。",
        "返回" : "无",
        "参数" : []
    },
    
    "调整玩家队伍" : {
        "描述" : "将一名或多名玩家移动至指定队伍和栏位。指定栏位不可用时，此动作会失败。此动作对机器人无效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "下列玩家将被移动。"
            },
            {
                "名称" : "队伍",
                "类型" : "0000000",
                "默认" : "所有队伍",
                "说明" : "将玩家移动至此队伍。“全部”选项只适用于自由混战模式，“队伍”选项只适用于基于队伍的游戏模式。"
            },
            {
                "名称" : "栏位",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "在此玩家栏位添加玩家（-1表示第一个可用的空位）。"
            }
        ]
    },
    
    "设置队伍分数" : {
        "描述" : "设置一方或双方队伍的分数。此动作在自由混战模式或没有队伍分数的模式中无效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "0000000",
                "默认" : "所有队伍",
                "说明" : "要设置分数的队伍。"
            },
            {
                "名称" : "得分",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "要设置的分数。"
            }
        ]
    },
    
    "修改队伍分数" : {
        "描述" : "改变一方或双方队伍的分数。此动作在自由混战模式或没有队伍分数的模式中无效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "0000000",
                "默认" : "所有队伍",
                "说明" : "要改变分数的队伍。"
            },
            {
                "名称" : "得分",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "增加或减少的分数。如果为正数则增加分数，为负数则减少分数。"
            }
        ]
    },
    
    "开始强制重生室" : {
        "描述" : "强制一支队伍在指定的重生室重生，不管在游戏模式中应当使用哪个重生室。此动作只会在攻防作战、攻击/护送和运载目标地图上生效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "0000000",
                "默认" : "所有队伍",
                "说明" : "这支队伍将被强制使用指定重生室。"
            },
            {
                "名称" : "重生室",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "强制使用的重生室编号。0为第一间重生室，1为第二间，2为第三间。如果指定的重生室不存在，则玩家会使用正常状态下的重生室。"
            }
        ]
    },
    
    "停止强制重生室" : {
        "描述" : "取消“开始强制使用重生室”动作对一支队伍的效果。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "0000000",
                "默认" : "所有队伍",
                "说明" : "这支队伍将使用正常状态下的重生室重生。"
            }
        ]
    },
    
    //----------------------------------------------
    "创建HUD文本" : {
        "描述" : "在指定玩家屏幕上的指定位置创建一条HUD文本。此文本会持续至消除为止。如果想指定此文本，可使用“上一个文本ID”的返还值。如果已创建了太多的文本元素，此动作可能会失败。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "下列玩家将会看到这条HUD文本。"
            },
            {
                "名称" : "标题",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "将要显示的文本（可以为空）。"
            },
            {
                "名称" : "子标题",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "将要显示的子标题文本（可以为空）。"
            },
            {
                "名称" : "文本",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "将要显示的正文文本（可以为空）。"
            },
            {
                "名称" : "坐标",
                "类型" : "坐标",
                "默认" : "左边",
                "说明" : "文本在屏幕上出现的位置。"
            },
            {
                "名称" : "排序",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此文本与其他在同样位置的文本的排序关系。排序较高的文本会在排序较低的文本之后显示。"
            },
            {
                "名称" : "标题颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "所创建标题文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。"
            },
            {
                "名称" : "子标题颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "所创建子标题文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。"
            },
            {
                "名称" : "文本颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "所创建文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "文本更新",
                "默认" : "可见和字符串",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            },
            {
                "名称" : "无队伍观战者",
                "类型" : "观战可见",
                "默认" : "默认可见度",
                "说明" : "无队伍观战者是否可以看到此文本。"
            }
        ]
    },
    
    "消除HUD文本" : {
        "描述" : "消除由”创建HUD文本“所创建的HUD文本。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "文本ID",
                "类型" : "0000000",
                "默认" : "上一个文本ID",
                "说明" : "指定要消除的HUD文本。此ID可以是“上一个文本ID”，或一个之前储存“上一个文本ID”的变量。"
            }
        ]
    },
    
    "消除所有HUD文本" : {
        "描述" : "消除由“创建HUD文本”动作所创建的所有HUD文本。",
        "返回" : "无",
        "参数" : []
    },
    
    "创建进度条HUD文本" : {
        "描述" : "在指定玩家屏幕上的指定位置创建一条进度条HUD文本。此文本会持续至消除为止。如果想指定此文本，可使用“上一个文本ID”的返还值。如果已创建了太多的文本元素，此动作可能会失败。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "下列玩家将会看到这条进度条HUD文本。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "将要显示的进度条值，为从0到100的百分比。"
            },
            {
                "名称" : "文本",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "将要显示的文本（可以为空）。"
            },
            {
                "名称" : "坐标",
                "类型" : "坐标",
                "默认" : "左边",
                "说明" : "文本在屏幕上出现的位置。"
            },
            {
                "名称" : "排序",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此文本与其他在同样位置的文本的排序关系。排序较高的文本会在排序较低的文本之后显示。"
            },
            {
                "名称" : "进度条颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "所创建进度条文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。"
            },
            {
                "名称" : "文本颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "所创建文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "进度条更新",
                "默认" : "可见，值和颜色",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。这段文本会要求输入新的数值，并用输入的数值进行重新赋值。"
            },
            {
                "名称" : "无队伍观战者",
                "类型" : "观战可见",
                "默认" : "默认可见度",
                "说明" : "无队伍观战者是否可以看到此文本。"
            }
        ]
    },
    
    "消除进度条HUD文本" : {
        "描述" : "消除由“创建进度条HUD文本”所创建的进度条HUD文本。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "文本ID",
                "类型" : "0000000",
                "默认" : "上一个文本ID",
                "说明" : "指定要消除的进度条HUD文本。此ID可以是“上一个文本ID”，或一个之前储存“上一个文本ID”的变量。"
            }
        ]
    },
    
    "创建进度条地图文本" : {
        "描述" : "在地图的指定位置创建一条进度条HUD文本，可以由指定玩家看到。此文本会持续至消除为止。如果想指定此文本，可使用“上一个文本ID”的返还值。如果已创建了太多的文本元素，此动作可能会失败。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "下列玩家将会看到这条进度条HUD文本。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "将要显示的进度条值，为从0到100的百分比。"
            },
            {
                "名称" : "文本",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "将要显示的文本（可以为空）。"
            },
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "文本所在位置。如果此值为一名玩家，那么文本将显示在这名玩家的头顶上方。否则，此值将代表地图中的一个位置。"
            },
            {
                "名称" : "大小",
                "类型" : "0000000",
                "默认" : "1",
                "说明" : "文本的大小。"
            },
            {
                "名称" : "截取",
                "类型" : "截取",
                "默认" : "根据表面截取",
                "说明" : "文本可以穿透墙壁或是将被遮挡。"
            },
            {
                "名称" : "进度条颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "所创建进度条文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。"
            },
            {
                "名称" : "文本颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "所创建文本的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "地图进度条更新",
                "默认" : "可见，值和颜色",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。这段文本会要求输入新的数值，并用输入的数值进行重新赋值。"
            },
            {
                "名称" : "无队伍观战者",
                "类型" : "观战可见",
                "默认" : "默认可见度",
                "说明" : "无队伍观战者是否可以看到此文本。"
            }
        ]
    },
    
    "消除进度条地图文本" : {
        "描述" : "消除由“创建进度条地图文本”动作所创建的进度条地图文本。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "文本ID",
                "类型" : "0000000",
                "默认" : "上一个文本ID",
                "说明" : "指定要消除的进度条地图文本。此ID可以是“上一个文本ID”，或一个之前储存“上一个文本ID”的变量。"
            }
        ]
    },
    
    "创建图标" : {
        "描述" : "创建一个地图中的图标实体。此实体会持续至消除为止。如果想指定此实体，可使用“上一个创建的实体”的返还值。如果已创建了太多的实体，此动作可能会失败。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "一名或多名玩家将可以看到此图标。"
            },
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "图标所在的位置。如果此值为一名玩家，那么图标将显示在这名玩家的头顶上方。否则，此值将代表地图中的一个位置。"
            },
            {
                "名称" : "图标",
                "类型" : "图标",
                "默认" : "箭头：向下",
                "说明" : "将要创建的图标。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "图标更新",
                "默认" : "可见和位置",
                "说明" : "指定此动作的哪个输入值将持续被重新赋值。此图标会一直要求并采用重新赋值所传入的值。"
            },
            {
                "名称" : "图标颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "所创建图标的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。"
            },
            {
                "名称" : "离开屏幕后显示",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "当此图标在你背后时是否显示？"
            }
        ]
    },
    
    "消除图标" : {
        "描述" : "消除通过“创建图标”所创建的一个图标实体。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "实体",
                "类型" : "0000000",
                "默认" : "最后创建的实体",
                "说明" : "指定要消除的图标实体。可以是“最后创建的实体”，或一个之前储存“最后创建的实体”的变量。"
            }
        ]
    },
    
    "消除所有图标" : {
        "描述" : "消除所有由“创建图标”所创建的图标实体。",
        "返回" : "无",
        "参数" : []
    },
    
    "创建地图文本" : {
        "描述" : "在地图的指定位置创建一条地图文本，可以由指定玩家看到。此文本会持续至消除为止。如果想指定此文本，可使用“上一个文本ID”的返还值。如果已创建了太多的文本元素，此动作可能会失败。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "下列玩家可以看到本条地图文本。"
            },
            {
                "名称" : "标题",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "将要显示的文本。"
            },
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "文本所在位置。如果此值为一名玩家，那么文本将显示在这名玩家的头顶上方。否则，此值将代表地图中的一个位置。"
            },
            {
                "名称" : "大小",
                "类型" : "0000000",
                "默认" : "1",
                "说明" : "文本的大小。"
            },
            {
                "名称" : "截取",
                "类型" : "截取",
                "默认" : "根据表面截取",
                "说明" : "文本可以穿透墙壁或是将被遮挡。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "地图文本更新",
                "默认" : "可见，位置和字符串",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。这段文本会要求输入新的数值，并用输入的数值进行重新赋值。"
            },
            {
                "名称" : "文本颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "指定地图文本使用的颜色"
            },
            {
                "名称" : "无队伍观战者",
                "类型" : "观战可见",
                "默认" : "默认可见度",
                "说明" : "无队伍观战者是否可以看到此文本。"
            }
        ]
    },
    
    "消除地图文本" : {
        "描述" : "清除“创建地图文本”所创建的地图文本。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "文本ID",
                "类型" : "0000000",
                "默认" : "上一个文本ID",
                "说明" : "指定要消除的地图文本。此ID可以是“上一个文本ID”，或一个之前储存“上一个文本ID”的变量。"
            }
        ]
    },
    
    "消除所有地图文本" : {
        "描述" : "消除所有“创建地图文本”所创建的所有地图文本。",
        "返回" : "无",
        "参数" : []
    },
    
    "创建效果" : {
        "描述" : "创建一个地图中的效果实体。此实体会持续至消除为止。如果想指定此实体，可使用“上一个创建的实体”的返还值。如果已创建了太多的实体，此动作可能会失败。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "一名或多名将家将可以看到此效果。"
            },
            {
                "名称" : "类型",
                "类型" : "基础效果",
                "默认" : "球体",
                "说明" : "将要创建的效果类型。启用特定地图工坊扩展可添加新的选项。"
            },
            {
                "名称" : "颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "所创建效果的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。对声音效果无效。不支持自定义颜色。"
            },
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "效果终点所在的位置。如果此值为一名玩家，那么该效果将与玩家一起移动。否则，此值将代表地图中的一个位置。"
            },
            {
                "名称" : "半径",
                "类型" : "0000000",
                "默认" : "1",
                "说明" : "效果的半径，单位为米。对声音效果则影响其音量。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "效果更新",
                "默认" : "可见，位置和半径",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            },
        ]
    },
    
    "创建光束效果" : {
        "描述" : "创建一个地图中的光束效果实体。此实体会持续至消除为止。如果想引用此实体，可使用“上一个创建的实体”的返还值。如果已创建了太多的实体，此动作可能会失败。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "一名或多名将家将可以看到此效果。"
            },
            {
                "名称" : "类型",
                "类型" : "基础光束效果",
                "默认" : "球体",
                "说明" : "将要创建的效果类型。启用特定地图工坊扩展可添加新的选项。"
            },
            {
                "名称" : "开始位置",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "效果开始的位置。如果此值为一名玩家，那么效果将随此玩家移动。否则，此值将代表地图中的一个位置。"
            },
            {
                "名称" : "结束位置",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "效果终点所在的位置。如果此值为一名玩家，那么该效果将与玩家一起移动。否则，此值将代表地图中的一个位置。"
            },
            {
                "名称" : "颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "所创建效果的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。不会影响音效，只会影响“有益”或“有害”的光束效果。不支持自定义颜色。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "效果更新",
                "默认" : "可见，位置和半径",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此效果会要求输入新的数值，并用输入的数值进行重新赋值。"
            },
        ]
    },
    
    "消除效果" : {
        "描述" : "消除一个由“创建效果”或“创建光束效果”所创建的效果实体。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "实体",
                "类型" : "0000000",
                "默认" : "最后创建的实体",
                "说明" : "指定要消除的效果实体。可以是“最后创建的实体”，或一个之前储存“最后创建的实体”的变量。"
            }
        ]
    },
    
    "消除所有效果" : {
        "描述" : "消除所有由“创建效果”或“创建光束效果”所创建的效果实体。",
        "返回" : "无",
        "参数" : []
    },
    
    "播放效果" : {
        "描述" : "在地图的指定位置播放一个效果。此效果的持续时间很短，所以不需要更新或消除。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "一名或多名将家将可以看到此效果。"
            },
            {
                "名称" : "类型",
                "类型" : "基础播放效果",
                "默认" : "有益爆炸",
                "说明" : "将要创建的效果类型。启用特定地图工坊扩展可添加新的选项。"
            },
            {
                "名称" : "颜色",
                "类型" : "0000000",
                "默认" : "颜色(白色)",
                "说明" : "所创建效果的颜色。如果选择了一支队伍，此效果将显示为红色或蓝色，根据观察者是否与这支队伍敌对决定。不支持自定义颜色。"
            },
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "效果所在位置。如果此值为一名玩家，那么效果将在此玩家所在位置播放。否则，此值将代表地图中的一个位置。"
            },
            {
                "名称" : "半径",
                "类型" : "0000000",
                "默认" : "1",
                "说明" : "效果的半径，单位为米。对声音效果则影响其音量。"
            }
        ]
    },
    
    "小字体信息" : {
        "描述" : "在准星下方显示小字体信息，对指定玩家可见。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "下列玩家将看到此信息。"
            },
            {
                "名称" : "标题",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "将要显示的信息。"
            }
        ]
    },
    
    "大字体信息" : {
        "描述" : "在准星上方显示大字体信息，对指定玩家可见。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "下列玩家将看到此信息。"
            },
            {
                "名称" : "标题",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "将要显示的信息。"
            }
        ]
    },
    
    "启用查看器录制" : {
        "描述" : "使地图工坊查看器可以继续录制新的条目（假如之前被禁用的话）。在特定时间开启录制可以更容易地对你的脚本逻辑中出问题的地方进行错误排查。",
        "返回" : "无",
        "参数" : []
    },
    
    "禁用查看器录制" : {
        "描述" : "使地图工坊查看器无法录制新的条目。此功能可以降低你的脚本对服务器造成的负担，特别是当修改数组时。",
        "返回" : "无",
        "参数" : []
    },
    
    "记入查看器" : {
        "描述" : "使地图工坊查看器录制一条记录。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "文本",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "将要记入地图工坊查看器的字符串。"
            }
        ]
    }
};
const variables = {
    
    //----------------------------------------------
    "设置全局变量" : {
        "描述" : "将一个值存储为一个全局变量，全局变量即属于游戏本身的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定将值存储哪个全局变量。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此值将被存储。"
            }
        ]
    },
    
    "设置玩家变量" : {
        "描述" : "将一个值存储为一个玩家变量，玩家变量即属于一个特定玩家的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定将值存储为玩家的哪些变量。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此值将被存储。"
            }
        ]
    },
    
    "修改全局变量" : {
        "描述" : "修改一个全局变量的值，全局变量即属于游戏本身的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "要修改的全局变量。"
            },
            {
                "名称" : "操作",
                "类型" : "操作",
                "默认" : "添加至数组",
                "说明" : "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。"
            }
        ]
    },
    
    "修改玩家变量" : {
        "描述" : "修改一个玩家变量的值，玩家变量即属于一个特定玩家的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "此玩家的变量将被修改。如果有多个玩家，则每个玩家的变量都将被设置。"
            },
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定修改此玩家的哪些变量。"
            },
            {
                "名称" : "操作",
                "类型" : "操作",
                "默认" : "添加至数组",
                "说明" : "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。"
            }
        ]
    },
    
    "在索引处设置全局变量" : {
        "描述" : "为一个全局变量寻找或创建一个数组，然后将一个值储存至指定的索引中。全局变量即属于游戏本身的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定哪个全局变量的值是要修改的数组。如果变量的值不是一个数组，则使其值变为一个空的数组。"
            },
            {
                "名称" : "索引",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "将此值存储到数组中。"
            }
        ]
    },
    
    "在索引处设置玩家变量" : {
        "描述" : "为一个玩家变量寻找或创建一个数组，然后将一个值储存至指定的索引处。玩家变量即属于一个特定玩家的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "此玩家的变量将被修改。如果有多个玩家，则每个玩家的变量都将被设置。"
            },
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定哪个玩家变量的值是要修改的数组。如果变量的值不是一个数组，则使其值变为一个空的数组。"
            },
            {
                "名称" : "索引",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "将此值存储到数组中。"
            }
        ]
    },
    
    "在索引处修改全局变量" : {
        "描述" : "修改索引处一个全局变量的值，全局变量即属于游戏本身的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "要修改的全局变量。"
            },
            {
                "名称" : "索引",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。"
            },
            {
                "名称" : "操作",
                "类型" : "操作",
                "默认" : "添加至数组",
                "说明" : "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。"
            }
        ]
    },
    
    "在索引处修改玩家变量" : {
        "描述" : "修改索引处一个玩家变量的值，玩家变量即属于一个特定玩家的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "此玩家的变量将被修改。如果有多个玩家，则每个玩家的变量都将被设置。"
            },
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定修改此玩家的哪些变量。"
            },
            {
                "名称" : "索引",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "修改数组的索引。如果索引位置已经超过了数组的末尾，则将数组延伸至索引位置，且新的元素值均为0。"
            },
            {
                "名称" : "操作",
                "类型" : "操作",
                "默认" : "添加至数组",
                "说明" : "变量的值改变的方式。选项包括标准运算操作，以及数组操作（如添加或移除值）。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "用于修改的值。若要进行运算操作，则此值为两个运算量中的第二个，第一个运算量为变量当前的值。若要进行数组操作，则此值是用于添加或移除的值。"
            }
        ]
    },
    
    "持续追踪全局变量" : {
        "描述" : "逐渐改变一个全局变量的值，全局变量即属于游戏本身的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定要改变的全局变量。"
            },
            {
                "名称" : "最终值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "该全局变量最后达到的值。这个值的类型可以是数字或矢量，然而必须与追踪开始时全局变量所具有的值相同。"
            },
            {
                "名称" : "持续时间",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "变量到达最终值所用的时间，以秒为单位。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "追踪持续",
                "默认" : "终点及持续时间",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            }
        ]
    },
    
    "持续追踪玩家变量" : {
        "描述" : "逐步改变一个玩家变量的值，玩家变量即属于一个特定玩家的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "此玩家的变量将被逐渐改变。如果有多个玩家，则每个玩家的变量都将各自被改变。"
            },
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定将要改变的玩家变量。"
            },
            {
                "名称" : "最终值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "该玩家变量最后达到的值。这个值的类型可以是数字或矢量，然而必须与追踪开始时玩家变量所具有的值相同。"
            },
            {
                "名称" : "持续时间",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "变量到达最终值所用的时间，以秒为单位。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "追踪持续",
                "默认" : "终点及持续时间",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            }
        ]
    },
    
    "追踪全局变量频率" : {
        "描述" : "以指定的速率逐步改变一个全局变量的值，全局变量即属于游戏本身的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定要改变的全局变量。"
            },
            {
                "名称" : "最终值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "该全局变量最后达到的值。这个值的类型可以是数字或矢量，然而必须与追踪开始时全局变量所具有的值相同。"
            },
            {
                "名称" : "频率",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此变量的值每秒改变的量。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "追踪频率",
                "默认" : "速率及最终值",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            }
        ]
    },
    
    "追踪玩家变量频率" : {
        "描述" : "以指定的速率逐步改变一个玩家变量的值，玩家变量即属于一个特定玩家的变量。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "此玩家的变量将被逐渐改变。如果有多个玩家，则每个玩家的变量都将各自被改变。"
            },
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定将要改变的玩家变量。"
            },
            {
                "名称" : "最终值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "该玩家变量最后达到的值。这个值的类型可以是数字或矢量，然而必须与追踪开始时玩家变量所具有的值相同。"
            },
            {
                "名称" : "频率",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此变量的值每秒改变的量。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "追踪频率",
                "默认" : "速率及最终值",
                "说明" : "指定此动作的某个输入值将被持续重新赋值。此动作会要求输入新的数值，并用输入的数值进行重新赋值。"
            }
        ]
    },
    
    "停止追踪全局变量" : {
        "描述" : "停止追踪一个全局变量，并使其保持为当前值。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定要停止修改的全局变量。"
            }
        ]
    },
    
    "停止追踪玩家变量" : {
        "描述" : "停止追踪一个玩家变量，并使其保持为当前值。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "此玩家的变量将停止改变。如果有多个玩家，则每个玩家的变量都将停止改变。"
            },
            {
                "名称" : "变量",
                "类型" : "0000000",
                "默认" : "A",
                "说明" : "指定要停止修改的玩家变量。"
            }
        ]
    },
    
    "逐帧更新" : {
        "描述" : "结果为提供给“输入值”参数的值，并且会将此值的更新频率提高为每一帧更新一次。可以用来使特定值的出现更加平滑，例如“所选位置”等通常每几帧才会更新一次的值。可对条件和会重新赋值的动作参数使用。可能会增加服务器负载和/或降低帧率。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "所选位置(事件玩家)",
                "说明" : "此值的更新频率将从每几帧更新一次提高为每一帧更新一次。"
            }
        ]
    },
    
    "单次赋值" : {
        "描述" : "结果为通过给定动作或条件提供给“输入值”参数的第一个值（当一个可重新赋值的值与一个动作相关联时，此选项可以用来有选择性地对此值的特定部分不重新赋值）。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "输入值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此值在每个动作或条件中只赋值一次。"
            }
        ]
    },
    
};
const specialKeyword = {
    "设置" : {
        "设置全局变量" : "全局.A = 0",
        "设置玩家变量" : "事件玩家.A = 0",
        "在索引处设置全局变量" : "全局.A[0] = 0",
        "在索引处设置玩家变量" : "事件玩家.A[0] = 0"
    },
    "修改" : {
        "修改全局变量" : "全局.A += 0",
        "修改玩家变量" : "事件玩家.A += 0",
        "在索引处修改全局变量" : "全局.A[0] += 0",
        "在索引处修改玩家变量" : "事件玩家.A[0] += 0"
    }

};

const IDs = {
    //----------------------------------------------
    "上一个伤害调整ID" : {
        "描述" : "此ID值代表最后一个事件玩家（或全局）所执行的“开始伤害调整”动作。",
        "返回" : "伤害调整ID",
        "参数" : []
    },

    "上一个持续伤害效果ID" : {
        "描述" : "此ID值代表最后一个事件玩家（或全局）所执行的“持续伤害”动作。",
        "返回" : "持续伤害效果ID",
        "参数" : []
    },

    "上一个治疗调整ID" : {
        "描述" : "此ID值代表最后一个事件玩家（或全局）所执行的“开始治疗调整”动作。",
        "返回" : "治疗调整ID",
        "参数" : []
    },

    "上一个持续治疗效果ID" : {
        "描述" : "此ID值代表最后一个事件玩家（或全局）所执行的“持续治疗”动作。",
        "返回" : "持续治疗效果ID",
        "参数" : []
    },

    "上一个文本ID" : {
        "描述" : "代表由事件玩家创建的（或由全局创建的）通过“创建HUD文本”、“创建地图文本”、“创建进度条HUD文本”或“创建进度条地图文本”动作所创建的最后一段文本。",
        "返回" : "文本ID",
        "参数" : []
    },

    "上一个助攻ID" : {
        "描述" : "此ID值代表最后一个时间玩家（或全局）所执行的“开始助攻”动作。",
        "返回" : "助攻ID",
        "参数" : []
    },

    "最后创建的实体" : {
        "描述" : "对事件玩家创建的（或由全局创建的）最后一个效果，图标实体或机器人的引用。",
        "返回" : "实体ID",
        "参数" : []
    },

    "最后创建的生命池" : {
        "描述" : "此ID值代表最后一个事件玩家（或全局）所执行的“添加生命池”动作。",
        "返回" : "生命池ID",
        "参数" : []
    },






};
const boolean = {
    //----------------------------------------------
    "与" : {
        "描述" : "两个输入值是否都为“真”（或等效于“真”）。.",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "考察的两个输入值中的一个。如果两个值均为“真”（或等效于“真”），则“与”的值为“真”。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "考察的两个输入值中的一个。如果两个值均为“真”（或等效于“真”），则“与”的值为“真”。"
            }
        ]
    },

    "或" : {
        "描述" : "两个输入值中是否至少有一个为“真”（或等效于“真”）。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "考察的两个输入值中的一个。如果两个值中有一个为“真”（或等效于“真”），则“或”的值为“真”。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "考察的两个输入值中的一个。如果两个值中有一个为“真”（或等效于“真”），则“或”的值为“真”。"
            }
        ]
    },

    "非" : {
        "描述" : "返回输入的布尔的相反值。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "如果输入为“假”（或等效于“假”），则“非”值为“真”。否则，则“非”值为“假”。"
            }
        ]
    },

    "比较" : {
        "描述" : "比较输入的两个值的结果，如果相等则为“真”反之为“假”。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "比较式的左边。如果操作为“==”或“!=”，则可以为任意类型的值。否则此值应为实数。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "比较式的右边。如果操作为“==”或“!=”，则可以为任意类型的值。否则此值应为实数。"
            }
        ]
    },

    "处于非初始状态" : {
        "描述" : "指定玩家当前是否处于非初始状态（如D.Va离开机甲、卢西奥使用加速音乐、堡垒处于转换形态期间、天使和托比昂使用辅助攻击武器，等等。）如果要检测回声是否正在使用人格复制，请使用“正在人格复制”的值。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的状态。"
            }
        ]
    },

    "在视线内" : {
        "描述" : "两个位置是否在彼此的视线内。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "开始位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "用于进行视线检测的起点位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            {
                "名称" : "结束位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "用于进行视线检测的终点位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            {
                "名称" : "屏障",
                "类型" : "屏障",
                "默认" : "屏障不会阻挡视线",
                "说明" : "定义屏障是否影响视线判断。如果要考察屏障是否属于敌方，则以游戏开始时玩家所在的队伍（如果有的话）为准。"
            }
        ]
    },

    "在视野内" : {
        "描述" : "检测一个坐标是否位于玩家的视角内。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此名玩家的视野。"
            },
            {
                "名称" : "坐标",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "检测此坐标是否在视角内。"
            },
            {
                "名称" : "视角",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "用于比较的视角，单位为度。"
            }
        ]
    },

    "事件暴击" : {
        "描述" : "此规则处理的伤害是否为暴击（如爆头伤害）。",
        "返回" : "布尔",
        "参数" : []
    },

    "事件为急救包" : {
        "描述" : "此规则正在处理的事件中的治疗是否来自于急救包。",
        "返回" : "布尔",
        "参数" : []
    },

    "事件为环境事件" : {
        "描述" : "此规则正在处理的事件中的消灭是否是由环境引起的。",
        "返回" : "布尔",
        "参数" : []
    },

    "正在近战攻击" : {
        "描述" : "指定玩家是否在近战攻击。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的近战攻击状态。"
            }
        ]
    },

    "正在跳跃" : {
        "描述" : "指定玩家是否在跳跃。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的跳跃状态。"
            }
        ]
    },

    "正在装填" : {
        "描述" : "指定玩家是否在装填。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的装填状态。"
            }
        ]
    },

    "正在人格复制" : {
        "描述" : "指定玩家是否正在复制另一名英雄。（为了检测复制的英雄，可使用“正在复制的英雄”的值。）",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的人格复制状态。"
            }
        ]
    },

    "正在交流" : {
        "描述" : "玩家是否在使用指定的交流类型（如表情、播放语音、喷漆等）。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "考察的交流类型。表情的持续时间为准确值，语音的播放时间视为4秒，其他所有交流类型的持续时间视为2秒。"
            }
        ]
    },

    "正在与人交流" : {
        "描述" : "玩家是否在使用任意的交流类型（如表情、播放语音、喷漆等）。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的交流状态。"
            }
        ]
    },

    "正在使用喷漆交流" : {
        "描述" : "玩家是否在使用喷漆。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的喷漆状态。"
            }
        ]
    },

    "正在使用主要武器" : {
        "描述" : "指定玩家是否在使用主要武器攻击。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的主要武器攻击状态。"
            }
        ]
    },

    "正在使用辅助武器" : {
        "描述" : "指定玩家是否在使用辅助武器攻击。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的辅助武器攻击状态。"
            }
        ]
    },

    "正在使用技能 1" : {
        "描述" : "指定玩家是否在使用技能 1。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的技能1状态。"
            }
        ]
    },

    "正在使用技能 2" : {
        "描述" : "指定玩家是否在使用技能 2。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的技能2状态。"
            }
        ]
    },

    "正在使用终极技能" : {
        "描述" : "玩家是否在使用终极技能。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的终极技能状态。"
            }
        ]
    },

    "正在使用表情交流" : {
        "描述" : "玩家是否在使用表情。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家是否在使用表情。"
            }
        ]
    },

    "正在使用语音交流" : {
        "描述" : "玩家是否在播放语音（语音的长度统一视为4秒）。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家是否在播放语音。"
            }
        ]
    },

    "正在移动" : {
        "描述" : "玩家是否在移动（当前速度不为零）。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的运动状态。"
            }
        ]
    },

    "正在空中" : {
        "描述" : "玩家是否在空中。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的浮空状态。"
            }
        ]
    },

    "正在站立" : {
        "描述" : "玩家是否在站立（既不在移动也不在空中）。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的站立状态。"
            }
        ]
    },

    "正在蹲下" : {
        "描述" : "玩家是否在下蹲。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家是否正在下蹲。"
            }
        ]
    },

    "存活" : {
        "描述" : "玩家是否存活。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的生命状态。"
            }
        ]
    },

    "死亡" : {
        "描述" : "玩家是否死亡。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的死亡状态。"
            }
        ]
    },

    "是否是机器人" : {
        "描述" : "玩家是否是机器人。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "考察此玩家。"
            }
        ]
    },

    "在目标点上" : {
        "描述" : "指定玩家是否正在运载目标或占领点上。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的目标点状态。"
            }
        ]
    },

    "具有状态" : {
        "描述" : "指定玩家是否具有指定状态，无论此状态是通过“设置状态”行为获得的还是除命令以外的游戏机制获得的。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的状态。"
            },
            {
                "名称" : "状态",
                "类型" : "状态",
                "默认" : "被入侵",
                "说明" : "要检测的状态。"
            }
        ]
    },

    "正在等待玩家" : {
        "描述" : "此比赛是否正在等待玩家加入。",
        "返回" : "布尔",
        "参数" : []
    },

    "正在设置" : {
        "描述" : "此比赛是否正在准备阶段。",
        "返回" : "布尔",
        "参数" : []
    },

    "正在集结英雄" : {
        "描述" : "此比赛是否正在集结英雄阶段。",
        "返回" : "布尔",
        "参数" : []
    },

    "游戏正在进行中" : {
        "描述" : "此比赛是否正在主要阶段（可以进行战斗并获得分数的阶段）。",
        "返回" : "布尔",
        "参数" : []
    },
 
    "正在使用英雄" : {
        "描述" : "指定英雄是否正在使用（可以限定在队伍中或游戏中）。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "英雄",
                "类型" : "0000000",
                "默认" : "英雄(安娜)",
                "说明" : "检测此英雄是否在使用。"
            },
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "检测队伍中是否正在使用这名英雄。"
            }
        ]
    },

    "比赛结束" : {
        "描述" : "此比赛是否已经结束。",
        "返回" : "布尔",
        "参数" : []
    },

    "地图工坊设置开关" : {
        "描述" : "提供一个新的开关设置的值（真或假），会显示在“地图工坊设置”卡片上作为勾选项。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "类别",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "此类别的名字，可以用来找到此设置。"
            },
            {
                "名称" : "名称",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "此设置的名称。"
            },
            {
                "名称" : "默认",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "此项设置的默认值。"
            },
            {
                "名称" : "排序",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。"
            }
        ]
    },

    "旗帜是否在基地中" : {
        "描述" : "在勇夺锦旗模式下，指定队伍的旗帜是否在其基地内。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "检测此队伍的旗帜。"
            }
        ]
    },

    "是否有人携带旗帜" : {
        "描述" : "在勇夺锦旗模式下，指定队伍的旗帜是否在其基地内。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "检测此队伍的旗帜。"
            }
        ]
    },

    "在夺旗模式中开始绝杀局" : {
        "描述" : "当前勇夺锦旗游戏是否处于绝杀局状态。",
        "返回" : "布尔",
        "参数" : []
    },

    "实体存在" : {
        "描述" : "指定玩家、图标实体或效果实体是否存在。可以用来查看一个玩家是否已经离开比赛，或一个实体是否已被消除。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "实体",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检查是否存在此玩家、图标实体或效果实体。"
            }
        ]
    },

    "占领要点模式占领点解锁" : {
        "描述" : "占领要点模式中占领点是否解锁。",
        "返回" : "布尔",
        "参数" : []
    },

    "目标是否完成" : {
        "描述" : "指定目标是否已经完成。如果游戏模式不是攻防作战、护送、或攻击/护送，则结果为“假”。在攻防作战、攻击/护送及占领要点模式中生效。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "数字",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "考察的目标点的索引，从0开始逐渐累加。每个控制点、运载目标检查点、运载目标目的地都有其独自的索引。"
            }
        ]
    },

    "已重生" : {
        "描述" : "一个实体是否存在于地图中。如果玩家尚未选择英雄，则返回结果为“假“。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "实体",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家、图标实体或效果实体是否存在于地图中。"
            }
        ]
    },

    "处于回合之间" : {
        "描述" : "此比赛是否正在两个回合之间。",
        "返回" : "布尔",
        "参数" : []
    },

    "作为进攻队伍" : {
        "描述" : "指定队伍是否是进攻方。如果游戏模式不是攻防作战、护送、或攻击/护送，则结果为“假”。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "检查此队伍的职责。"
            }
        ]
    },

    "正在防守" : {
        "描述" : "指定队伍是否是防守方。如果游戏模式不是攻防作战、护送、或攻击/护送，则结果为“假”。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "检查此队伍的职责。"
            }
        ]
    },

    "对任意为“真”" : {
        "描述" : "指定数组中是否有元素对指定的条件为“真”。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "考察此数组中的值。"
            },
            {
                "名称" : "条件",
                "类型" : "0000000",
                "默认" : "0 == 0",
                "说明" : "对指定的数组中每个元素判断此条件。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。"
            }
        ]
    },

    "对全部为“真”" : {
        "描述" : "指定数组中所有元素是否都对指定的条件为“真”。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "考察此数组中的值。"
            },
            {
                "名称" : "条件",
                "类型" : "0000000",
                "默认" : "0 == 0",
                "说明" : "对指定的数组中每个元素判断此条件。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。"
            }
        ]
    },

    "在地面上" : {
        "描述" : "玩家是否位于地面上（或可行走的表面上）。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家是否处于地面上。"
            }
        ]
    },

    "在墙上" : {
        "描述" : "玩家是否位于墙体上（滑墙或爬墙）。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的滑墙状态。"
            }
        ]
    },

    "在重生室中" : {
        "描述" : "指定玩家是否正在重生室内（恢复生命值且可更换英雄）。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的重生室状态。"
            }
        ]
    },

    "头像火力全开" : {
        "描述" : "指定玩家的头像是否处于火力全开状态。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的头像状态。"
            }
        ]
    },

    "按钮被按下" : {
        "描述" : "玩家是否正在按下特定按钮。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的按钮。"
            },
            {
                "名称" : "按钮",
                "类型" : "0000000",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "用于检测的按钮。"
            }
        ]
    }

};
const numbers = {
    //----------------------------------------------
    "数字" : {
        "描述" : "一个实数常量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "数字",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "一个实数常量。"
            }
        ]
    },

    "数量" : {
        "描述" : "指定数组的元素个数。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "计算此数组的元素个数。"
            }
        ]
    },

    "类型的生命值" : {
        "描述" : "玩家此类型的生命值（生命，护甲，或护盾）。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的生命值。"
            },
            {
                "名称" : "生命值",
                "类型" : "生命类型",
                "默认" : "生命值",
                "说明" : "获取此类型的生命值。"
            }
        ]
    },

    "类型的最大生命值" : {
        "描述" : "玩家此类型的最大生命值（生命，护甲，或护盾）。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的最大生命值。"
            },
            {
                "名称" : "生命值",
                "类型" : "生命类型",
                "默认" : "生命值",
                "说明" : "获取此类型的最大生命值。"
            }
        ]
    },

    "玩家英雄数据" : {
        "描述" : "提供指定玩家使用指定英雄的数据（仅限当前比赛）。仅在游戏进行时收集数据。机器人不会收集数据。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的数据。"
            },
            {
                "名称" : "英雄",
                "类型" : "0000000",
                "默认" : "英雄(安娜)",
                "说明" : "获取此英雄的数据。"
            },
            {
                "名称" : "数据",
                "类型" : "英雄数据",
                "默认" : "所有造成伤害量",
                "说明" : "获取数据。"
            }
        ]
    },

    "玩家数据" : {
        "描述" : "提供指定玩家的数据（仅限当前比赛）。仅在游戏进行时收集数据。机器人不会收集数据。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的数据。"
            },
            {
                "名称" : "数据",
                "类型" : "玩家数据",
                "默认" : "所有造成伤害量",
                "说明" : "获取数据。"
            }
        ]
    },

    "治疗调整数量" : {
        "描述" : "由“开始治疗调整”动作启动的治疗调整副本的当前数量。",
        "返回" : "数字",
        "参数" : []
    },

    "伤害调整数量" : {
        "描述" : "由“开始伤害调整”动作启动的伤害调整副本的当前数量。",
        "返回" : "数字",
        "参数" : []
    },

    "持续伤害数量" : {
        "描述" : "由“持续伤害”动作启动的持续伤害副本的当前数量。",
        "返回" : "数字",
        "参数" : []
    },

    "持续治疗数量" : {
        "描述" : "由“持续治疗”动作启动的持续治疗副本的当前数量。",
        "返回" : "数字",
        "参数" : []
    },

    "事件伤害" : {
        "描述" : "此规则所处理的事件中被攻击者受到的伤害数值。",
        "返回" : "数字",
        "参数" : []
    },

    "事件治疗" : {
        "描述" : "此规则所处理的事件中被治疗者受到的治疗数值。",
        "返回" : "数字",
        "参数" : []
    },

    "相距距离" : {
        "描述" : "两个位置之间的距离，单位为米。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "开始位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "用于测量距离的两个位置之一。"
            },
            {
                "名称" : "结束位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "用于测量距离的两个位置之一。"
            }
        ]
    },

    "较大" : {
        "描述" : "两个数字中较大的一个。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "左边的运算量，可以是结果为数字的值。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "右边的运算量，可以是结果为数字的值。"
            }
        ]
    },

    "较小" : {
        "描述" : "两个数字中较小的一个。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "左边的运算量，可以是结果为数字的值。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "右边的运算量，可以是结果为数字的值。"
            }
        ]
    },

    "绝对值" : {
        "描述" : "指定值的绝对值。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "计算此实数值的绝对值。"
            }
        ]
    },

    "随机实数" : {
        "描述" : "指定最小值与最大值之间的一个随机实数。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "最小",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "允许的最小实数。"
            },
            {
                "名称" : "最大",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "允许的最大实数。"
            }
        ]
    },

    "随机整数" : {
        "描述" : "指定最小值与最大值之间的一个随机整数（包括最小值与最大值在内）。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "最小",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "允许的最小整数。如果此处输入的是一个实数，则取最接近此实数的整数。"
            },
            {
                "名称" : "最大",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "允许的最大整数。如果此处输入的是一个实数，则取最接近此实数的整数。"
            }
        ]
    },

    "平方根" : {
        "描述" : "指定值的平方根。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "计算此实数值的平方根。负数值则为0。"
            }
        ]
    },

    "取整" : {
        "描述" : "指定值取整后的值。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "要取整的实数。"
            },
            {
                "名称" : "取整方式",
                "类型" : "取整",
                "默认" : "上",
                "说明" : "决定此值取整的方式。"
            }
        ]
    },

    "技能资源" : {
        "描述" : "一名玩家指定按键对应技能的资源百分比。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的技能状态。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "检测此按键对应的技能状态。"
            }
        ]
    },

    "技能冷却时间" : {
        "描述" : "一名玩家指定按键对应技能的冷却时间，以秒为单位。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的技能状态。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "检测此按键对应的技能状态。"
            }
        ]
    },

    "技能充能" : {
        "描述" : "一名玩家指定按键对应技能的充能次数。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "检测此玩家的技能状态。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "检测此按键对应的技能状态。"
            }
        ]
    },

    "武器" : {
        "描述" : "一名玩家当前的武器。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的武器。"
            }
        ]
    },

    "弹药" : {
        "描述" : "一名玩家当前的弹药数量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的弹药数量。"
            },
            {
                "名称" : "弹夹",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "获取弹夹的索引。0为第一个弹夹，1为第二个。若指定类型不存在，则返还0。"
            }
        ]
    },

    "助攻数量" : {
        "描述" : "由“开始助攻”动作启动的助攻副本的当前数量。",
        "返回" : "数字",
        "参数" : []
    },

    "死亡数" : {
        "描述" : "指定玩家死亡的次数。这个值会随着游戏的进程不断累积。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的死亡次数。"
            }
        ]
    },

    "消灭数" : {
        "描述" : "指定玩家参与消灭的次数。这个值会随着游戏的进程不断累积。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的消灭次数。"
            }
        ]
    },

    "最后一击数" : {
        "描述" : "指定玩家造成最后一击的次数。这个值会随着游戏的进程不断累积。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的最后一击次数。"
            }
        ]
    },

    "标准化生命值" : {
        "描述" : "玩家当前的生命值，包括护甲和护盾，在0到1之间取标准化值。（例如，0为无生命值，0.5为半生命值，1为满生命值，以此类推。）",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的标准化生命值。"
            }
        ]
    },

    "最大生命值" : {
        "描述" : "一名玩家的最大生命值，包括护甲和护盾。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的最大生命值。"
            }
        ]
    },

    "最大弹药量" : {
        "描述" : "一名玩家当前的最大弹药数量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的最大弹药数量。"
            },
            {
                "名称" : "弹夹",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "获取弹夹的索引。0为第一个弹夹，1为第二个。若指定类型不存在，则返还0。"
            }
        ]
    },

    "速度" : {
        "描述" : "一名玩家的当前速度，单位为米/秒。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的速度。"
            }
        ]
    },

    "垂直速度" : {
        "描述" : "一名玩家在水平方向上的当前速度，单位为米/秒。排除所有垂直方向的运动，包括沿斜坡方向的运动。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的垂直速度。"
            }
        ]
    },

    "水平速度" : {
        "描述" : "一名玩家在水平方向上的当前速度，单位为米/秒。排除所有垂直方向的运动。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的水平速度。"
            }
        ]
    },

    "指定方向速度" : {
        "描述" : "一名玩家在指定方向上的当前速度，单位为米/秒。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的速度。"
            },
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "行动的方向，用于测量玩家速度。"
            }
        ]
    },

    "高度" : {
        "描述" : "玩家当前距离表面的高度，以米为单位。如果玩家正在表面上则结果为0。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的高度。"
            }
        ]
    },

    "栏位" : {
        "描述" : "指定玩家的栏位编号。在队伍模式中，每个队伍中玩家的栏位编号为0到5的数字；在自由混战模式中，栏位编号为0到11。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的栏位编号。"
            }
        ]
    },

    "栏位数量" : {
        "描述" : "队伍或比赛中的栏位数量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "计算下列队伍中栏位的数量。"
            }
        ]
    },

    "分数" : {
        "描述" : "一名玩家当前的得分。如果游戏不是自由混战模式，则结果为0。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的分数。"
            }
        ]
    },

    "终极技能充能百分比" : {
        "描述" : "一名玩家当前终极技能的充能百分比。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家当前终极技能的充能百分比。"
            }
        ]
    },

    "消灭数" : {
        "描述" : "指定玩家参与消灭的次数。这个值会随着游戏的进程不断累积。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的消灭次数。"
            }
        ]
    },

    "消灭数" : {
        "描述" : "指定玩家参与消灭的次数。这个值会随着游戏的进程不断累积。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的消灭次数。"
            }
        ]
    },

    "服务器负载" : {
        "描述" : "当前游戏副本造成的CPU负载百分比。如果这个数字接近或者超过100，表示此游戏副本消耗了过多资源，游戏很可能会关闭。",
        "返回" : "数字",
        "参数" : []
    },

    "服务器负载平均值" : {
        "描述" : "当前游戏副本在过去2秒内造成的平均CPU负载百分比。如果这个数字接近或者超过100，表示此游戏副本消耗了过多资源，游戏很可能会关闭。",
        "返回" : "数字",
        "参数" : []
    },

    "服务器负载峰值" : {
        "描述" : "当前游戏副本在过去2秒内造成的最高CPU负载百分比。如果这个数字接近或者超过100，表示此游戏副本消耗了过多资源，游戏很可能会关闭。",
        "返回" : "数字",
        "参数" : []
    },

    "地图工坊设置组合" : {
        "描述" : "提供一个新的选项设置值（用于选择自定义字符串），会显示在“地图工坊设置”卡片上作为组合框。此值会返回所选内容的索引。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "类别",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "此类别的名字，可以用来找到此设置。"
            },
            {
                "名称" : "名称",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "此设置的名称。"
            },
            {
                "名称" : "默认",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此项设置的默认值。"
            },
            {
                "名称" : "选项",
                "类型" : "0000000",
                "默认" : "数组(无)",
                "说明" : "此设置的选项。"
            },
            {
                "名称" : "排序",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。"
            }
        ]
    },

    "地图工坊设置实数" : {
        "描述" : "提供一个新的实数型设置值，会显示在“地图工坊设置”卡片上作为滑块。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "类别",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "此类别的名字，可以用来找到此设置。"
            },
            {
                "名称" : "名称",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "此设置的名称。"
            },
            {
                "名称" : "默认",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此项设置的默认值。"
            },
            {
                "名称" : "最小",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此设置所允许的最小值"
            },
            {
                "名称" : "最大",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此设置所允许的最大值"
            },
            {
                "名称" : "排序",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。"
            }
        ]
    },

    "地图工坊设置整数" : {
        "描述" : "提供一个新的整数型设置值，会显示在“地图工坊设置”卡片上作为滑块。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "类别",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "此类别的名字，可以用来找到此设置。"
            },
            {
                "名称" : "名称",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "此设置的名称。"
            },
            {
                "名称" : "默认",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此项设置的默认值。"
            },
            {
                "名称" : "最小",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此设置所允许的最小值"
            },
            {
                "名称" : "最大",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此设置所允许的最大值"
            },
            {
                "名称" : "排序",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。"
            }
        ]
    },

    "比赛回合" : {
        "描述" : "比赛当前的回合数，从1开始计数。",
        "返回" : "数字",
        "参数" : []
    },

    "比赛时间" : {
        "描述" : "当前游戏模式阶段剩余的时间，以秒为单位。",
        "返回" : "数字",
        "参数" : []
    },

    "总计消耗时间" : {
        "描述" : "该游戏副本创建后已经过去的总时间（包括准备时间和攻防转换时间），以秒为单位。",
        "返回" : "数字",
        "参数" : []
    },

    "玩家数量" : {
        "描述" : "队伍或比赛中的玩家数量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "计算下列队伍中玩家的数量。"
            }
        ]
    },

    "英雄数量" : {
        "描述" : "在一支队伍或此比赛中使用指定英雄的数量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "英雄",
                "类型" : "0000000",
                "默认" : "英雄(安娜)",
                "说明" : "检测此英雄是否在使用。"
            },
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "检测队伍中是否正在使用这名英雄。"
            }
        ]
    },

    "存活玩家数量" : {
        "描述" : "队伍或比赛中存活的玩家数量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "计算下列队伍中玩家的数量。"
            }
        ]
    },

    "死亡玩家数量" : {
        "描述" : "队伍或比赛中死亡的玩家数量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "计算下列队伍中玩家的数量。"
            }
        ]
    },

    "实体数量" : {
        "描述" : "由“创建效果”、“创建光束效果”或“创建图标”动作创建的实体的当前数量。",
        "返回" : "数字",
        "参数" : []
    },

    "占领要点模式得分百分比" : {
        "描述" : "指定队伍在占领要点模式中的得分百分比。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "获取此队伍的得分百分比。"
            }
        ]
    },

    "运载目标进度百分比" : {
        "描述" : "已激活的运载目标前往目标地的当前进度（以百分比表示）。",
        "返回" : "数字",
        "参数" : []
    },

    "目标点上玩家数量" : {
        "描述" : "在运载目标或控制点上的玩家数量（可以是一支队伍中的，也可以是整个比赛中的）。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "计算下列队伍中玩家的数量。"
            }
        ]
    },

    "目标点占领百分比" : {
        "描述" : "已激活的控制点当前的占领进度（以百分比表示）。",
        "返回" : "数字",
        "参数" : []
    },

    "对象索引" : {
        "描述" : "当前激活的控制点、运载目标检查点或运载目标目的地（0，1或2）。在攻防作战、攻击/护送及占领要点模式中生效。",
        "返回" : "数字",
        "参数" : []
    },

    "团队得分" : {
        "描述" : "指定队伍当前的得分。在自由混战模式中结果为0。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "获取此队伍的得分。"
            }
        ]
    }
};
const others = {
    //----------------------------------------------
    "全局" : {
        "描述" : "",
        "返回" : "无",
        "参数" : []
    },

    "按钮" : {
        "描述" : "一个按钮常量。",
        "返回" : "按钮",
        "参数" : [
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "主要攻击模式",
                "说明" : "一个按钮常量。"
            }
        ]
    },

    "事件技能" : {
        "描述" : "此规则当前处理的事件中的技能所对应的按键。",
        "返回" : "技能",
        "参数" : []
    },

    "英雄" : {
        "描述" : "一个英雄常量。",
        "返回" : "英雄",
        "参数" : [
            {
                "名称" : "英雄",
                "类型" : "英雄",
                "默认" : "安娜",
                "说明" : "一个英雄常量。"
            }
        ]
    },

    "所用英雄" : {
        "描述" : "一名玩家当前的英雄。",
        "返回" : "英雄",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的英雄。"
            }
        ]
    },

    "正在复制的英雄" : {
        "描述" : "指定玩家正在复制此英雄。如果没有复制英雄，结果值为0。",
        "返回" : "英雄",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "正在施展人格复制的玩家。"
            }
        ]
    },

    "可用英雄" : {
        "描述" : "此数组中包括指定玩家当前可以选择的英雄。",
        "返回" : "英雄数组",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家可用的英雄。"
            }
        ]
    },

    "全部英雄" : {
        "描述" : "此数组包括了《守望先锋》中所有英雄。",
        "返回" : "英雄数组",
        "参数" : []
    },

    "所有重装英雄" : {
        "描述" : "此数组包括了《守望先锋》中所有重装英雄。",
        "返回" : "英雄数组",
        "参数" : []
    },

    "所有支援英雄" : {
        "描述" : "此数组包括了《守望先锋》中所有支援英雄。",
        "返回" : "英雄数组",
        "参数" : []
    },

    "所有支援英雄" : {
        "描述" : "此数组包括了《守望先锋》中所有输出英雄。",
        "返回" : "英雄数组",
        "参数" : []
    },

    "队伍" : {
        "描述" : "一个队伍常数。“全部”选项代表队伍模式中的两支队伍，或自由混战模式中的全部玩家。",
        "返回" : "队伍",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "一个队伍常数。“全部”选项代表队伍模式中的两支队伍，或自由混战模式中的全部玩家。"
            }
        ]
    },

    "所在队伍" : {
        "描述" : "一支玩家所在的队伍。如果在自由混战模式中，则“队伍”视为“全部”。",
        "返回" : "队伍",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的队伍。"
            }
        ]
    },

    "对方队伍" : {
        "描述" : "指定队伍的对方队伍。",
        "返回" : "队伍",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "获得此队伍的对方队伍。如果选择“全部”，结果亦为“全部”。"
            }
        ]
    },

    "地图工坊设置英雄" : {
        "描述" : "提供一个新的英雄设置值，会显示在“地图工坊设置”卡片上作为组合框。",
        "返回" : "英雄",
        "参数" : [
            {
                "名称" : "类别",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "此类别的名字，可以用来找到此设置。"
            },
            {
                "名称" : "名称",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "此设置的名称。"
            },
            {
                "名称" : "默认",
                "类型" : "英雄",
                "默认" : "安娜",
                "说明" : "此项设置的默认值。"
            },
            {
                "名称" : "排序",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此设置与其他同类别设置的排序关系。排序较高的设置会在排序较低的设置之后显示。"
            }
        ]
    },

    "游戏模式" : {
        "描述" : "游戏模式常量。",
        "返回" : "游戏模式",
        "参数" : [
            {
                "名称" : "游戏模式",
                "类型" : "游戏模式",
                "默认" : "攻防作战",
                "说明" : "游戏模式常量。"
            }
        ]
    },

    "当前游戏模式" : {
        "描述" : "当前自定游戏的游戏模式。",
        "返回" : "游戏模式",
        "参数" : []
    },

    "地图" : {
        "描述" : "一个地图常量",
        "返回" : "地图",
        "参数" : [
            {
                "名称" : "地图",
                "类型" : "地图",
                "默认" : "66号公路",
                "说明" : "一个地图常量。"
            }
        ]
    },

    "当前地图" : {
        "描述" : "自定义游戏中当前使用的地图。",
        "返回" : "地图",
        "参数" : []
    },

    "占领要点模式正在得分的队伍" : {
        "描述" : "该队伍正在占领要点模式中积累得分百分比。如果双方队伍都没有在积累得分，则结果为“全部”。",
        "返回" : "队伍",
        "参数" : []
    }
};
const players = {

    "事件玩家" : {
        "描述" : "正在执行此规则的玩家，由事件指定。可能与攻击者或被攻击者为同一人。",
        "返回" : "玩家",
        "参数" : []
    },

    "主机玩家" : {
        "描述" : "当前自定游戏的主机玩家。如果当前的主机玩家离开了比赛，该值会改变。",
        "返回" : "玩家",
        "参数" : []
    },

    "本地玩家" : {
        "描述" : "由终端用户的电脑所操控的玩家。此值对每位终端用户均不相同，所以只有会影响视觉效果或HUD的动作才可访问此值。此值无法储存在变量中。",
        "返回" : "玩家",
        "参数" : []
    },

    "攻击方" : {
        "描述" : "根据此规则处理的事件中造成伤害的玩家。可能与被攻击者或事件玩家是同一个人。",
        "返回" : "玩家",
        "参数" : []
    },

    "被攻击方" : {
        "描述" : "根据此规则处理的事件中受到伤害的玩家。可能与攻击者或事件玩家是同一个人。",
        "返回" : "玩家",
        "参数" : []
    },

    "治疗者" : {
        "描述" : "根据此规则处理的事件中造成治疗的玩家。可能与被治疗者或事件玩家是同一个人。",
        "返回" : "玩家",
        "参数" : []
    },

    "受治疗者" : {
        "描述" : "根据此规则处理的事件中受到治疗的玩家。可能与治疗者或事件玩家是同一个人。",
        "返回" : "玩家",
        "参数" : []
    },

    "射线命中玩家" : {
        "描述" : "射线命中的玩家（如果没有命中则为空）。",
        "返回" : "玩家",
        "参数" : []
    },

    "视角中的玩家" : {
        "描述" : "最接近此玩家准星位置的玩家，可以选择是否限制所在队伍。",
        "返回" : "玩家",
        "参数" : []
    },

    "距离准星最近的玩家" : {
        "描述" : "最接近指定玩家准星位置的玩家，可以选择是否限制所在队伍。",
        "返回" : "玩家",
        "参数" : []
    },

    "范围内玩家" : {
        "描述" : "一个列表，其中包含距离指定位置小于一定距离的玩家，可设置是否受到队伍及视线的限制。",
        "返回" : "玩家数组",
        "参数" : [
            {
                "名称" : "中间",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "以此位置为中心测定距离。"
            },
            {
                "名称" : "半径",
                "类型" : "0000000",
                "默认" : "5",
                "说明" : "玩家需在此距离范围内（单位：米）才会出现在结果列表中。"
            },
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "所选队伍的玩家会出现在结果列表中。"
            },
            {
                "名称" : "视线检测",
                "类型" : "视线检测",
                "默认" : "关闭",
                "说明" : "只有通过视线检测的玩家才会出现在结果列表中。"
            }
        ]
    },

    "此栏位的玩家" : {
        "描述" : "游戏的指定栏位编号处的玩家或玩家数组。",
        "返回" : "玩家|玩家数组",
        "参数" : [
            {
                "名称" : "栏位",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "获取指定栏位编号的玩家。在队伍模式中，每个队伍中玩家的栏位编号为0到5的数字；在自由混战模式中，栏位编号为0到11。"
            },
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "从这些队伍中选择玩家。"
            }
        ]
    },

    "选择英雄的玩家" : {
        "描述" : "此数列中是一支队伍或本场比赛中正在使用指定英雄的玩家。",
        "返回" : "玩家数组",
        "参数" : [
            {
                "名称" : "英雄",
                "类型" : "0000000",
                "默认" : "英雄(安娜)",
                "说明" : "检测此英雄是否在使用。"
            },
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "检测队伍中是否正在使用这名英雄。"
            }
        ]
    },

    "所有玩家" : {
        "描述" : "此数组中包括一支队伍或整个比赛中所有的玩家。",
        "返回" : "玩家数组",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "玩家所在的队伍。"
            }
        ]
    },

    "所有存活玩家" : {
        "描述" : "此数组中包括一支队伍或整个比赛中所有存活的玩家。",
        "返回" : "玩家数组",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "玩家所在的队伍。"
            }
        ]
    },

    "所有死亡玩家" : {
        "描述" : "此数组中包括一支队伍或整个比赛中所有已死亡的玩家。",
        "返回" : "玩家数组",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "玩家所在的队伍。"
            }
        ]
    },

    "所有目标点内玩家" : {
        "描述" : "此数组中包括所有在运载目标或控制点上的玩家（可以是一支队伍中的，也可以是整个比赛中的）。",
        "返回" : "玩家数组",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "玩家所在的队伍。"
            }
        ]
    },

    "所有目标点外玩家" : {
        "描述" : "此数组中包括所有不在运载目标或控制点上的玩家（可以是一支队伍中的，也可以是整个比赛中的）。",
        "返回" : "玩家数组",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "玩家所在的队伍。"
            }
        ]
    },

    "携带旗帜的玩家" : {
        "描述" : "在勇夺锦旗模式中正在携带指定队伍旗帜的玩家。如果没有玩家正在携带旗帜，则返回值为空。",
        "返回" : "玩家",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "检测此队伍的旗帜。"
            }
        ]
    },

    "距离最近的玩家" : {
        "描述" : "距离一个位置最近的玩家，可以选择是否限制所在队伍。",
        "返回" : "玩家",
        "参数" : [
            {
                "名称" : "中心点",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "以此位置为起点测量距离。"
            },
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "最近一名玩家所在的队伍。"
            }
        ]
    },

    "距离最远的玩家" : {
        "描述" : "距离一个位置最远的玩家，可以选择是否限制所在队伍。",
        "返回" : "玩家",
        "参数" : [
            {
                "名称" : "中心点",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "以此位置为起点测量距离。"
            },
            {
                "名称" : "队伍",
                "类型" : "队伍",
                "默认" : "所有队伍",
                "说明" : "最近一名玩家所在的队伍。"
            }
        ]
    }
};
const vectors = {
    "速率" : {
        "描述" : "玩家当前的速率，此值为一个矢量。如果玩家位于表面上，则矢量在Y方向上的分量为0，即使在上坡或下坡。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的速率。"
            }
        ]
    },

    "幅值" : {
        "描述" : "指定值的幅值。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "矢量",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "求幅值操作的矢量操作数。"
            }
        ]
    },

    "矢量" : {
        "描述" : "矢量在三个方向上的实数值（X、Y、Z），X为左，Y为上，Z为前。矢量用来表示位置、方向和速度。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "X",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "矢量的X轴值。"
            },
            {
                "名称" : "Y",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "矢量的Y轴值。"
            },
            {
                "名称" : "Z",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "矢量的Z轴值。"
            }
        ]
    },

    "X方向分量" : {
        "描述" : "指定矢量在X方向上的分量，通常代表向左的量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "要获取X方向分量的矢量。"
            }
        ]
    },

    "Y方向分量" : {
        "描述" : "指定矢量在Y方向上的分量，通常代表向左的量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "要获取Y方向分量的矢量。"
            }
        ]
    },

    "Z方向分量" : {
        "描述" : "指定矢量在Z方向上的分量，通常代表向左的量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "要获取Z方向分量的矢量。"
            }
        ]
    },

    "上" : {
        "描述" : "方向性矢量 (0,1,0) 的简写，此矢量指向上方。",
        "返回" : "矢量",
        "参数" : []
    },

    "下" : {
        "描述" : "方向性矢量 (0,-1,0) 的简写，此矢量指向下方。",
        "返回" : "矢量",
        "参数" : []
    },

    "左" : {
        "描述" : "方向性矢量 (1,0,0) 的简写，此矢量指向左方。",
        "返回" : "矢量",
        "参数" : []
    },

    "右" : {
        "描述" : "方向性矢量 (-1,0,0) 的简写，此矢量指向右方。",
        "返回" : "矢量",
        "参数" : []
    },

    "前" : {
        "描述" : "方向性矢量 (0,0,1) 的简写，此矢量指向前方。",
        "返回" : "矢量",
        "参数" : []
    },

    "后" : {
        "描述" : "方向性矢量 (0,0,-1) 的简写，此矢量指向后方。",
        "返回" : "矢量",
        "参数" : []
    },


    "方向" : {
        "描述" : "从一个位置到另一个位置的单位长度矢量。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "开始位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "用于获取方向矢量的起点位置。"
            },
            {
                "名称" : "结束位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "用于获取方向矢量的终点位置。"
            }
        ]
    },

    "向量" : {
        "描述" : "从一个位置到另一个位置的位移矢量。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "开始位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "位移矢量的起点。"
            },
            {
                "名称" : "结束位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "位移矢量的终点。"
            }
        ]
    },

    "地图矢量" : {
        "描述" : "相对于地图坐标的矢量值，与所提供的相对本地坐标的矢量值对应。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "本地矢量",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "将此相对本地坐标的矢量值转化为相对于地图坐标的矢量值。"
            },
            {
                "名称" : "相对玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "本地矢量是相对此玩家的。"
            },
            {
                "名称" : "转换",
                "类型" : "转换",
                "默认" : "旋转",
                "说明" : "指定此矢量是否接受旋转及平移（通常是位置），或者只接受旋转（通常是方向和速度）。"
            }
        ]
    },

    "本地矢量" : {
        "描述" : "相对于本地坐标的矢量值，与所提供的相对地图坐标的矢量值对应。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "地图矢量",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "将此相对地图坐标的矢量值转化为相对于本地坐标的矢量值。"
            },
            {
                "名称" : "相对玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "本地矢量是相对此玩家的。"
            },
            {
                "名称" : "转换",
                "类型" : "转换",
                "默认" : "旋转",
                "说明" : "指定此矢量是否接受旋转及平移（通常是位置），或者只接受旋转（通常是方向和速度）。"
            }
        ]
    },

    "射线命中位置" : {
        "描述" : "射线在表面、物体或玩家上命中的位置（如果没有命中则此位置在视线结束处）。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "开始位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "射线开始施放的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            {
                "名称" : "结束位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "射线结束的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            {
                "名称" : "包括玩家",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "哪些玩家可以被射线击中。"
            },
            {
                "名称" : "不包括玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "射线不会击中的玩家。此列表将优先于“包括玩家”。"
            },
            {
                "名称" : "包括玩家拥有的物体",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "玩家拥有的物体（如屏障或炮台）是否包括在射线中。"
            }
        ]
    },

    "射线命中法线" : {
        "描述" : "射线命中平面的法线（如果没有命中，则从视线结束位置到射线起始位置）。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "开始位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "射线开始施放的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            {
                "名称" : "结束位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "射线结束的位置。如果此处填入一名玩家，则使用从此玩家脚部向上2米的位置。"
            },
            {
                "名称" : "包括玩家",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "哪些玩家可以被射线击中。"
            },
            {
                "名称" : "不包括玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "射线不会击中的玩家。此列表将优先于“包括玩家”。"
            },
            {
                "名称" : "包括玩家拥有的物体",
                "类型" : "0000000",
                "默认" : "真",
                "说明" : "玩家拥有的物体（如屏障或炮台）是否包括在射线中。"
            }
        ]
    },

    "事件方向" : {
        "描述" : "此规则当前处理的事件来自哪个方向。",
        "返回" : "矢量",
        "参数" : []
    },

    "归一化" : {
        "描述" : "将矢量归一化为单位长度。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "矢量",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "要归一化的矢量。"
            }
        ]
    },

    "矢量积" : {
        "描述" : "指定值的矢量积。（左乘以上等于前）",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "用于计算矢量积的左边矢量。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "用于计算矢量积的右边矢量。"
            }
        ]
    },

    "标量积" : {
        "描述" : "指定值的标量积。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "用于计算标量积的矢量之一。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "用于计算标量积的矢量之一。"
            }
        ]
    },

    "面朝方向" : {
        "描述" : "玩家当前面向方向与地图相对角度的单位长度方向矢量。此矢量的值同进包括水平和垂直方向。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家面向的方向"
            }
        ]
    },

    "阈值" : {
        "描述" : "玩家所输入的方向，通过一个矢量表示，X轴为水平（正值代表向左），Z轴为垂直（正值代表向前）。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的方向输入。"
            }
        ]
    },

    "眼睛位置" : {
        "描述" : "玩家第一人称视角的位置（用于瞄准）",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的方向输入。"
            }
        ]
    },

    "所选位置" : {
        "描述" : "玩家的当前位置，此值为矢量。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的位置。"
            }
        ]
    },

    "旗帜位置" : {
        "描述" : "在勇夺锦旗模式中指定队伍的位置。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "队伍",
                "类型" : "0000000",
                "默认" : "所有队伍",
                "说明" : "获取此队伍旗帜的位置。"
            }
        ]
    },

    "最近的可行走位置" : {
        "描述" : "与指定位置最接近的、可以站立且能够从一个重生点到达的位置。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的方向输入。"
            }
        ]
    },

    "眼睛位置" : {
        "描述" : "玩家第一人称视角的位置（用于瞄准）",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "寻找此位置附近最近的可行走位置。"
            }
        ]
    },

    "运载目标位置" : {
        "描述" : "已激活的运载目标在地图中的位置。",
        "返回" : "矢量",
        "参数" : []
    },

    "目标位置" : {
        "描述" : "特定目标点（控制点、运载目标检查点、或运载目标目的地）在地图中的位置。在攻防作战、攻击/护送及占领要点模式中生效。",
        "返回" : "矢量",
        "参数" : [
            {
                "名称" : "目标点索引",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "考察的目标点的索引，从0开始逐渐累加。每个控制点、运载目标检查点、运载目标目的地都有其独自的索引。"
            }
        ]
    }
};
const angles = {

    "角度差" : {
        "描述" : "两个角度之间的度数差。将两个角度折算为彼此+/-180度范围内之后进行计算，如果第二个角度比第一个大则结果为正数。否则结果为负数。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "角度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "用于计算结果角度的两个角度之一。"
            },
            {
                "名称" : "角度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "用于计算结果角度的两个角度之一。"
            }
        ]
    },

    "角度的余弦值" : {
        "描述" : "指定角度（以度为单位）的余弦值。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "角度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "角度，以角度为单位。"
            }
        ]
    },

    "角度的正切值" : {
        "描述" : "指定角度（以度为单位）的正切值。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "角度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "角度，以角度为单位。"
            }
        ]
    },

    "角度的正弦值" : {
        "描述" : "指定角度（以度为单位）的正弦值。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "角度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "角度，以角度为单位。"
            }
        ]
    },

    "垂直方向夹角" : {
        "描述" : "玩家当前朝向的方向与指定位置之间的垂直方向夹角，单位为度。如果位置在玩家下方，则结果为正数。否则，结果为零或负数。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "以此玩家当前面向的角度为起点。"
            },
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "测定与地图中此位置的夹角。"
            }
        ]
    },

    "垂直朝向角度" : {
        "描述" : "玩家当前面对的方向与地图的垂直夹角。当玩家转向下方时这个值会增加。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的面向角度。"
            }
        ]
    },

    "水平方向夹角" : {
        "描述" : "玩家当前朝向的方向与指定位置之间的水平方向夹角，单位为度。如果位置在玩家左边，则结果为正数。否则，结果为零或负数。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "以此玩家当前面向的角度为起点。"
            },
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "测定与地图中此位置的夹角。"
            }
        ]
    },

    "水平朝向角度" : {
        "描述" : "玩家当前面对的方向与地图的水平夹角。当玩家转向左方时这个值会增加。（范围为+/-180）。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "获取此玩家的面向角度。"
            }
        ]
    },

    "矢量间夹角" : {
        "描述" : "两方向性矢量间的夹角（不需要归一化）",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "矢量",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "需以角度为单位测量夹角的两个方向性矢量之一。该矢量不需要预先归一化。"
            },
            {
                "名称" : "矢量",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "需以角度为单位测量夹角的两个方向性矢量之一。该矢量不需要预先归一化。"
            }
        ]
    },

    "以角度为单位的反余弦值" : {
        "描述" : "指定值的反余弦值，以角度为单位。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "为函数输入值。"
            }
        ]
    },

    "以角度为单位的反正弦值" : {
        "描述" : "指定值的反正弦值，以角度为单位。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "为函数输入值。"
            }
        ]
    },

    "以角度为单位的反正切值" : {
        "描述" : "指定分子及分母的反正切值（通常称为Atan2），以角度为单位。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "分子",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "为函数输入分子。"
            },
            {
                "名称" : "分母",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "为函数输入分母。"
            }
        ]
    },

    "与此方向的垂直角度" : {
        "描述" : "与指定方向矢量的垂直夹角，单位为度。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "对此方向矢量获取水平角度，单位为度。此矢量在计算开始前进行统一化。"
            }
        ]
    },

    "与此方向的水平角度" : {
        "描述" : "与指定方向矢量的水平夹角，单位为度。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "对此方向矢量获取垂直角度，单位为度。此矢量在计算开始前进行统一化。"
            }
        ]
    },

    "与此角度的相对方向" : {
        "描述" : "指向指定角度的单位长度矢量。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "水平角度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "用于构建结果矢量的水平角度，单位为度。"
            },
            {
                "名称" : "垂直角度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "用于构建结果矢量的垂直角度，单位为度。"
            }
        ]
    },

    "弧度的余弦值" : {
        "描述" : "指定角度（以弧度为单位）的余弦值。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "角度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "角度，以弧度为单位。"
            }
        ]
    },

    "弧度的正弦值" : {
        "描述" : "指定角度（以弧度为单位）的正弦值。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "角度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "角度，以角度为单位。"
            }
        ]
    },

    "弧度的正切值" : {
        "描述" : "指定弧度（以度为单位）的正切值。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "角度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "角度，以角度为单位。"
            }
        ]
    },

    "以弧度为单位的反余弦值" : {
        "描述" : "指定值的反余弦值，以弧度为单位。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "为函数输入值。"
            }
        ]
    },

    "以弧度为单位的反正弦值" : {
        "描述" : "指定值的反正弦值，以弧度为单位。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "为函数输入值。"
            }
        ]
    },

    "以弧度为单位的反正切值" : {
        "描述" : "指定分子及分母的反正切值（通常称为Atan2），以弧度为单位。",
        "返回" : "数字",
        "参数" : [
            {
                "名称" : "分子",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "为函数输入分子。"
            },
            {
                "名称" : "分母",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "为函数输入分母。"
            }
        ]
    }

};
const arrays = {

    "数组" : {
        "描述" : "由所列出的值组成的数组。",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "[0]",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "此值将存储在数组中指针位置为[%1$s]的位置"
            }
        ]
    },

    "映射的数组" : {
        "描述" : "复制指定的数组，根据映射表达式对每个元素进行赋值。",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "对此数组的复制进行映射。"
            },
            {
                "名称" : "条件",
                "类型" : "0000000",
                "默认" : "当前数组元素",
                "说明" : "映射表达式将此数组中的每个元素复值为被复制的数组中的元素值。使用“当前数组元素值”可以指定当前考察的数组中元素的值。"
            }
        ]
    },

    "已排序的数组" : {
        "描述" : "复制指定的数组，根据每个元素的值的排名重新排序。",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "对此数组的复制进行排序。"
            },
            {
                "名称" : "条件",
                "类型" : "0000000",
                "默认" : "当前数组元素",
                "说明" : "将此值赋值给复制的数组中的每个元素。数组将以升序排列。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。"
            }
        ]
    },

    "已过滤的数组" : {
        "描述" : "复制指定的数组，不满足特定条件的值将被移除。",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "对此数组的复制进行过滤。"
            },
            {
                "名称" : "条件",
                "类型" : "0000000",
                "默认" : "当前数组元素",
                "说明" : "对复制的数组中每个元素判断此条件。如果条件为“真”，则在复制的数组中保留此元素。可以使用“当前数组元素值”来指代数组中当前正在进行判断的元素。"
            }
        ]
    },

    "当前数组元素" : {
        "描述" : "当前在考察的数组元素。只有在使用“过滤数组”或“排序数组”赋值时才有意义。",
        "返回" : "数组",
        "参数" : []
    },

    "当前数组索引" : {
        "描述" : "当前在考察的数组索引。只有在使用“过滤数组”或“排序数组”赋值时才有意义。",
        "返回" : "数组",
        "参数" : []
    },

    "数组中的值" : {
        "描述" : "一个数组中指定元素的值。如果该元素不存在，则结果为0。",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "获取此数组中的元素。"
            },
            {
                "名称" : "索引",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "获取索引中的元素。"
            }
        ]
    },

    "数组值的索引" : {
        "描述" : "一个值在数组中的索引位置。如果找不到此值，则为",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "在此数组中搜索指定的值。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "要搜索的值。"
            }
        ]
    },

    "数组分割" : {
        "描述" : "复制指定的数组，只复制指定索引范围内的值。",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "产生此数组的复制。"
            },
            {
                "名称" : "开始索引",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "范围内的第一个索引。"
            },
            {
                "名称" : "计数",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "结果数组中的元素数量。如果指定的范围超过此数组的限制，则结果数组中会包含较少的元素。"
            }
        ]
    },

    "数组包含" : {
        "描述" : "指定数组中是否包含指定的值。",
        "返回" : "布尔",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "在此数组中搜索指定的值。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "要搜索的值。"
            }
        ]
    },

    "数组随机取值" : {
        "描述" : "指定数组中的一个随机值。",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "从一个数组中随机取值。如果提供的值不是数组，则结果为提供的值。"
            }
        ]
    },

    "随机数组" : {
        "描述" : "复制指定的数组，所有值随机排序。",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "对此数组的复制进行随机排列。"
            }
        ]
    },

    "首个" : {
        "描述" : "指定数组开始处的值。如果指定数组为空，此值则为0。",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "获取此数组中的值。"
            }
        ]
    },

    "最后" : {
        "描述" : "指定数组末尾元素的值。如果指定数组为空，则结果为0。",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "获取此数组中的值。"
            }
        ]
    },

    "从数组中移除" : {
        "描述" : "一个数组的复制，移除一个或更多的值（如果能找到）。",
        "返回" : "数组",
        "参数" : [
            {
                "名称" : "数组",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "从此数列中移除值。"
            },
            {
                "名称" : "值",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "要从数列中移除的值（如果能找到）。如果值本身是一个数列，则所有匹配的元素都将被移除。"
            }
        ]
    },

    "空数组" : {
        "描述" : "一个没有任何元素的数组。",
        "返回" : "数组",
        "参数" : []
    }

};
const strings = {
    
    "自定义字符串" : {
        "描述" : "可以输入值的自定义文本",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "字符串",
                "类型" : "0000000",
                "默认" : "\"\"",
                "说明" : "返还的文本。花括号中的数字将被相应的值取代。（如果想在文本中使用花括号中的数字，请使用两次花括号。）"
            },
            {
                "名称" : "{0}",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "此值将转换为文本并用于替代{0}。"
            },
            {
                "名称" : "{1}",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "此值将转换为文本并用于替代{1}。"
            },
            {
                "名称" : "{2}",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "此值将转换为文本并用于替代{2}。"
            }
        ]
    },
    
    "图标字符串" : {
        "描述" : "可以在字符串中使用图标（每个字符串最多4个图标）。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "图标",
                "类型" : "图标",
                "默认" : "箭头：向下",
                "说明" : "要显示的图标"
            }
        ]
    },
    
    "英雄图标字符串" : {
        "描述" : "将一个英雄的参数转化为字符串并作为图标显示（每个字符串最多4项）。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "值",
                "类型" : "英雄",
                "默认" : "英雄(安娜)",
                "说明" : "此英雄将被转换为一个图标。"
            }
        ]
    },
    
    "技能图标字符串" : {
        "描述" : "将一个英雄和按键的参数转化为图标在字符串中显示（每个字符串中最多4个）。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "英雄",
                "类型" : "英雄",
                "默认" : "英雄(安娜)",
                "说明" : "将这个英雄的技能转化为图标。"
            },
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "将这个技能的按键转化为图标。"
            }
        ]
    },
    
    "字符串中字符" : {
        "描述" : "一条字符串的指定索引对应的字符。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "字符串",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "获取此字符串值的字符。"
            },
            {
                "名称" : "索引",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "要获取字符的索引（0表示第一个字符，1表示第二个字符，以此类推）。"
            }
        ]
    },
    
    "字符串分割" : {
        "描述" : "结果为字符串值数组。数组中的字符串值由将指定字符串值用分隔符字符串分割而成。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "字符串",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "要分割的字符串值"
            },
            {
                "名称" : "分隔符",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "要分割字符串值所用的分隔符字符串。"
            }
        ]
    },
    
    "字符串包含" : {
        "描述" : "指定字符串中是否包含指定的值。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "字符串",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "在此字符串中搜索指定的值。"
            },
            {
                "名称" : "字符串",
                "类型" : "0000000",
                "默认" : "自定义字符串(\"\")",
                "说明" : "要搜索的值。"
            }
        ]
    },
    
    "字符串字符索引" : {
        "描述" : "一个字符在字符串中的索引位置。如果找不到此字符，则为-1。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "字符串",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "从此字符串值中搜索字符。"
            },
            {
                "名称" : "字符",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "要搜索的字符。"
            }
        ]
    },
    
    "字符串替换" : {
        "描述" : "结果为字符串值。此字符串值由将指定字符串值中出现的所有模式字符串替换为替换字符串而成。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "字符串",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "在此字符串中搜索进行替换。"
            },
            {
                "名称" : "模式",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "要替换的字符串模式。"
            },
            {
                "名称" : "替换",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "用此字符串值替换模式字符串。"
            }
        ]
    },
    
    "字符串长度" : {
        "描述" : "结果为所选字符串值中的字符数（所选值不是字符串时为0）。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "字符串",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "计算此字符串值的字符数。"
            },
        ]
    },
    
    "截取字符串" : {
        "描述" : "结果为所选字符串值的指定子字符串。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "字符串",
                "类型" : "0000000",
                "默认" : "全局.A",
                "说明" : "从此字符串值中构建子字符串。"
            },
            {
                "名称" : "开始字符索引",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "指定一个字符作为子字符串的起始处（0表示第一个字符，1表示第二个字符，以此类推）。"
            },
            {
                "名称" : "字符串长度",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "指定子字符串的字符数。"
            }
        ]
    },
    
    "输入绑定字符串" : {
        "描述" : "将一个“按钮”参数转化为一个字符串，根据玩家所输入的绑定按键显示。此值不能存储在变量中。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "按钮",
                "类型" : "按钮",
                "默认" : "按钮(主要攻击模式)",
                "说明" : "将这个输入绑定的按键转化为图标。"
            }
        ]
    },
    
    "字符串" : {
        "描述" : "由选定的字符串和指定的值构成的文本。",
        "返回" : "文本",
        "参数" : [
            {
                "名称" : "字符串",
                "类型" : "默认字符串",
                "默认" : "\"问候\"",
                "说明" : "结果文本。花括号中的数字将被相应的值取代。"
            },
            {
                "名称" : "{0}",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "此值将转换为文本并用于替代{0}。"
            },
            {
                "名称" : "{1}",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "此值将转换为文本并用于替代{1}。"
            },
            {
                "名称" : "{2}",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "此值将转换为文本并用于替代{2}。"
            }
        ]
    },
    
    
};
const colors = {
    
    "自定义颜色" : {
        "描述" : "可设置指定RGB值和不透明度的自定义颜色。",
        "返回" : "颜色",
        "参数" : [
            {
                "名称" : "红色",
                "类型" : "0000000",
                "默认" : "255",
                "说明" : "一种颜色的红色分量。"
            },
            {
                "名称" : "绿色",
                "类型" : "0000000",
                "默认" : "255",
                "说明" : "一种颜色的绿色分量。"
            },
            {
                "名称" : "蓝色",
                "类型" : "0000000",
                "默认" : "255",
                "说明" : "一种颜色的蓝色分量。"
            },
            {
                "名称" : "不透明度",
                "类型" : "0000000",
                "默认" : "255",
                "说明" : "一种颜色的不透明度分量。"
            }
        ]
    },
    
    "颜色" : {
        "描述" : "一个颜色常量。",
        "返回" : "颜色",
        "参数" : [
            {
                "名称" : "颜色",
                "类型" : "颜色",
                "默认" : "白色",
                "说明" : "一个颜色常量。"
            }
        ]
    }
};

const constants = {
    //----------------------------------------------
    "等待" : {
        "无视条件" : "动作列表的执行不会被中断。",
        "当为“假”时中止" : "如果此规则中任何一项条件变为假，则中止执行动作列表。",
        "当为“真”时重新开始" : "如果条件列表从假转变为真，或者规则中的事件在为真的条件下再次发生，则从第一项动作开始重新执行动作列表。"
    },
    
    "规则" : {
        "重新开始规则" : "",
        "无动作" : ""
    },
    
    "生命类型" : {
        "生命值" : "",
        "护甲" : "",
        "护盾" : ""
    },
    
    "伤害调整" : {
        "无" : "",
        "受伤害者和伤害者" : "",
        "受伤害者，伤害者及伤害百分比" : ""
    },
    
    "治疗调整" : {
        "无" : "",
        "受治疗者和治疗者" : "",
        "受治疗者，治疗者及治疗百分比" : ""
    },
    
    "助攻" : {
        "助攻者和目标" : "",
        "无" : ""
    },
    
    "朝向" : {
        "方向及角速率" : "",
        "无" : ""
    },
    
    "加速" : {
        "方向，速率，及最大速度" : "",
        "无" : ""
    },
    
    "轮廓" : {
        "默认" : "",
        "遮蔽" : "",
        "总是" : ""
    },
    
    "阈值行为" : {
        "替换现有阈值" : "",
        "添加至现有阈值" : ""
    },
    
    "相对" : {
        "至地图" : "",
        "至玩家" : ""
    },
    
    "阈值更新" : {
        "方向和幅度" : "",
        "无" : ""
    },
    
    "状态" : {
        "沉睡" : "",
        "燃烧" : "",
        "冰冻" : "",
        "被入侵" : "",
        "无敌" : "",
        "击倒" : "",
        "相移" : "",
        "定身" : "",
        "击晕" : "",
        "无法杀死" : ""
    },
    
    "按钮" : {
        "主要攻击模式" : "",
        "辅助攻击模式" : "",
        "技能1" : "",
        "技能2" : "",
        "终极技能" : "",
        "近身攻击" : "",
        "跳跃" : "",
        "蹲下" : "",
        "装填" : "",
        "互动" : ""
    },
    
    "相反运动" : {
        "取消相反运动" : "",
        "取消相反运动XYZ" : "",
        "合并相反运动" : ""
    },
    
    "不可见" : {
        "全部" : "",
        "敌人" : "",
        "无" : ""
    },
    
    "交流" : {
        "收到" : "",
        "不行" : "",
        "抱歉" : "",
        "好的" : "",
        "感谢" : "",
        "撤退" : "",
        "推进" : "",
        "前进" : "",
        "集合" : "",
        "再见" : "",
        "问候" : "",
        "不用谢" : "",
        "我上了" : "",
        "倒计时" : "",
        "敌人来袭" : "",
        "需要治疗" : "",
        "需要帮助" : "",
        "做好准备" : "",
        "正在进攻" : "",
        "正在防守" : "",
        "正在赶来" : "",
        "继续攻击" : "",
        "我跟着你" : "",
        "喷漆上" : "",
        "喷漆左" : "",
        "喷漆右" : "",
        "喷漆下" : "",
        "语音（上）" : "",
        "语音（左）" : "",
        "语音（右）" : "",
        "语音（下）" : "",
        "表情（上）" : "",
        "表情（左）" : "",
        "表情（右）" : "",
        "表情（下）" : "",
        "终极技能状态" : ""
    },
    
    "文本更新" : {
        "无" : "",
        "颜色" : "",
        "字符串" : "",
        "字符串和颜色" : "",
        "可见" : "",
        "可见和颜色" : "",
        "可见和字符串" : "",
        "可见，字符串和颜色" : "",
        "可见性和排序" : "",
        "可见，排序规则和颜色" : "",
        "可见性，排序规则和字符串" : "",
        "可见，排序规则，字符串和颜色" : "",
        "排序" : "",
        "排序规则和颜色" : "",
        "排序规则和字符串" : "",
        "排序规则，字符串和颜色" : ""
    },
    
    "操作" : {
        "加" : "",
        "减" : "",
        "乘" : "",
        "除" : "",
        "最小" : "",
        "最大" : "",
        "根据值从数组中移除" : "",
        "根据索引从数组中移除" : "",
        "添加至数组" : "",
        "余数" : "",
        "乘方" : ""
    },
    
    "追踪持续" : {
        "终点及持续时间" : "",
        "全部禁用" : ""
    },
    
    "追踪频率" : {
        "速率及最终值" : "",
        "全部禁用" : ""
    },
    
    "坐标" : {
        "左边" : "",
        "顶部" : "",
        "右边" : ""
    },
    
    "观战可见" : {
        "默认可见度" : "",
        "始终可见" : "",
        "始终不可见" : ""
    },
    
    "进度条更新" : {
        "无" : "",
        "颜色" : "",
        "值" : "",
        "值和颜色" : "",
        "可见" : "",
        "可见和值" : "",
        "可见和颜色" : "",
        "可见，值和颜色" : "",
    },
    
    "截取" : {
        "根据表面截取" : "",
        "不要截取" : "",
    },
    
    "地图进度条更新" : {
        "无" : "",
        "颜色" : "",
        "值" : "",
        "值和颜色" : "",
        "位置" : "",
        "位置和值" : "",
        "位置和颜色" : "",
        "位置，值和颜色" : "",
        "可见" : "",
        "可见和值" : "",
        "可见和颜色" : "",
        "可见和位置" : "",
        "可见，值和颜色" : "",
        "可见，位置和值" : "",
        "可见，位置和颜色" : "",
        "可见，位置，值和颜色" : ""
    },
    
    "图标更新" : {
        "无" : "",
        "颜色" : "",
        "位置" : "",
        "位置和颜色" : "",
        "可见" : "",
        "可见和位置" : "",
        "可见和颜色" : "",
        "可见，位置和颜色" : ""
    },
    
    "图标" : {
        "箭头：向下" : "",
        "箭头：向左" : "",
        "箭头：向右" : "",
        "箭头：向上" : "",
        "星形" : "",
        "箭矢" : "",
        "对号" : "",
        "圆圈" : "",
        "梅花" : "",
        "方块" : "",
        "晕眩" : "",
        "感叹号" : "",
        "眼睛" : "",
        "火焰" : "",
        "旗帜" : "",
        "光晕" : "",
        "高兴" : "",
        "红桃" : "",
        "满月" : "",
        "拒绝" : "",
        "加号" : "",
        "剧毒" : "",
        "剧毒2" : "",
        "问号" : "",
        "辐射" : "",
        "回收" : "",
        "宽环" : "",
        "细环" : "",
        "难过" : "",
        "骷髅" : "",
        "黑桃" : "",
        "螺旋" : "",
        "停止" : "",
        "垃圾箱" : "",
        "警告" : "",
        "X" : ""
    },
    
    "地图文本更新" : {
        "无" : "",
        "颜色" : "",
        "字符串" : "",
        "字符串和颜色" : "",
        "可见" : "",
        "可见和颜色" : "",
        "可见和位置" : "",
        "可见和字符串" : "",
        "可见，位置和颜色" : "",
        "可见，位置和字符串" : "",
        "可见，字符串和颜色" : "",
        "可见，位置，字符串和颜色" : ""
    },
    
    "效果更新" : {
        "无" : "",
        "颜色" : "",
        "位置和半径" : "",
        "位置，半径和颜色" : "",
        "可见" : "",
        "可见和颜色" : "",
        "可见，位置和半径" : "",
        "可见，位置，半径和颜色" : ""
    },
    
    "基础效果" : {
        "球体" : "",
        "光柱" : "",
        "球" : "",
        "环" : "",
        "云" : "",
        "火花" : "",
        "有益光环" : "",
        "有害光环" : "",
        "能量声音" : "",
        "拾取音效" : "",
        "有益光环声音" : "",
        "负面光环音效" : "",
        "火花声音" : "",
        "烟雾声音" : "",
        "诱饵声音" : "",
        "信标声音" : ""
    },
    
    "基础播放效果" : {
        "有益爆炸" : "",
        "有害爆炸" : "",
        "环状爆炸" : "",
        "有益选择效果" : "",
        "有害选择效果" : "",
        "正面状态施加声音" : "",
        "负面状态施加声音" : "",
        "状态爆炸声音" : "",
        "环状爆炸声音" : "",
        "爆炸声音" : ""
    },
    
    "玩家数据" : {
        "所有造成伤害量" : "",
        "对屏障造成伤害量" : "",
        "阻挡伤害量" : "",
        "承受伤害量" : "",
        "阵亡" : "",
        "消灭" : "",
        "地形阵亡" : "",
        "地形消灭" : "",
        "协助防守" : "",
        "协助进攻" : "",
        "最后一击" : "",
        "对英雄造成伤害量" : "",
        "治疗量" : "",
        "最佳瞬间消灭" : "",
        "瞬间消灭" : "",
        "目标攻防消灭" : "",
        "单独消灭" : "",
        "获得终极技能" : "",
        "使用终极技能" : "",
        "武器命中率" : ""
    },
    
    "英雄数据" : {
        "所有造成伤害量" : "",
        "对屏障造成伤害量" : "",
        "阻挡伤害量" : "",
        "承受伤害量" : "",
        "阵亡" : "",
        "消灭" : "",
        "地形阵亡" : "",
        "地形消灭" : "",
        "协助防守" : "",
        "协助进攻" : "",
        "最后一击" : "",
        "对英雄造成伤害量" : "",
        "治疗量" : "",
        "最佳瞬间消灭" : "",
        "瞬间消灭" : "",
        "目标攻防消灭" : "",
        "单独消灭" : "",
        "获得终极技能" : "",
        "使用终极技能" : "",
        "武器命中率" : "",
        "暴击命中率" : "",
        "暴击" : "",
        "受到治疗量" : "",
        "开镜命中率" : "",
        "开镜暴击率" : "",
        "开镜暴击消灭" : "",
        "开镜暴击" : "",
        "开镜命中" : "",
        "开镜射击" : "",
        "自我治疗量" : "",
        "射击次数" : "",
        "射击命中" : "",
        "射击未命中" : ""
    },
    
    "屏障" : {
        "屏障不会阻挡视线" : "",
        "敌方屏障阻挡视线" : "",
        "所有屏障阻挡视线" : ""
    },
    
    "取整" : {
        "上" : "",
        "下" : "",
        "至最近" : ""
    },
    
    "英雄" : {
        "死神" : "",
        "猎空" : "",
        "天使" : "",
        "半藏" : "",
        "托比昂" : "",
        "莱因哈特" : "",
        "法老之鹰" : "",
        "温斯顿" : "",
        "黑百合" : "",
        "堡垒" : "",
        "秩序之光" : "",
        "禅雅塔" : "",
        "源氏" : "",
        "路霸" : "",
        "卡西迪" : "",
        "狂鼠" : "",
        "查莉娅" : "",
        "士兵：76" : "",
        "卢西奥" : "",
        "D.Va" : "",
        "美" : "",
        "黑影" : "",
        "末日铁拳" : "",
        "安娜" : "",
        "奥丽莎" : "",
        "布丽吉塔" : "",
        "莫伊拉" : "",
        "破坏球" : "",
        "索杰恩" : "",
        "艾什" : "",
        "回声" : "",
        "巴蒂斯特" : "",
        "雾子" : "",
        "渣客女王" : "",
        "西格玛" : "",
        "拉玛刹" : "",
        "生命之梭" : "",
        "伊拉锐" : "",
        "毛加" : "",
        "探奇" : "",
        "朱诺" : ""
    },
    
    "游戏模式" : {
        "攻防作战" : "",
        "赏金猎手" : "",
        "占领要点" : "",
        "勇夺锦旗" : "",
        "决斗先锋" : "",
        "运载目标" : "",
        "死斗" : "",
        "融冰决斗" : "",
        "攻击护送" : "",
        "怪鼠复仇" : "",
        "雪球攻势" : "",
        "训练靶场" : "",
        "机动推进" : "",
        "突击模式" : "",
        "雪球死斗" : "",
        "团队死斗" : "",
        "雪域狩猎" : ""
    },
    
    "地图" : {
        "66号公路" : "",
        "万圣节吉拉德堡" : "",
        "万圣节好莱坞" : "",
        "万圣节艾兴瓦尔德" : "",
        "伊利奥斯" : "",
        "伊利奥斯废墟" : "",
        "伊利奥斯深井" : "",
        "伊利奥斯灯塔" : "",
        "佩特拉" : "",
        "努巴尼" : "",
        "吉拉德堡" : "",
        "哈瓦那" : "",
        "国王大道" : "",
        "圣诞节国王大道" : "",
        "圣诞节尼泊尔村庄" : "",
        "圣诞节暴雪世界" : "",
        "圣诞节生态监测站：南极洲" : "",
        "圣诞节花村" : "",
        "圣诞节黑森林" : "",
        "地图工坊室内" : "",
        "地图工坊岛屿" : "",
        "地图工坊岛屿（夜间）" : "",
        "地图工坊空地" : "",
        "地图工坊空地（夜间）" : "",
        "地图工坊绿幕" : "",
        "城堡" : "",
        "墓园" : "",
        "多拉多" : "",
        "好莱坞" : "",
        "尼泊尔" : "",
        "尼泊尔圣坛" : "",
        "尼泊尔圣所" : "",
        "尼泊尔村庄" : "",
        "巴黎" : "",
        "弗格体育场" : "",
        "怪鼠复仇" : "",
        "悉尼海港竞技场" : "",
        "悉尼海港竞技场（经典）" : "",
        "春节漓江塔" : "",
        "春节漓江塔夜市" : "",
        "春节漓江塔庭院" : "",
        "春节漓江塔控制中心" : "",
        "春节釜山城区" : "",
        "春节釜山寺院" : "",
        "暴雪世界" : "",
        "沃斯卡娅工业区" : "",
        "渣客镇" : "",
        "漓江塔" : "",
        "漓江塔夜市" : "",
        "漓江塔庭院" : "",
        "漓江塔控制中心" : "",
        "生态监测站：南极洲" : "",
        "监测站：直布罗陀" : "",
        "绿洲城" : "",
        "绿洲城中心" : "",
        "绿洲城大学" : "",
        "绿洲城花园" : "",
        "艾兴瓦尔德" : "",
        "花村" : "",
        "训练靶场" : "",
        "里阿尔托" : "",
        "釜山" : "",
        "釜山体育场" : "",
        "釜山体育场（经典）" : "",
        "铁坂" : "",
        "阿努比斯神殿" : "",
        "马莱温多" : "",
        "阿育陀耶" : "",
        "黑森林" : "",
        "“地平线”月球基地" : "",
        "皇家赛道" : "",
        "斗兽场" : "",
        "埃斯佩兰萨" : "",
        "中城" : "",
        "新皇后街" : "",
        "帕拉伊苏" : "",
        "香巴里寺院" : "",
        "南极半岛" : "",
        "萨摩亚" : "",
        "鲁纳塞彼" : "",
        "新渣客镇" : "",
        "苏拉瓦萨" : "",
        "英雄精通：试炼场" : "",
        "花冈" : "",
        "阿努比斯王座" : "",
    },
    
    "布尔" : {
        "真" : "",
        "假" : ""
    },
    
    "颜色" : {
        "白色" : "",
        "黄色" : "",
        "绿色" : "",
        "紫色" : "",
        "红色" : "",
        "蓝色" : "",
        "水绿色" : "",
        "橙色" : "",
        "天蓝色" : "",
        "青绿色" : "",
        "灰绿色" : "",
        "亮紫色" : "",
        "黑色" : "",
        "玫红" : "",
        "灰色" : ""
    },
    
    "基础光束效果" : {
        "有益光束" : "",
        "有害光束" : "",
        "抓钩光束" : ""
    },
    
    "队伍" : {
        "所有队伍" : "",
        "队伍1" : "",
        "队伍2" : ""
    },
    
    "转换" : {
        "旋转" : "",
        "旋转并转换" : ""
    },
    
    "事件" : {
        "持续 - 全局" : "",
        "持续 - 每名玩家" : "",
        "玩家造成伤害" : "",
        "玩家受到伤害" : "",
        "玩家造成治疗" : "",
        "玩家受到治疗" : "",
        "玩家造成击退" : "",
        "玩家受到击退" : "",
        "玩家造成最后一击" : "",
        "玩家阵亡" : "",
        "玩家参与消灭" : "",
        "玩家加入比赛" : "",
        "玩家离开比赛" : "",
        "子程序" : ""
    },
    
    "栏位" : {
        "全部" : "",
        "栏位0" : "",
        "栏位1" : "",
        "栏位2" : "",
        "栏位3" : "",
        "栏位4" : "",
        "栏位5" : "",
        "栏位6" : "",
        "栏位7" : "",
        "栏位8" : "",
        "栏位9" : "",
        "栏位10" : "",
        "栏位11" : ""
    },
    
    "额外光束效果" : {
        "布丽吉塔连枷链光束" : "",
        "“回声”聚焦光线光束声音" : "",
        "“狂鼠”陷阱链光束" : "",
        "“天使”治疗光束声音" : "",
        "“天使”治疗光束" : "",
        "莫伊拉生化之球治疗光束" : "",
        "莫伊拉生化之球伤害光束" : "",
        "莫伊拉生化之触连接光束" : "",
        "莫伊拉聚合射线光束" : "",
        "奥丽莎站住别动连线光束" : "",
        "奥丽莎强化光束" : "",
        "“秩序之光”光子发射器光束" : "",
        "“秩序之光”哨戒炮光束" : "",
        "托比昂炮台视线光束" : "",
        "温斯顿特斯拉炮光束" : "",
        "查莉娅粒子光束" : "",
        "智械切割者光束" : ""
    },
    
    "额外光束声音" : {
        "“回声”聚焦光线光束声音" : "",
        "“狂鼠”陷阱链声音" : "",
        "“天使”治疗光束声音" : "",
        "“天使”强化光束声音" : "",
        "莫伊拉生化之触连接声音" : "",
        "莫伊拉生化之球伤害声音" : "",
        "莫伊拉生化之球治疗声音" : "",
        "莫伊拉聚合射线声音" : "",
        "奥丽莎强化声音" : "",
        "奥丽莎站住别动连线声音" : "",
        "“秩序之光”光子发射器声音" : "",
        "温斯顿特斯拉炮声音" : "",
        "查莉娅粒子炮爆炸声音" : "",
        "智械切割者光束声音" : ""
    },
    
    "减益状态效果" : {
        "安娜生物手雷禁疗效果" : "",
        "安娜麻醉镖效果" : "",
        "艾什延时雷管燃烧粒子效果" : "",
        "艾什延时雷管燃烧材料效果" : "",
        "卡西迪闪光弹击晕效果" : "",
        "美冰冻效果" : "",
        "“西格玛”引力乱流目标效果" : "",
        "“黑影”黑客入侵完成循环效果" : "",
        "“黑百合”剧毒诡雷目标效果" : "",
        "温斯顿特斯拉炮目标效果" : "",
        "禅雅塔乱目标效果" : ""
    },
    
    "减益状态播放效果" : {
        "卡西迪闪光弹击晕效果" : "",
        "“黑影”黑客入侵完成开始效果" : ""
    },
    
    "增益状态效果" : {
        "治疗目标效果" : "",
        "治疗目标激活效果" : "",
        "安娜生物手雷增疗效果" : "",
        "安娜纳米激素强化效果" : "",
        "巴蒂斯特维生力场保护效果" : "",
        "“回声”复制效果" : "",
        "卢西奥音障保护效果" : "",
        "“天使”伤害强化效果" : "",
        "“死神”幽灵形态效果" : "",
        "“士兵：76”疾跑效果" : "",
        "托比昂热力过载效果" : "",
        "温斯顿原始暴怒效果" : "",
        "“破坏球”感应护盾目标效果" : "",
        "“破坏球”重力坠击火焰效果" : ""
    },
    
    "增益状态播放效果" : {
        "治疗目标激活效果" : "",
        "“黑影”位移传动材料效果" : ""
    },
    
    "增益效果和减益效果声音" : {
        "安娜纳米激素强化声音" : "",
        "巴蒂斯特维生力场保护声音" : "",
        "“回声”复制声音" : "",
        "卢西奥音障保护声音" : "",
        "美冰冻声音" : "",
        "“天使”伤害强化声音" : "",
        "“西格玛”引力乱流目标声音" : "",
        "“黑影”黑客入侵进行声音" : "",
        "“黑影”黑客入侵完成声音" : "",
        "托比昂热力过载声音" : "",
        "“黑百合“剧毒诡雷目标声音" : "",
        "温斯顿特斯拉炮目标声音" : "",
        "温斯顿原始暴怒声音" : "",
        "“破坏球”感应护盾目标声音" : "",
        "“破坏球”重力坠击火焰声音" : "",
        "禅雅塔乱目标声音" : ""
    },
    
    "增益效果和减益播放效果声音" : {
        "安娜生物手雷增疗声音" : "",
        "安娜生物手雷禁疗声音" : "",
        "安娜麻醉镖声音" : "",
        "“死神”幽灵形态声音" : "",
        "“黑影”位移传动声音" : "",
        "“士兵：76”疾跑开始声音" : ""
    },
    
    "爆炸声音" : {
        "安娜生物手雷爆炸声音" : "",
        "艾什延时雷管爆炸声音" : "",
        "巴蒂斯特生化榴弹枪爆炸声音" : "",
        "“堡垒”坦克炮爆炸声音" : "",
        "布丽吉塔流星飞锤范围治疗声音" : "",
        "布丽吉塔恢复包击中声音" : "",
        "布丽吉塔恢复包护甲声音" : "",
        "D.Va微型飞弹爆炸声音" : "",
        "D.Va自毁爆炸声音" : "",
        "“末日铁拳”上勾重拳跳跃声音" : "",
        "“末日铁拳”上勾重拳击中声音" : "",
        "“末日铁拳”毁天灭地击中声音" : "",
        "“回声”黏性炸弹爆炸声音" : "",
        "“狂鼠”榴弹发射器爆炸声音" : "",
        "“狂鼠”震荡地雷爆炸声音" : "",
        "“狂鼠”炸弹轮胎爆炸声音" : "",
        "半藏音初始脉冲声音" : "",
        "卢西奥音障施放声音" : "",
        "卡西迪闪光弹爆炸声音" : "",
        "莫伊拉消散消失声音" : "",
        "莫伊拉消散重现声音" : "",
        "奥丽莎站住别动内爆声音" : "",
        "“法老之鹰”火箭发射器爆炸声音" : "",
        "“法老之鹰”震荡冲击声音" : "",
        "“法老之鹰”火箭弹幕爆炸声音" : "",
        "莱因哈特烈焰打击目标击中声音" : "",
        "“西格玛”超能之球内爆声音" : "",
        "“西格玛”质量吸附击中声音" : "",
        "“黑影”标志声音" : "",
        "“黑影”位移传动消失声音" : "",
        "“黑影”位移传动重现声音" : "",
        "“黑影”电磁脉冲爆炸声音" : "",
        "“秩序之光”传送面板重现声音" : "",
        "“猎空”闪回消失声音" : "",
        "“猎空”闪回重现声音" : "",
        "“黑百合”剧毒诡雷爆炸声音" : "",
        "温斯顿喷射背包着陆声音" : "",
        "“破坏球”重力坠击击中声音" : "",
        "“破坏球”地雷禁区爆炸声音" : "",
        "查莉娅粒子炮爆炸声音" : ""
    },
    
    "能量爆炸效果" : {
        "布丽吉塔恢复包击中效果" : "",
        "布丽吉塔恢复包护甲效果" : "",
        "布丽吉塔流星飞锤范围治疗效果" : "",
        "D.Va微型飞弹爆炸效果" : "",
        "D.Va自毁爆炸效果" : "",
        "“回声”黏性炸弹爆炸效果" : "",
        "半藏音初始脉冲效果" : "",
        "卢西奥音障施放效果" : "",
        "莫伊拉消散消失效果" : "",
        "莫伊拉消散重现效果" : "",
        "奥丽莎站住别动内爆效果" : "",
        "“西格玛”超能之球内爆效果" : "",
        "“黑影”标志效果" : "",
        "“黑影”位移传动消失效果" : "",
        "“黑影”位移传动重现效果" : "",
        "“黑影”电磁脉冲爆炸效果" : "",
        "“秩序之光”传送面板重现效果" : "",
        "“猎空”闪回消失效果" : "",
        "“猎空“闪回重现效果" : "",
        "查莉娅粒子炮爆炸效果" : ""
    },
    
    "运动爆炸效果" : {
        "安娜生物手雷爆炸效果" : "",
        "艾什延时雷管爆炸效果" : "",
        "巴蒂斯特生化榴弹枪爆炸效果" : "",
        "“堡垒”坦克炮爆炸效果" : "",
        "“末日铁拳”上勾重拳跳跃效果" : "",
        "“末日铁拳”上勾重拳击中效果" : "",
        "“末日铁拳”毁天灭地击中效果" : "",
        "“狂鼠”榴弹发射器爆炸效果" : "",
        "“狂鼠”震荡地雷爆炸效果" : "",
        "“狂鼠”炸弹轮胎爆炸效果" : "",
        "卡西迪闪光弹爆炸效果" : "",
        "“法老之鹰”火箭发射器爆炸效果" : "",
        "“法老之鹰”震荡冲击效果" : "",
        "“法老之鹰”火箭弹幕爆炸效果" : "",
        "莱因哈特烈焰打击目标击中效果" : "",
        "“西格玛”质量吸附击中效果" : "",
        "“黑百合”剧毒诡雷爆炸效果" : "",
        "温斯顿喷射背包着陆效果" : "",
        "“破坏球”重力坠击击中效果" : "",
        "“破坏球”地雷禁区爆炸效果" : ""
    },
    
    "默认字符串" : {
		// "" : "",
		// "*" : "",
		// "----------" : "",
		// "#{0}" : "",
		// "-> {0}" : "",
		// "<-> {0}" : "",
		// "<- {0}" : "",
		// "{0} ->" : "",
		// "{0} <->" : "",
		// "{0} <-" : "",
		// "{0} -> {1}" : "",
		// "{0} - {1}" : "",
		// "{0} != {1}" : "",
		// "{0} * {1}" : "",
		// "{0} / {1}" : "",
		// "{0} + {1}" : "",
		// "{0} <-> {1}" : "",
		// "{0} <- {1}" : "",
		// "{0} <= {1}" : "",
		// "{0} < {1}" : "",
		// "{0} == {1}" : "",
		// "{0} = {1}" : "",
		// "{0} >= {1}" : "",
		// "{0} > {1}" : "",
		// "{0} {1}" : "",
		// "{0} : {1} : {2}" : "",
		// "{0} {1} {2}" : "",
		// "({0})" : "",
		// "¡{0}!" : "",
		// "¿{0}?" : "",
		// "{0} 米" : "",
		// "{0} 米/秒" : "",
		// "{0}%" : "",
		// "{0}:" : "",
		// "{0}:{1}" : "",
		// "{0}和{1}" : "",
		// "{0}对阵{1}" : "",
		// "{0}秒" : "",
        // "{0}！" : "",
        // "{0}！！" : "",
        // "{0}！！！" : "",
		// "{0}，{1}" : "",
		// "{0}，{1}和{2}" : "",
		// "{0}：{1}" : "",
		// "{0}：{1}和{2}" : "",
        // "{0}？" : "",
        // "{0}？？" : "",
        // "{0}？？？" : "",
        // "！" : "",
        // "！！" : "",
        // "！！！" : "",
        // "……" : "",
        // "？" : "",
        // "？？" : "",
        // "？？？" : "",
        // "技能" : "",
        // "技能" : "",
        // "技能1" : "",
        // "技能2" : "",
        // "警报" : "",
        // "存活" : "",
        // "盟友" : "",
        // "弹药" : "",
        // "角度" : "",
        // "进攻" : "",
        // "已进攻" : "",
        // "正在进攻" : "",
        // "尝试" : "",
        // "平均" : "",
        // "躲避" : "",
        // "已躲避" : "",
        // "正在躲避" : "",
        // "后" : "",
        // "差" : "",
        // "屏蔽" : "",
        // "已屏蔽" : "",
        // "正在屏蔽" : "",
        // "最佳" : "",
        // "优秀" : "",
        // "加注" : "",
        // "阻挡" : "",
        // "已阻挡" : "",
        // "正在阻挡" : "",
        // "蓝色" : "",
        // "奖励" : "",
        // "首领" : "",
        // "已购买" : "",
        // "建造" : "",
        // "正在建造" : "",
        // "已建造" : "",
        // "点燃" : "",
        // "正在点燃" : "",
        // "已点燃" : "",
        // "购买" : "",
        // "正在购买" : "",
        // "夺取" : "",
        // "已夺取" : "",
        // "正在夺取" : "",
        // "危险" : "",
        // "中" : "",
        // "接受挑战" : "",
        // "魅力" : "",
        // "追击" : "",
        // "已追击" : "",
        // "正在追击" : "",
        // "检查点" : "",
        // "云朵" : "",
        // "梅花" : "",
        // "连击" : "",
        // "到这儿来" : "",
        // "条件" : "",
        // "恭喜" : "",
        // "连接" : "",
        // "已连接" : "",
        // "正在连接" : "",
        // "建筑" : "",
        // "控制点" : "",
        // "冷却时间" : "",
        // "腐化" : "",
        // "已腐化" : "",
        // "正在腐化" : "",
        // "货币" : "",
        // "货币" : "",
        // "严重" : "",
        // "蹲下" : "",
        // "已蹲下" : "",
        // "正在蹲下" : "",
        // "当前" : "",
        // "当前盟友" : "",
        // "当前尝试" : "",
        // "当前检查点" : "",
        // "当前敌人" : "",
        // "当前形态" : "",
        // "当前游戏" : "",
        // "当前英雄" : "",
        // "当前人质" : "",
        // "当前等级" : "",
        // "当前任务" : "",
        // "当前对象" : "",
        // "当前目标点" : "",
        // "当前阶段" : "",
        // "当前玩家" : "",
        // "当前回合" : "",
        // "当前目标" : "",
        // "当前升级" : "",
        // "伤害" : "",
        // "已伤害" : "",
        // "正在伤害" : "",
        // "危险" : "",
        // "已死亡" : "",
        // "发牌" : "",
        // "正在发牌" : "",
        // "已发牌" : "",
        // "牌堆" : "",
        // "战败" : "",
        // "防守" : "",
        // "已防守" : "",
        // "正在防守" : "",
        // "防御" : "",
        // "送达" : "",
        // "已送达" : "",
        // "正在送达" : "",
        // "深度" : "",
        // "干扰" : "",
        // "已干扰" : "",
        // "正在干扰" : "",
        // "摧毁" : "",
        // "已摧毁" : "",
        // "正在摧毁" : "",
        // "探测" : "",
        // "被探测" : "",
        // "正在探测" : "",
        // "灵巧" : "",
        // "方块" : "",
        // "死亡" : "",
        // "弃牌" : "",
        // "已弃牌" : "",
        // "正在弃牌" : "",
        // "断开" : "",
        // "已断开" : "",
        // "正在断开" : "",
        // "距离" : "",
        // "躲闪" : "",
        // "已躲闪" : "",
        // "正在躲闪" : "",
        // "罩子" : "",
        // "下" : "",
        // "下载" : "",
        // "已下载" : "",
        // "正在下载" : "",
        // "平局" : "",
        // "正在抽牌" : "",
        // "已抽牌" : "",
        // "掉落" : "",
        // "已掉落" : "",
        // "正在掉落" : "",
        // "正在死亡" : "",
        // "东" : "",
        // "消灭" : "",
        // "已消灭" : "",
        // "正在消灭" : "",
        // "敌人" : "",
        // "进入" : "",
        // "护送" : "",
        // "已护送" : "",
        // "正在护送" : "",
        // "优秀" : "",
        // "离开" : "",
        // "经验值" : "",
        // "极端" : "",
        // "面向" : "",
        // "正在面向" : "",
        // "已失败" : "",
        // "即将失败" : "",
        // "失败" : "",
        // "跌落" : "",
        // "已跌落" : "",
        // "正在跌落" : "",
        // "远" : "",
        // "快" : "",
        // "较快" : "",
        // "最快" : "",
        // "失误" : "",
        // "最终" : "",
        // "最终盟友" : "",
        // "最终尝试" : "",
        // "最终检查点" : "",
        // "最终敌人" : "",
        // "最终形态" : "",
        // "最终游戏" : "",
        // "最终英雄" : "",
        // "最终人质" : "",
        // "最终物品" : "",
        // "最终等级" : "",
        // "最终任务" : "",
        // "最终对象" : "",
        // "最终目标点" : "",
        // "最终阶段" : "",
        // "最终玩家" : "",
        // "最终回合" : "",
        // "最终目标" : "",
        // "最终时间" : "",
        // "最终升级" : "",
        // "寻找" : "",
        // "正在寻找" : "",
        // "结束" : "",
        // "已结束" : "",
        // "正在结束" : "",
        // "已飞行" : "",
        // "飞行" : "",
        // "正在飞行" : "",
        // "收起" : "",
        // "已收起" : "",
        // "正在收起" : "",
        // "表格" : "",
        // "前" : "",
        // "已找到" : "",
        // "冰冻" : "",
        // "正在冰冻" : "",
        // "已冰冻" : "",
        // "游戏" : "",
        // "战败场数" : "",
        // "胜利场数" : "",
        // "前往" : "",
        // "终点" : "",
        // "正在前往" : "",
        // "好" : "",
        // "好运" : "",
        // "再见" : "",
        // "绿色" : "",
        // "有罪" : "",
        // "入侵" : "",
        // "已入侵" : "",
        // "正在入侵" : "",
        // "手牌" : "",
        // "治疗" : "",
        // "已治疗" : "",
        // "治疗者" : "",
        // "正在治疗" : "",
        // "红桃" : "",
        // "心" : "",
        // "高度" : "",
        // "问候" : "",
        // "求助" : "",
        // "此处" : "",
        // "英雄" : "",
        // "已隐藏" : "",
        // "隐藏" : "",
        // "正在隐藏" : "",
        // "最高得分" : "",
        // "击中" : "",
        // "正在击中" : "",
        // "嗯" : "",
        // "人质" : "",
        // "哈" : "",
        // "狩猎" : "",
        // "已狩猎 " : "",
        // "猎人" : "",
        // "正在狩猎" : "",
        // "我放弃了" : "",
        // "我尽力了" : "",
        // "在视野中" : "",
        // "收入" : "",
        // "正在前来" : "",
        // "初始" : "",
        // "初始盟友" : "",
        // "初始尝试" : "",
        // "初始检查点" : "",
        // "初始敌人" : "",
        // "初始形态" : "",
        // "初始游戏" : "",
        // "初始英雄" : "",
        // "初始人质" : "",
        // "初始等级" : "",
        // "初始任务" : "",
        // "初始对象" : "",
        // "初始目标点" : "",
        // "初始阶段" : "",
        // "初始玩家" : "",
        // "初始回合" : "",
        // "初始目标" : "",
        // "初始升级" : "",
        // "无罪" : "",
        // "内" : "",
        // "智力" : "",
        // "互动" : "",
        // "不可见" : "",
        // "物品" : "",
        // "加入" : "",
        // "已加入" : "",
        // "正在加入" : "",
        // "跳跃" : "",
        // "正在跳跃" : "",
        // "击杀" : "",
        // "连杀" : "",
        // "队长" : "",
        // "最少" : "",
        // "左" : "",
        // "更少" : "",
        // "等级" : "",
        // "等级下降" : "",
        // "等级提升" : "",
        // "等级" : "",
        // "生命" : "",
        // "受限" : "",
        // "读取" : "",
        // "已读取" : "",
        // "正在读取" : "",
        // "坐标" : "",
        // "锁定" : "",
        // "已锁定" : "",
        // "正在锁定" : "",
        // "败者" : "",
        // "失败" : "",
        // "较大" : "",
        // "轻微" : "",
        // "较小" : "",
        // "任务" : "",
        // "放弃的任务" : "",
        // "任务完成" : "",
        // "失败的任务" : "",
        // "任务" : "",
        // "适中" : "",
        // "金钱" : "",
        // "怪物" : "",
        // "更多" : "",
        // "最多" : "",
        // "我的错" : "",
        // "近" : "",
        // "最新高分" : "",
        // "最新记录" : "",
        // "下一个" : "",
        // "下一批盟友" : "",
        // "下一个盟友" : "",
        // "下一次尝试" : "",
        // "下一个检查点" : "",
        // "下一批敌人" : "",
        // "下一个敌人" : "",
        // "下一个表格" : "",
        // "下一个游戏" : "",
        // "下一个英雄" : "",
        // "下一批英雄" : "",
        // "下一个人质" : "",
        // "下一批人质" : "",
        // "下一个等级" : "",
        // "下一个任务" : "",
        // "下一批对象" : "",
        // "下一个目标点" : "",
        // "下一个对象" : "",
        // "下一个阶段" : "",
        // "下一个玩家" : "",
        // "下一批玩家" : "",
        // "下一个回合" : "",
        // "下一个目标" : "",
        // "下一批目标" : "",
        // "下一个升级 " : "",
        // "表现不错" : "",
        // "否" : "",
        // "不用了" : "",
        // "无" : "",
        // "普通" : "",
        // "北" : "",
        // "东北" : "",
        // "西北" : "",
        // "算了吧" : "",
        // "对象" : "",
        // "目标点" : "",
        // "对象" : "",
        // "获取" : "",
        // "已获取" : "",
        // "正在获取" : "",
        // "关闭" : "",
        // "开启" : "",
        // "噢" : "",
        // "啊呀" : "",
        // "最佳" : "",
        // "优化" : "",
        // "已优化" : "",
        // "正在优化" : "",
        // "不在视野中" : "",
        // "正在远去" : "",
        // "外" : "",
        // "上方" : "",
        // "加时" : "",
        // "参与者" : "",
        // "运载目标" : "",
        // "阶段" : "",
        // "选取" : "",
        // "已选取" : "",
        // "正在选取" : "",
        // "堆" : "",
        // "打出" : "",
        // "已打出" : "",
        // "玩家" : "",
        // "正在打出" : "",
        // "点" : "",
        // "获得分数" : "",
        // "失去分数" : "",
        // "位置" : "",
        // "能量" : "",
        // "强化" : "",
        // "价格" : "",
        // "主要攻击模式" : "",
        // "飞弹" : "",
        // "飞弹" : "",
        // "保护" : "",
        // "已保护" : "",
        // "正在保护" : "",
        // "已净化" : "",
        // "净化" : "",
        // "正在净化" : "",
        // "亮紫色" : "",
        // "复活" : "",
        // "已复活" : "",
        // "正在复活" : "",
        // "排名" : "",
        // "等级 A" : "",
        // "等级 B" : "",
        // "等级 C" : "",
        // "等级 D" : "",
        // "等级 E" : "",
        // "等级 F" : "",
        // "等级 S" : "",
        // "前往" : "",
        // "已抵达" : "",
        // "正在前往" : "",
        // "就绪" : "",
        // "记录" : "",
        // "恢复" : "",
        // "已恢复" : "",
        // "正在恢复" : "",
        // "红色" : "",
        // "剩余" : "",
        // "营救" : "",
        // "已营救 " : "",
        // "正在营救" : "",
        // "资源" : "",
        // "复活" : "",
        // "已复活" : "",
        // "正在复活" : "",
        // "揭示" : "",
        // "已揭示" : "",
        // "正在揭示" : "",
        // "撤销" : "",
        // "已撤销" : "",
        // "正在撤销" : "",
        // "右" : "",
        // "回合" : "",
        // "战败回合数" : "",
        // "胜利回合数" : "",
        // "运行" : "",
        // "正在运行" : "",
        // "安全" : "",
        // "保存" : "",
        // "已保存" : "",
        // "正在保存" : "",
        // "分数" : "",
        // "辅助攻击模式" : "",
        // "保护" : "",
        // "已保护" : "",
        // "正在保护" : "",
        // "选择" : "",
        // "已选择" : "",
        // "正在选择" : "",
        // "出售" : "",
        // "正在出售" : "",
        // "服务器负载" : "",
        // "服务器负载平均值" : "",
        // "服务器负载峰值" : "",
        // "撕裂" : "",
        // "严重" : "",
        // "已撕裂" : "",
        // "正在撕裂" : "",
        // "商店" : "",
        // "洗牌" : "",
        // "已洗牌" : "",
        // "击沉" : "",
        // "正在击沉" : "",
        // "跳过" : "",
        // "已跳过" : "",
        // "正在跳过" : "",
        // "沉睡" : "",
        // "正在沉睡" : "",
        // "已沉睡" : "",
        // "慢" : "",
        // "较慢" : "",
        // "最慢" : "",
        // "已出售" : "",
        // "抱歉" : "",
        // "南" : "",
        // "东南" : "",
        // "西南" : "",
        // "黑桃" : "",
        // "火花" : "",
        // "孵化" : "",
        // "已孵化" : "",
        // "正在孵化" : "",
        // "速度" : "",
        // "球体" : "",
        // "球形" : "",
        // "稳定" : "",
        // "已稳定" : "",
        // "正在稳定" : "",
        // "存放宠物" : "",
        // "星星" : "",
        // "群星" : "",
        // "开始" : "",
        // "已开始" : "",
        // "正在开始" : "",
        // "状态" : "",
        // "停止" : "",
        // "走开" : "",
        // "已停止 " : "",
        // "正在停止" : "",
        // "阻止" : "",
        // "已阻止" : "",
        // "正在阻止" : "",
        // "力量" : "",
        // "击晕" : "",
        // "已击晕" : "",
        // "正在击晕" : "",
        // "次佳" : "",
        // "成功" : "",
        // "绝杀局" : "",
        // "已击沉" : "",
        // "强烈" : "",
        // "生存" : "",
        // "已生存" : "",
        // "正在生存" : "",
        // "目标" : "",
        // "队伍" : "",
        // "队友" : "",
        // "极差" : "",
        // "衷心感谢" : "",
        // "感谢" : "",
        // "太棒了" : "",
        // "威胁" : "",
        // "威胁等级" : "",
        // "绝杀局" : "",
        // "时间" : "",
        // "总计" : "",
        // "交易" : "",
        // "已交易" : "",
        // "正在交易" : "",
        // "叛徒" : "",
        // "转移" : "",
        // "已转移" : "",
        // "正在转移" : "",
        // "再来试试" : "",
        // "炮台" : "",
        // "呃" : "",
        // "终极技能" : "",
        // "下方" : "",
        // "未知" : "",
        // "不受限" : "",
        // "解锁" : "",
        // "已解锁" : "",
        // "正在解锁" : "",
        // "不安全" : "",
        // "不稳定" : "",
        // "上" : "",
        // "升级" : "",
        // "上传" : "",
        // "已上传" : "",
        // "正在上传" : "",
        // "使用技能 1" : "",
        // "使用技能 2" : "",
        // "使用终极技能" : "",
        // "胜利" : "",
        // "可见" : "",
        // "漩涡" : "",
        // "等待" : "",
        // "正在等待" : "",
        // "墙壁" : "",
        // "警告" : "",
        // "欢迎" : "",
        // "称赞" : "",
        // "西" : "",
        // "白色" : "",
        // "关键牌" : "",
        // "胜者" : "",
        // "胜利" : "",
        // "感知" : "",
        // "较差" : "",
        // "最差" : "",
        // "哇哦" : "",
        // "黄色" : "",
        // "是" : "",
        // "你" : "",
        // "你失败了" : "",
        // "你胜利了" : "",
        // "区域" : ""
    
    },
    
    "弹道类型" : {
        "球弹道" : "",
        "巴蒂斯特生化榴弹枪" : "",
        "“堡垒”A-36战术榴弹" : "",
        "“回声”黏性炸弹" : "",
        "源氏“镖”" : "",
        "卢西奥音速扩音器" : "",
        "“天使”天使冲击枪" : "",
        "莫伊拉伤害生化之球" : "",
        "莫伊拉治疗生化之球" : "",
        "奥丽莎聚变驱动器" : "",
        "“法老之鹰”火箭" : "",
        "莱因哈特烈焰打击" : "",
        "“路霸”爆裂枪" : "",
        "“路霸”爆裂枪废铁球" : "",
        "西格玛超能之球" : "",
        "“秩序之光”光子发射器" : "",
        "拉玛刹吞噬漩涡能量球" : "",
        "查莉娅重力喷涌" : "",
        "查莉娅粒子炮" : ""
    },
    
    "影响生命" : {
        "伤害" : "",
        "治疗" : ""
    },
    
    "弹道效果" : {
        "友善，位置，方向和大小" : "",
        "位置，方向和大小" : "",
        "可见" : "",
        "无" : "",
        "可见，友善，位置，方向和大小" : "",
        "友善，位置，方向和大小" : "",
        "可见，友善" : "",
        "友善" : ""
    },
    
    "视线检测" : {
        "关闭" : "",
        "表面" : "",
        "表面及敌方屏障" : "",
        "表面及全部屏障" : "",
    },
    
    "0000000" : {
        "0000000" : "",
    }
};

const format = {
    "规则：全局" : 
`规则("规则%1$s")
{
    事件
    {
        持续 - 全局;
    }

    条件
    {
        
    }

    动作
    {
        
    }
}
`,

    "规则：持续 - 每名玩家" : 
`规则("规则%1$s")
{
    事件
    {
        持续 - 每名玩家;
        双方;
        全部;
    }

    条件
    {
        
    }

    动作
    {
        
    }
}
`,

    "规则：子程序" : 
`规则("规则%1$s")
{
    事件
    {
        子程序;
        Sub0;
    }

    动作
    {
        
    }
}
`,
    
    "持续 - 每名玩家" : 
`持续 - 每名玩家;
双方;
全部;`,
    
    "玩家造成伤害" : 
`玩家造成伤害;
双方;
全部;`,
    
    "玩家受到伤害" : 
`玩家受到伤害;
双方;
全部;`,
    
    "玩家造成治疗" : 
`玩家造成治疗;
双方;
全部;`,
    
    "玩家受到治疗" : 
`玩家受到治疗;
双方;
全部;`,
    
    "玩家造成击退" : 
`玩家造成击退;
双方;
全部;`,

    "玩家受到击退" : 
`玩家受到击退;
双方;
全部;`,
    
    "玩家造成最后一击" : 
`玩家造成最后一击;
双方;
全部;`,
    
    "玩家阵亡" : 
`玩家阵亡;
双方;
全部;`,
    
    "玩家参与消灭" : 
`玩家参与消灭;
双方;
全部;`,
    
    "玩家加入比赛" : 
`玩家加入比赛;
双方;
全部;`,
    
    "玩家离开比赛" : 
`玩家离开比赛;
双方;
全部;`,
    
    "if" : `If(0 == 0);`,
    "else" : `Else;`,
    "else if" : `Else If(0 == 0);`,
    "end" : `End;`,
    "for玩家变量" : `For 玩家变量(事件玩家, A, 0, 数量(全局.A), 1);`,
    "for全局变量" : `For 全局变量(A, 0, 数量(全局.A), 1);`,
    "while" : `While(0 == 0);`,
    "if-then-else" : `ifff?then:else`,
    "余数" : `0 % 0`,

};

const update230412 = {
    "创建弹道" : {
        "描述" : "创建一个弹道实体，可对玩家或玩家拥有的实体造成治疗或伤害。如果已创建了太多的实体，此动作可能会失效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "弹道类型",
                "类型" : "弹道类型",
                "默认" : "球弹道",
                "说明" : "所创建弹道的类型。启用弹道地图工坊扩展后可添加新的选项。"
            },
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "拥有此弹道且会被归为击杀者的玩家。若为“空”，则弹道不被任何人拥有。弹道不会影响其拥有者。"
            },
            {
                "名称" : "开始位置",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "弹道的起始位置。若为“空”，则使用玩家的眼睛位置。"
            },
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "弹道的行动方向。若为“空”，则使用玩家的面朝方向。"
            },
            {
                "名称" : "相对",
                "类型" : "相对",
                "默认" : "至地图",
                "说明" : "弹道的起始位置和行动方向是相对于玩家还是地图。"
            },
            {
                "名称" : "修改生命效果类型",
                "类型" : "影响生命",
                "默认" : "伤害",
                "说明" : "此弹道对碰撞目标造成的是治疗还是伤害。"
            },
            {
                "名称" : "受影响的队伍",
                "类型" : "0000000",
                "默认" : "所有队伍",
                "说明" : "哪方队伍会被此弹道碰撞。不管弹道拥有者属于哪方队伍，弹道始终不会影响其拥有者。"
            },
            {
                "名称" : "数值",
                "类型" : "0000000",
                "默认" : "50",
                "说明" : "对弹道碰撞目标造成的伤害或治疗量。如果“爆炸范围”设置为大于0，此数值表示爆炸对中心位置造成的伤害。"
            },
            {
                "名称" : "数值缩放",
                "类型" : "0000000",
                "默认" : "1",
                "说明" : "如果“爆炸范围”设置为0，此值表示暴击时伤害的缩放量。如果“爆炸范围”设置为大于0，此值表示弹道在爆炸边缘处造成的伤害值。"
            },
            {
                "名称" : "爆炸范围",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此弹道所产生的爆炸范围。若为“0”，则弹道不会产生爆炸。"
            },
            {
                "名称" : "爆炸效果",
                "类型" : "基础播放效果",
                "默认" : "有害爆炸",
                "说明" : "弹道爆炸时应用的效果。如果“爆炸范围”为0，则不会创建此效果。"
            },
            {
                "名称" : "爆炸声音效果",
                "类型" : "基础播放效果",
                "默认" : "爆炸声音",
                "说明" : "弹道爆炸时应用的声音效果。如果“爆炸范围”为0，则不会创建此效果。"
            },
            {
                "名称" : "尺寸增幅",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此数值范围为0到1，表示该弹道尺寸增大的比例，0表示默认尺寸，1表示允许的最大尺寸。每种弹道类型允许的最大尺寸不同。"
            },
            {
                "名称" : "速度",
                "类型" : "0000000",
                "默认" : "10",
                "说明" : "弹道沿前进方向行动的速度，单位为米/秒。"
            },
            {
                "名称" : "存在时间",
                "类型" : "0000000",
                "默认" : "5",
                "说明" : "弹道存在多少秒后消失。"
            },
            {
                "名称" : "推力",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此弹道击中目标时施加的推力。如果“爆炸范围”设置为大于0，此推力会施加给受爆炸影响的所有目标。"
            },
            {
                "名称" : "弹射次数",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "弹道在环境中弹射多少次后消失。"
            },
            {
                "名称" : "引力",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "影响此弹道的引力值，产生一道弧线。若为负值，则弹道会产生上抛弧线。"
            }
        ]
    },

    "创建弹道效果" : {
        "描述" : "创建一个地图中的弹道效果实体。此实体会持续至消失为止。如果想引用此实体，可使用“上一个创建的实体”的返回值。如果已创建了太多的实体，此动作可能会失效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "可见",
                "类型" : "0000000",
                "默认" : "所有玩家(所有队伍)",
                "说明" : "一名或多名玩家将可以看到此效果。"
            },
            {
                "名称" : "弹道类型",
                "类型" : "弹道类型",
                "默认" : "球弹道",
                "说明" : "所创建弹道的类型。启用弹道地图工坊扩展后可添加新的选项。"
            },
            {
                "名称" : "友善",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "弹道将对下列玩家友善。"
            },
            {
                "名称" : "位置",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "此效果的位置。"
            },
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "矢量(0, 0, 0)",
                "说明" : "此效果的面朝方向。"
            },
            {
                "名称" : "尺寸增幅",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此数值范围为0到1，表示该弹道尺寸增大的比例，0表示默认尺寸，1表示允许的最大尺寸。每种弹道类型允许的最大尺寸不同。"
            },
            {
                "名称" : "重新赋值",
                "类型" : "弹道效果",
                "默认" : "友善，位置，方向和大小",
                "说明" : "弹道将对下列玩家友善。"
            }
        ]
    },

    "创建追踪弹道" : {
        "描述" : "创建一个弹道实体，可对玩家或玩家拥有的实体造成治疗或伤害。弹道会按强度变量追踪给定目标。如果已创建了太多的实体，此动作可能会失效。",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "弹道类型",
                "类型" : "弹道类型",
                "默认" : "球弹道",
                "说明" : "所创建弹道的类型。启用弹道地图工坊扩展后可添加新的选项。"
            },
            {
                "名称" : "玩家",
                "类型" : "0000000",
                "默认" : "事件玩家",
                "说明" : "拥有此弹道且会被归为击杀者的玩家。若为“空”，则弹道不被任何人拥有。弹道不会影响其拥有者。"
            },
            {
                "名称" : "开始位置",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "弹道的起始位置。若为“空”，则使用玩家的眼睛位置。"
            },
            {
                "名称" : "方向",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "弹道的行动方向。若为“空”，则使用玩家的面朝方向。"
            },
            {
                "名称" : "相对",
                "类型" : "相对",
                "默认" : "至地图",
                "说明" : "弹道的起始位置和行动方向是相对于玩家还是地图。"
            },
            {
                "名称" : "修改生命效果类型",
                "类型" : "影响生命",
                "默认" : "伤害",
                "说明" : "此弹道对碰撞目标造成的是治疗还是伤害。"
            },
            {
                "名称" : "受影响的队伍",
                "类型" : "0000000",
                "默认" : "所有队伍",
                "说明" : "哪方队伍会被此弹道碰撞。不管弹道拥有者属于哪方队伍，弹道始终不会影响其拥有者。"
            },
            {
                "名称" : "数值",
                "类型" : "0000000",
                "默认" : "50",
                "说明" : "对弹道碰撞目标造成的伤害或治疗量。如果“爆炸范围”设置为大于0，此数值表示爆炸对中心位置造成的伤害。"
            },
            {
                "名称" : "数值缩放",
                "类型" : "0000000",
                "默认" : "1",
                "说明" : "如果“爆炸范围”设置为0，此值表示暴击时伤害的缩放量。如果“爆炸范围”设置为大于0，此值表示弹道在爆炸边缘处造成的伤害值。"
            },
            {
                "名称" : "爆炸范围",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此弹道所产生的爆炸范围。若为“0”，则弹道不会产生爆炸。"
            },
            {
                "名称" : "爆炸效果",
                "类型" : "基础播放效果",
                "默认" : "有害爆炸",
                "说明" : "弹道爆炸时应用的效果。如果“爆炸范围”为0，则不会创建此效果。"
            },
            {
                "名称" : "爆炸声音效果",
                "类型" : "基础播放效果",
                "默认" : "爆炸声音",
                "说明" : "弹道爆炸时应用的声音效果。如果“爆炸范围”为0，则不会创建此效果。"
            },
            {
                "名称" : "尺寸增幅",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此数值范围为0到1，表示该弹道尺寸增大的比例，0表示默认尺寸，1表示允许的最大尺寸。每种弹道类型允许的最大尺寸不同。"
            },
            {
                "名称" : "速度",
                "类型" : "0000000",
                "默认" : "10",
                "说明" : "弹道沿前进方向行动的速度，单位为米/秒。"
            },
            {
                "名称" : "存在时间",
                "类型" : "0000000",
                "默认" : "5",
                "说明" : "弹道存在多少秒后消失。"
            },
            {
                "名称" : "推力",
                "类型" : "0000000",
                "默认" : "0",
                "说明" : "此弹道击中目标时施加的推力。如果“爆炸范围”设置为大于0，此推力会施加给受爆炸影响的所有目标。"
            },
            {
                "名称" : "追踪目标",
                "类型" : "0000000",
                "默认" : "空",
                "说明" : "此弹道追踪的目标。如果为“空”，弹道会沿直线行动。"
            },
            {
                "名称" : "追踪强度",
                "类型" : "0000000",
                "默认" : "0.500",
                "说明" : "此数值范围为0到1，表示该弹道追踪目标的强度，以及跟丢目标的难易度。0表示弹道完全不会追踪目标，1表示弹道会积极追踪目标且绝不会跟丢。"
            }
        ]
    },



};

/* 预设

//类型1：
,

"0000000" : {
    "0000000" : "0000000",
    "0000000" : "0000000",
    "0000000" : "0000000"
},

//类型2：
    "0000000" : {
        "描述" : "0000000",
        "返回" : "无",
        "参数" : [
            {
                "名称" : "0000000",
                "类型" : "0000000",
                "默认" : "0000000",
                "说明" : "0000000"
            },
            {
                "名称" : "0000000",
                "类型" : "0000000",
                "默认" : "0000000",
                "说明" : "0000000"
            }
        ]
    }
    

*/

//#endregion



//#region 信息整合
//--------------------------------- 信息整合 ---------------------------------
let missingCharPinyin = "";
var constantsKeywordObj = {};
for (let i = 0; i < Object.keys(constants).length; i++) {
    Object.assign(constantsKeywordObj, constants[Object.keys(constants)[i]]);
}
const constKeyList   = Object.keys(constantsKeywordObj);

const keywordObj = Object.assign({}, actions, variables, IDs, boolean, numbers, others, players, vectors, angles, arrays, strings, colors, update230412);
const keyList   = Object.keys(keywordObj);


//------------------- 完整的动作参考,补全的默认值 -------------------
//补全用
var referInfo = {};
Object.assign(referInfo, constantsKeywordObj);
Object.assign(referInfo, referInfoObj(keyList, keywordObj));

//悬停用
var hoverReferInfo = {};
Object.assign(hoverReferInfo, constantsKeywordObj);
Object.assign(hoverReferInfo, referInfoObj(keyList, keywordObj, "名称"));

//const referInfo = referInfoObj(keyList, keywordObj);
function referInfoObj(keyList, obj, type = "默认") {
    let infoObj = {};
    for (let i = 0; i < keyList.length; i++) {
        let keyName = keyList[i];
        let keyObj = obj[keyName];
        let value = buildReferInfo(keyObj.参数, keyName, type);
        if (keyName in specialKeyword.修改) {
            value += "\n或 ";
            value += specialKeyword.修改[keyName];
        }
        else if (keyName in specialKeyword.设置) {
            value = specialKeyword.设置[keyName];
        }
        infoObj[keyName] = value;
    }
    return infoObj;
}
function buildReferInfo(argArray, objName, type) {//把动作名和参数默认值拼合起来  
    let refer = objName;
    if (argArray.length === 0) {
        return refer;
    }
    refer += "(";
    for (let i = 0; i < argArray.length; i++) {
        refer += argArray[i][type];
        if (i < argArray.length - 1) {
            refer += ", ";
        }
    }
    refer += ")";
    return refer;
}
//------------------------------------------------

//------------------- 代码补全 -------------------
const funcCompItemList = buildCompItemList(keyList, keywordObj);
const constCompItemList = buildCompItemList(constKeyList, constantsKeywordObj);
const compItemList = funcCompItemList.concat(constCompItemList);

function buildCompItemList(keyList, obj) {
    let list = [];
    for (let i = 0; i < keyList.length; i++) {
        let keyName = keyList[i];
        
        let item = itemSetting(keyName, obj);

        if (keyName in specialKeyword.设置) {
            item.label = specialKeyword.设置[keyName];
            item.insertText = specialKeyword.设置[keyName];
        }

        list.push(item);

        if (keyName in specialKeyword.修改) {
            let item = itemSetting(keyName, obj);
            item.label = specialKeyword.修改[keyName];
            item.insertText = specialKeyword.修改[keyName];
            list.push(item);
        }
    }
    return list;
}
function itemSetting(keyName, obj) {
    let item = new vscode.CompletionItem();
    let keyReference = "";
    let keyDescription = "";
    if (typeof obj[keyName] === "string") {
        keyReference = keyName;
        keyDescription = obj[keyName];
    }
    else if (typeof obj[keyName] === "object") {
        keyReference = referInfo[keyName];
        keyDescription = obj[keyName].描述;
    }

    item.label = keyName;
    item.insertText = keyReference; 
    item.filterText = addSpaceBetweenChar(keyName) + buildPinyinInfo(keyName);
    item.documentation = new vscode.MarkdownString("```owl\n" + keyReference + "\n```\n" + keyDescription);
    //item.documentation = keyReference + "\n" + keyDescription;

    if (typeof obj[keyName] === "string") {
        item.kind = vscode.CompletionItemKind.Value;
    }
    else if (typeof obj[keyName] === "object") {
        item.kind = vscode.CompletionItemKind.Function;
    }
    return item;
}
function addSpaceBetweenChar(str) {//在汉字之间插入空格，使得每个汉字都可以被单独检索到     
    let newStr = "";
    for (let i = 0; i < str.length; i++) {
        let clip = str.slice(i, i+1);
        newStr += clip + " ";
    }
    return newStr;
}
function buildPinyinInfo(str) {
    let pinyin = "";
    for (let i = 0; i < str.length; i++) {
        let yinJie = "";
        let clip = str.slice(i, i+1);
        if (clip.search(/[ \w“”（）？！…，：\.\+\-\*\/\#\>\<\=\¿\?\:\{\}\(\)\!\¡\%]/) === 0) {
            continue;
        }
        if (clip in pinyinDict === false && missingCharPinyin.indexOf(clip) === -1) {
            missingCharPinyin += clip;
            // pp("这个字还没有录入拼音：" + clip)
        }
        else {
            yinJie = pinyinDict[clip];
        }
        pinyin += yinJie;
    }
    return pinyin;
}


var rulesCount = 0;
function buildFormatCompItem(obj) {
    let list = [];
    let keyList = Object.keys(obj);
    for (let i = 0; i < keyList.length; i++) {
        let keyName = keyList[i];
        let text = obj[keyName].replace("%1$s", rulesCount + 1);
        let item = new vscode.CompletionItem();
        item.label = keyName + "(预设)";
        item.insertText = text;
        item.filterText = addSpaceBetweenChar(keyName) + buildPinyinInfo(keyName);
        item.documentation = new vscode.MarkdownString("```owl\n" + text + "\n```");
        item.kind = vscode.CompletionItemKind.Class;
        list.push(item);
    }
    return list;
}

//------------------------------------------------

//------------------- 悬停信息 -------------------
var constHoverInfo = {};
for (let i = 0; i < constKeyList.length; i++) {
    constHoverInfo[constKeyList[i]] = "```owl\n" + constKeyList[i] + "\n" + constantsKeywordObj[constKeyList[i]] + "\n```\n";
}

var hoverInfo = {};
Object.assign(hoverInfo, constHoverInfo);

Object.assign(hoverInfo, hoverObj(keyList, keywordObj));

//const hoverInfo = hoverObj(keyList, keywordObj);
function hoverObj(keyList, obj) {//创建悬停信息对象     
    let infoObj = {};
    for (let i = 0; i < keyList.length; i++) {
        let keyName = keyList[i];
        let keyObj = obj[keyName];
        let value = buildHoverInfo(keyObj, keyName);
        infoObj[keyName] = value;
    }
    return infoObj;
}
function buildHoverInfo(obj, keyName) {//设置悬停信息格式    
    let str             = "";

    let _description    = obj.描述;
    let _return         = obj.返回;
    let _reference      = "\`\`\`owl\n " + hoverReferInfo[keyName] + " ⇢ " + _return + "\n\`\`\`\n";
    let _argArray       = obj.参数;
    _reference += "> " + _description;

    // if (_argArray.length > 0){
    //     let _arg = "\n| | |\n:----: | :----\n";
    //     for (let i = 0; i < _argArray.length; i++) {
    //         let argName = _argArray[i].名称;
    //         let argDescription = _argArray[i].说明;
    //         _arg += "| " + argName + " | " + argDescription + "|\n";
    //     }
    //     _arg += "| | |";
    //     str = _reference + _arg;
    // }
    if (_argArray.length > 0){
        let _arg = "";
        for (let i = 0; i < _argArray.length; i++) {
            let argName = _argArray[i].名称;
            let argDescription = _argArray[i].说明;
            _arg += "\n[ " + argName + " ]> " + argDescription + "\n";
        }
        str = _reference + _arg;
    }

    return str;
}

//------------------------------------------------

//------------------- 参数指引 -------------------
const sigHelpInfo = sigHelpObj(keyList, keywordObj);
function sigHelpObj(keyList, obj) {
    let infoObj = {};
    for (let i = 0; i < keyList.length; i++) {
        let keyName = keyList[i];
        let keyObj = obj[keyName];
        let value = buildSigHelpInfo(keyObj, keyName);
        infoObj[keyName] = value;
    }
    return infoObj;
}
function buildSigHelpInfo(obj, objName) {//返回参数指引的文本     
    let paramInfo = [];
    let argArray = obj.参数;
    let sigStr = "";
    sigStr += objName + "(";

    for (let i = 0; i < argArray.length; i++) {
        let argName         = argArray[i].名称;
        let argDescription  = argArray[i].说明;
        if ("类型" in argArray[i] ) {
            if (argArray[i].类型 !== null && argArray[i].类型 !== "0000000") {
                let argType     = argArray[i].类型;
                let argStr      =  buildArgInfoString(argType);
                argDescription += "\n\n可选参数：" + argStr;
                argDescription = new vscode.MarkdownString(argDescription);
            }
            //console.log(objName + "的参数" + i + "的类型未定义")
        }
        paramInfo.push(new vscode.ParameterInformation([sigStr.length, sigStr.length + argName.length], argDescription));
        sigStr += argName;
        if (i < argArray.length-1) {
            sigStr += ", ";
        }
    }

    sigStr += ")";

    if (obj.返回 === "无") {
        sigStr += " ⇢ 无";
        // sigStr += "    返回值：" + obj.返回;
    } else {
        sigStr += " ⇢ " + obj.返回;
    }
    
    let sigInfo = new vscode.SignatureInformation(sigStr);
    sigInfo.parameters = paramInfo;

    let sigHelp = new vscode.SignatureHelp();
    //sigHelp.activeSignature = 0;
    //sigHelp.activeParameter = argIndex;
    sigHelp.signatures = [sigInfo];

    return sigHelp;
}
function buildArgInfoString(argType) {//返回可选参数和参数描述的文本    
    if (argType === null) {
        let err = "sigHelp error: 类型值为\"" + argType + "\""
        console.log(err);
        return err;
    }
    if (argType in constants === false) {
        let err = "sigHelp error: 无法在类型列表里找到\"" + argType + "\""
        console.log(err);
        return err;
    }
    let argObj          = constants[argType];
    let argKeyList      = Object.keys(argObj);
    let argStr  = "";

    for (let i = 0; i < argKeyList.length; i++) {
        argStr += "\n- `" + argKeyList[i] + "` : " + argObj[argKeyList[i]];
    }

    return argStr;
}
//------------------------------------------------

// if (missingCharPinyin.length > 0) {
//     pp("下列字符未匹配拼音：" + missingCharPinyin)
// }

//#endregion



//#region 执行插件

const bracketsLeft     = ["(", "[", "{"];
const bracketsRight    = [")", "]", "}"];
const quotes            = ["\"", "'", "`"];
const specialState    = ["持续", "全局", "每名玩家", "-"]


function detectKeyword(doc, pos) {
    let isInString = false;//用于判断是否检测到了字符串
    let currentQuote = "";//用于储存字符串的引号类型
    let currentArgIndex = 0;//当前函数的参数索引
    let nestLayers = 0;//函数的嵌套层数

    let i = -1;
    for (; i >= -pos.character + 1; i--) {//检测光标所在位置的函数名和参数索引
        let currentChar = doc.getText(new vscode.Range(pos.translate(0, i+1), pos.translate(0, i)));//向左逐个获取字符(包括刚刚输入的字符)
        if (!isInString) {
            if (quotes.indexOf(currentChar) !== -1) {//遇到引号时，转变为字符串模式
                //pp("进入字符串模式：" + currentChar + " " + i);
                isInString = true;
                currentQuote = currentChar;
            }
            else if (nestLayers === 0 && currentChar === ",") {//遇到逗号且嵌套层数为0时，当前参数索引增加
                currentArgIndex++;
            }
            else if (bracketsRight.indexOf(currentChar) !== -1) {//遇到右括号时，增加嵌套层数
                nestLayers++;
            }
            else if (bracketsLeft.indexOf(currentChar) !== -1) {//遇到左括号时，减少嵌套层数
                nestLayers--;
                if (nestLayers < 0 && currentChar === "(") {//当遇到左括号且嵌套层数小于0时，立即停止循环
                    //pp("检测到“(”立刻退出循环");
                    break;
                }
            }
        }
        else {//当前字符串与记录的引号相同，且当前字符串的前一个字符不是反斜杠，或i为0时，退出字符串模式
            if (currentChar === currentQuote && (i === 0 || doc.getText(new vscode.Range(pos.translate(0, i), pos.translate(0, i-1))) !== "\\")) {
                //pp("退出字符串模式：" + currentChar + " " + i);
                isInString = false;
            }
        }
    }
    // pp(nestLayers)

    //------------- 步骤2：检测 -------------
    if (isInString) {
        let err = "正在输入字符串";
        return err;
    }
    let range = doc.getWordRangeAtPosition(pos.translate(0, i));
    if (range === undefined) {
        let err = "没有检测到关键词";
        return err;
    }
    let funcName = doc.getText(range);
    let funcKeywordList = Object.keys(keywordObj);
    if (funcKeywordList.indexOf(funcName) === -1) {
        let err = "列表中没有匹配的关键词：" + funcName;
        return err;
    }
    let funcObj = keywordObj[funcName];
    if (funcObj.参数.length === 0) {
        let err = "这个动作不需要参数";
        return err;
    }

    return [funcName, currentArgIndex, nestLayers];
}

function argRemind(doc, pos) {
    let result = detectKeyword(doc, pos);
    if (typeof result === "string") {
        pp("代码补全error：" + result);
        return;
    }

    let funcName = result[0];
    let currentArgIndex = result[1];
    let nestLayers = result[2];
    pp("嵌套层数：" + nestLayers)

    if (!funcName in keywordObj) {
        pp("列表中找不到" + funcName);
        return;
    }

    let funcObj = keywordObj[funcName];
    if (funcObj.参数.length === 0) {
        pp(funcName + "不需要参数");
        return;
    }

    let arg = funcObj.参数[currentArgIndex];
    if ("类型" in arg === false || arg.类型 === null || arg.类型 === "0000000") {
        pp(funcName + "的参数" + currentArgIndex + "没有可选项");
        return;
    }

    let argType = arg.类型;
    let newList = constCompItemList.filter(item => Object.keys(constants[argType]).indexOf(item.label) !== -1);
    return newList;
}

function builConstKeywordInfo(doc, pos, keyword) {
    let result = detectKeyword(doc, pos);
    let constKeywordInfo = "";
    if (typeof result === "object") {
        let funcName = result[0];
        let currentArgIndex = result[1];
        let type = keywordObj[funcName].参数[currentArgIndex].类型;
        if (type === "0000000") {
            pp("悬停信息：类型为占位符");
            return "";
        }
        let otherOptionObj = constants[type];
        let otherOptionList = Object.keys(otherOptionObj);
        constKeywordInfo = "此处还可以选择：\n\n";
        for (let i = 0; i < otherOptionList.length; i++) {
            if (otherOptionList[i] !== keyword) {
                constKeywordInfo += "`" + otherOptionList[i] + "`";
                let description = otherOptionObj[otherOptionList[i]];
                if (description !== "") {
                    constKeywordInfo += ": " + otherOptionObj[otherOptionList[i]];
                }
                constKeywordInfo += "\n\n";
            }
        }
    }
    pp("悬停信息：" + result);
    return constKeywordInfo;
}

function searchRuleName(str) {
    let name = "";
    if (str.search(/^(设置|变量|子程序)$/g) !== -1) {
        name = str.slice(0, str.length);
        return name;
    }
    if (str.search(/规则\("[\W\w]*"\)/g) === -1) {
        name = "⚠️无效的规则名";
        return name;
    }
    name = str.replace(/(^(禁用 )|规则\("|"\))/g, "");
    if (name.length === 0) {
        name = "❔未命名规则";
    }
    return name;
}

function searchEventType(document, lineIndex, forLimit) {
    let type = "⚠️找不到事件类型，或空行太多";
    let i = lineIndex;
    for (; i < lineIndex + forLimit; i++) {
        if (document.lineAt(i).text.indexOf(";") !== -1) {
            break;
        }
    }
    let str = document.lineAt(i).text;

    let j = 0;
    for (; j < str.length; j++) {
        if (str.slice(j, j+1) !== "\t") {
            break;
        }
    }
    str = str.slice(j, str.length - 1);
    if (str in constants.事件 === false) {
        type = "⚠️无效的事件类型";
        return type;
    }
    if (str.length > 0) {
        type = str;
    }
    return type;
}

//TODO 查找预设变量名称
let presetVariableNameRecord = [];
function searchPresetVariableName(document, lineIndex=0, forLimit=300) {
    let list = [];
    let startRecord = false;
    let nameRegx = /(?=.*[a-zA-Z])([\t\d]*: )([\w]*)/;
    let nameClassRegx = /(变量|子程序)/;
    let nameClass = "";
    let nameObjectRegx = /(全局|玩家)/;
    let nameObject = "";
    let tip = "";
    let recordNum = 0;
    let i = lineIndex;
    for (; i < lineIndex + forLimit; i++) {
        let line = document.lineAt(i);
        if (nameClassRegx.test(line.text)) { // 是否进入记录模式
            nameClass = nameClassRegx.exec(line.text)[0];
            startRecord = true;
            recordNum += 1;
        }
        if (startRecord && line.text.startsWith("}")) { // 退出记录模式
            startRecord = false;
            tip = "";
            if (recordNum >= 2) {
                break;
            }
        }
        if (startRecord) {
            if (nameClass === "变量" && nameObjectRegx.test(line.text)){
                nameObject = nameObjectRegx.exec(line.text)[0];
                tip = nameObject + nameClass;
            }
            else if (nameClass === "子程序") {
                tip = nameClass;
            }
            let name = line.text.replace(nameRegx, "$2");
            let item = new vscode.CompletionItem();
            item.label = name + ` (${tip})`;
            item.insertText = name;
            item.filterText = name;
            item.kind = vscode.CompletionItemKind.Variable;
            list.push(item);
            presetVariableNameRecord.push(name);
        }
    }
    return list;
}

//TODO 查找全文变量名称
function searchUndefineVariableName(document) {
    let list = [];
    let nameList = [];
    let nameRegx = /(?<=[.(])(?=.*[a-zA-Z])([\w]+)/gi;
    let _range = new vscode.Range(0, 0, document.lineCount+1, 0);
    let text = document.getText(_range);
    
    nameList = nameList.concat(text.match(nameRegx));
    for (let i = 0; i < nameList.length; i++) {
        let name = nameList[i];
        if (presetVariableNameRecord.includes(name)) {
            continue;
        }
        let item = new vscode.CompletionItem();
        item.label = name + " (未定义)";
        item.insertText = name;
        item.filterText = name;
        item.kind = vscode.CompletionItemKind.Variable;
        list.push(item);
    }
    return list;
}

function searchCompleteKeyword(doc, pos) {
    let keyword = "🍀";
    for (let i = 0; i < 9; i++) {
        let char = doc.getText(new vscode.Range(pos.translate(0, i), pos.translate(0, i+1)));
        if ("全局".indexOf(char) !== -1) {
            keyword = "持续 - 全局";
            break;
        }
        else if ("每名玩家".indexOf(char) !== -1) {
            keyword = "持续 - 每名玩家";
            break;
        }
    }
    return keyword;
}

function builSpecialKeywordInfo(keyword) {
    let constKeywordInfo = "";
    let otherOptionObj = constants["事件"];
    let otherOptionList = Object.keys(otherOptionObj);
    constKeywordInfo = "此处还可以选择：\n\n";
    for (let i = 0; i < otherOptionList.length; i++) {
        if (otherOptionList[i] !== keyword) {
            constKeywordInfo += "`" + otherOptionList[i] + "`";
            let description = otherOptionObj[otherOptionList[i]];
            if (description !== "") {
                constKeywordInfo += ": " + otherOptionObj[otherOptionList[i]];
            }
            constKeywordInfo += "\n\n";
        }
    }
    return constKeywordInfo;
}

function activate(context) {
    vscode.window.showInformationMessage('owl插件已激活!');

    //---------------------------------------- 悬停信息 ----------------------------------------
    vscode.languages.registerHoverProvider('owl', {
        provideHover(document, position, token) {
            let constKeywordInfo = "";
            let keyword = document.getText(document.getWordRangeAtPosition(position));
            let char = document.getText(new vscode.Range(position.translate(0, 1), position.translate(0, 4)));
            if (specialState.indexOf(keyword) !== -1 && char.indexOf(".") === -1) {
                keyword = searchCompleteKeyword(document, position);
                constKeywordInfo = builSpecialKeywordInfo(keyword);
            }
            else if (keyword in constantsKeywordObj) {
                constKeywordInfo = builConstKeywordInfo(document, position, keyword);
            }

            if (keyword in hoverInfo) {
                pp("Hover: " + keyword);
                let string = hoverInfo[keyword] + constKeywordInfo;
                return new vscode.Hover(string);
            }
        }
    });

    //---------------------------------------- 参数指引 ----------------------------------------
    vscode.languages.registerSignatureHelpProvider('owl', {
        provideSignatureHelp(document, position, token, context) {
            //结束指引
            if (context.triggerCharacter === ')') {
                return;
            }

            let result = detectKeyword(document, position);
            if (typeof result === "string") {
                pp("参数指引：" + result);
                return;
            }

            let funcName = result[0];
            let currentArgIndex = result[1];

            let sigHelp = sigHelpInfo[funcName];
            sigHelp.activeParameter = currentArgIndex;
            pp("func: " + funcName + ", arg index: " + currentArgIndex);
            return sigHelp;

        }

    }, ',', '(', ')');

    //---------------------------------------- 代码补全 ----------------------------------------
    vscode.languages.registerCompletionItemProvider("owl", {
        provideCompletionItems(document, position, token, context) {
            if (context.triggerCharacter === ',' || context.triggerCharacter === '(') {
                let newList = argRemind(document, position);
                return newList;
            }

            //TODO 全文变量名称
            let presetVariableName = searchPresetVariableName(document);
            let undefineVariableName = searchUndefineVariableName(document);
            let formatCompItemList = buildFormatCompItem(format);
            // let list = compItemList.concat(formatCompItemList, presetVariableName);
            let list = compItemList.concat(formatCompItemList, presetVariableName, undefineVariableName);
            return list;
        }
        
    }, ',', '(');

    //---------------------------------------- 规则大纲 ----------------------------------------
    vscode.languages.registerDocumentSymbolProvider("owl", {
        provideDocumentSymbols(document, token) {
            return new Promise((resolve, reject) => {
                let symbolList = [];
                let foldList = [symbolList];
                let fold = true;
                let count = 0;
                
                for (let i = 0; i < document.lineCount; i++) {
                    let line = document.lineAt(i);
                    
                    if (line.text.startsWith("规则")) {
                        let symbol = new vscode.DocumentSymbol(
                            searchRuleName(line.text), // 规则名称
                            searchEventType(document, i, 5), // 事件类型
                            vscode.SymbolKind.Interface, // 规则图标
                            line.range, // ？
                            line.range // ？
                        );
                        // symbolList.push(symbol);

                        foldList[foldList.length-1].push(symbol)
                        if (fold) {
                            foldList.push(symbol.children);
                            fold = false;
                        }
                        count += 1;
                    }

                    else if (line.text.startsWith("禁用 规则")) {
                        let symbol = new vscode.DocumentSymbol(
                            "❌ " + searchRuleName(line.text),
                            searchEventType(document, i, 5),
                            vscode.SymbolKind.Interface,
                            line.range,
                            line.range
                        );
                        // symbolList.push(symbol);

                        foldList[foldList.length-1].push(symbol)
                        if (fold) {
                            foldList.push(symbol.children);
                            fold = false;
                        }
                        count += 1;
                    }
                    
                    else if (line.text.startsWith("子程序")) {
                        let symbol = new vscode.DocumentSymbol(
                            searchRuleName(line.text),
                            "",
                            vscode.SymbolKind.Property,
                            line.range,
                            line.range
                        );
                        // symbolList.push(symbol);

                        foldList[foldList.length-1].push(symbol)
                        if (fold) {
                            foldList.push(symbol.children);
                            fold = false;
                        }
                        count += 1;
                    }
                    
                    else if (line.text.startsWith("变量")) {
                        let symbol = new vscode.DocumentSymbol(
                            searchRuleName(line.text),
                            "",
                            vscode.SymbolKind.Property,
                            line.range,
                            line.range
                        );
                        // symbolList.push(symbol);

                        foldList[foldList.length-1].push(symbol)
                        if (fold) {
                            foldList.push(symbol.children);
                            fold = false;
                        }
                        count += 1;
                    }
                    
                    else if (line.text.startsWith("设置")) {
                        let symbol = new vscode.DocumentSymbol(
                            searchRuleName(line.text),
                            "",
                            vscode.SymbolKind.Property,
                            line.range,
                            line.range
                        );
                        // symbolList.push(symbol);

                        foldList[foldList.length-1].push(symbol)
                        if (fold) {
                            foldList.push(symbol.children);
                            fold = false;
                        }
                        count += 1;
                    }

                    else if (line.text.startsWith("}")) { 
                        if (!fold) {
                            foldList.pop();
                            fold = true;
                        }
                    }
/* 

                    else if (line.text.startsWith("	事件")) {
                        let symbol = new vscode.DocumentSymbol(
                            searchEventType(document, i, 3),
                            "",
                            vscode.SymbolKind.Enum,
                            line.range,
                            line.range
                        );
                        // symbolList.push(symbol);

                        foldList[foldList.length-1].push(symbol)
                        if (fold) {
                            foldList.push(symbol.children);
                            fold = false;
                        }
                    } 
 */
                }
                rulesCount = count;
                resolve(symbolList);
            });
        }
    });


}

//#endregion


function pp(string) {//Debug
    console.log(string);
}

module.exports = {
    activate
};

